#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbstractWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AbstractWidget.AbstractWidget_C.ExecuteUbergraph_AbstractWidget
// 0x00C0 (0x00C0 - 0x0000)
struct AbstractWidget_C_ExecuteUbergraph_AbstractWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Target_ImplicitCast;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Target_ImplicitCast_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast_1; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_1; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget) == 0x000008, "Wrong alignment on AbstractWidget_C_ExecuteUbergraph_AbstractWidget");
static_assert(sizeof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget) == 0x0000C0, "Wrong size on AbstractWidget_C_ExecuteUbergraph_AbstractWidget");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, EntryPoint) == 0x000000, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000008, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x00000C, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, K2Node_Event_MyGeometry) == 0x000010, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, K2Node_Event_InDeltaTime) == 0x000048, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000050, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_FInterpTo_Constant_ReturnValue_1) == 0x000058, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_FInterpTo_Constant_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, K2Node_Event_IsDesignTime) == 0x000068, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000069, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_FInterpTo_Constant_Current_ImplicitCast) == 0x000078, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_FInterpTo_Constant_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_FInterpTo_Constant_Target_ImplicitCast) == 0x000080, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_FInterpTo_Constant_Target_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast) == 0x000088, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_FInterpTo_Constant_Target_ImplicitCast_1) == 0x000090, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_FInterpTo_Constant_Target_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_FInterpTo_Constant_Current_ImplicitCast_1) == 0x000098, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_FInterpTo_Constant_Current_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast) == 0x0000A8, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_1) == 0x0000B0, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000B8, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_ExecuteUbergraph_AbstractWidget, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000BC, "Member 'AbstractWidget_C_ExecuteUbergraph_AbstractWidget::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function AbstractWidget.AbstractWidget_C.GetPercent
// 0x0020 (0x0020 - 0x0000)
struct AbstractWidget_C_GetPercent final
{
public:
	double                                        PercentValue;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_PercentValue_ImplicitCast;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_PercentValue_ImplicitCast_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbstractWidget_C_GetPercent) == 0x000008, "Wrong alignment on AbstractWidget_C_GetPercent");
static_assert(sizeof(AbstractWidget_C_GetPercent) == 0x000020, "Wrong size on AbstractWidget_C_GetPercent");
static_assert(offsetof(AbstractWidget_C_GetPercent, PercentValue) == 0x000000, "Member 'AbstractWidget_C_GetPercent::PercentValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_GetPercent, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000008, "Member 'AbstractWidget_C_GetPercent::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_GetPercent, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x00000C, "Member 'AbstractWidget_C_GetPercent::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_GetPercent, K2Node_FunctionResult_PercentValue_ImplicitCast) == 0x000010, "Member 'AbstractWidget_C_GetPercent::K2Node_FunctionResult_PercentValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_GetPercent, K2Node_FunctionResult_PercentValue_ImplicitCast_1) == 0x000018, "Member 'AbstractWidget_C_GetPercent::K2Node_FunctionResult_PercentValue_ImplicitCast_1' has a wrong offset!");

// Function AbstractWidget.AbstractWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AbstractWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbstractWidget_C_PreConstruct) == 0x000001, "Wrong alignment on AbstractWidget_C_PreConstruct");
static_assert(sizeof(AbstractWidget_C_PreConstruct) == 0x000001, "Wrong size on AbstractWidget_C_PreConstruct");
static_assert(offsetof(AbstractWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AbstractWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AbstractWidget.AbstractWidget_C.SetPercent
// 0x0040 (0x0040 - 0x0000)
struct AbstractWidget_C_SetPercent final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPercent_PercentValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbstractWidget_C_SetPercent) == 0x000008, "Wrong alignment on AbstractWidget_C_SetPercent");
static_assert(sizeof(AbstractWidget_C_SetPercent) == 0x000040, "Wrong size on AbstractWidget_C_SetPercent");
static_assert(offsetof(AbstractWidget_C_SetPercent, NewParam) == 0x000000, "Member 'AbstractWidget_C_SetPercent::NewParam' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'AbstractWidget_C_SetPercent::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_GetPercent_PercentValue) == 0x000010, "Member 'AbstractWidget_C_SetPercent::CallFunc_GetPercent_PercentValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000018, "Member 'AbstractWidget_C_SetPercent::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00001C, "Member 'AbstractWidget_C_SetPercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000020, "Member 'AbstractWidget_C_SetPercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000024, "Member 'AbstractWidget_C_SetPercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000028, "Member 'AbstractWidget_C_SetPercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x00002C, "Member 'AbstractWidget_C_SetPercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000030, "Member 'AbstractWidget_C_SetPercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000034, "Member 'AbstractWidget_C_SetPercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_SetPercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x000038, "Member 'AbstractWidget_C_SetPercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");

// Function AbstractWidget.AbstractWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct AbstractWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbstractWidget_C_Tick) == 0x000004, "Wrong alignment on AbstractWidget_C_Tick");
static_assert(sizeof(AbstractWidget_C_Tick) == 0x00003C, "Wrong size on AbstractWidget_C_Tick");
static_assert(offsetof(AbstractWidget_C_Tick, MyGeometry) == 0x000000, "Member 'AbstractWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'AbstractWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function AbstractWidget.AbstractWidget_C.UpdateStyle
// 0x0010 (0x0010 - 0x0000)
struct AbstractWidget_C_UpdateStyle final
{
public:
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbstractWidget_C_UpdateStyle) == 0x000008, "Wrong alignment on AbstractWidget_C_UpdateStyle");
static_assert(sizeof(AbstractWidget_C_UpdateStyle) == 0x000010, "Wrong size on AbstractWidget_C_UpdateStyle");
static_assert(offsetof(AbstractWidget_C_UpdateStyle, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000000, "Member 'AbstractWidget_C_UpdateStyle::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbstractWidget_C_UpdateStyle, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000008, "Member 'AbstractWidget_C_UpdateStyle::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

