#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioSettingsPage

#include "Basic.hpp"

#include "SettingPage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AudioSettingsPage.AudioSettingsPage_C
// 0x0020 (0x0300 - 0x02E0)
class UAudioSettingsPage_C final : public USettingPage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           AudioSettings;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_VAR;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_MasterAudio_DEFAULTFOCUS;               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AudioSettingsPage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AudioSettingsPage_C">();
	}
	static class UAudioSettingsPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioSettingsPage_C>();
	}
};
static_assert(alignof(UAudioSettingsPage_C) == 0x000008, "Wrong alignment on UAudioSettingsPage_C");
static_assert(sizeof(UAudioSettingsPage_C) == 0x000300, "Wrong size on UAudioSettingsPage_C");
static_assert(offsetof(UAudioSettingsPage_C, UberGraphFrame) == 0x0002E0, "Member 'UAudioSettingsPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAudioSettingsPage_C, AudioSettings) == 0x0002E8, "Member 'UAudioSettingsPage_C::AudioSettings' has a wrong offset!");
static_assert(offsetof(UAudioSettingsPage_C, ScrollBox_VAR) == 0x0002F0, "Member 'UAudioSettingsPage_C::ScrollBox_VAR' has a wrong offset!");
static_assert(offsetof(UAudioSettingsPage_C, SettingRow_MasterAudio_DEFAULTFOCUS) == 0x0002F8, "Member 'UAudioSettingsPage_C::SettingRow_MasterAudio_DEFAULTFOCUS' has a wrong offset!");

}

