#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AddToPlaylistMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AddToPlaylistMenu.BP_AddToPlaylistMenu_C
// 0x00C8 (0x0388 - 0x02C0)
class UBP_AddToPlaylistMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_1;                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_2;                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_3;                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_4;                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_5;                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_6;                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_7;                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_8;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_9;                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_10;                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlaylistSearchEntryWidget_C*        BP_PlaylistSearchEntryWidget_11;                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Red_C*              CancelButton;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       CreatePlaylistButton;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CreatePlaylistWidget_C*             CreatePlaylistWidget;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    Header;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_102;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PlaylistListBox;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GymGuiMetaPopupHelper_C*           WBP_GymGuiMetaPopupHelper;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 MapId;                                             // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__BP_AddToPlaylistMenu_CreatePlaylistButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_FeaturedServerListWidget_CancelButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Close();
	void Construct();
	void ExecuteUbergraph_BP_AddToPlaylistMenu(int32 EntryPoint);
	void InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0(const struct FKey& Key);
	void OnGamepadNavigated_Event();
	void OnInitialized();
	void OnPlaylistSearchDone(bool Success);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnVisibilityChanged_Event(ESlateVisibility InVisibility);
	void Refresh();
	void Show(const class FString& MapId_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AddToPlaylistMenu_C">();
	}
	static class UBP_AddToPlaylistMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AddToPlaylistMenu_C>();
	}
};
static_assert(alignof(UBP_AddToPlaylistMenu_C) == 0x000008, "Wrong alignment on UBP_AddToPlaylistMenu_C");
static_assert(sizeof(UBP_AddToPlaylistMenu_C) == 0x000388, "Wrong size on UBP_AddToPlaylistMenu_C");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_AddToPlaylistMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget) == 0x0002C8, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_1) == 0x0002D0, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_1' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_2) == 0x0002D8, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_2' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_3) == 0x0002E0, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_3' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_4) == 0x0002E8, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_4' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_5) == 0x0002F0, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_5' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_6) == 0x0002F8, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_6' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_7) == 0x000300, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_7' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_8) == 0x000308, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_8' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_9) == 0x000310, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_9' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_10) == 0x000318, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_10' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, BP_PlaylistSearchEntryWidget_11) == 0x000320, "Member 'UBP_AddToPlaylistMenu_C::BP_PlaylistSearchEntryWidget_11' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, CancelButton) == 0x000328, "Member 'UBP_AddToPlaylistMenu_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, CreatePlaylistButton) == 0x000330, "Member 'UBP_AddToPlaylistMenu_C::CreatePlaylistButton' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, CreatePlaylistWidget) == 0x000338, "Member 'UBP_AddToPlaylistMenu_C::CreatePlaylistWidget' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, Header) == 0x000340, "Member 'UBP_AddToPlaylistMenu_C::Header' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, Image_102) == 0x000348, "Member 'UBP_AddToPlaylistMenu_C::Image_102' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, PlaylistListBox) == 0x000350, "Member 'UBP_AddToPlaylistMenu_C::PlaylistListBox' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, ScrollBox_0) == 0x000358, "Member 'UBP_AddToPlaylistMenu_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, WBP_GymGuiMetaPopupHelper) == 0x000360, "Member 'UBP_AddToPlaylistMenu_C::WBP_GymGuiMetaPopupHelper' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, MapId) == 0x000368, "Member 'UBP_AddToPlaylistMenu_C::MapId' has a wrong offset!");
static_assert(offsetof(UBP_AddToPlaylistMenu_C, HighlightableWidgets) == 0x000378, "Member 'UBP_AddToPlaylistMenu_C::HighlightableWidgets' has a wrong offset!");

}

