#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Customize

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function BP_Customize.BP_Customize_C.BndEvt__BP_Customize_WBP_CategoryContainer_Customize_K2Node_ComponentBoundEvent_1_OnTabButtonSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Customize_C_BndEvt__BP_Customize_WBP_CategoryContainer_Customize_K2Node_ComponentBoundEvent_1_OnTabButtonSelected__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Customize_C_BndEvt__BP_Customize_WBP_CategoryContainer_Customize_K2Node_ComponentBoundEvent_1_OnTabButtonSelected__DelegateSignature) == 0x000004, "Wrong alignment on BP_Customize_C_BndEvt__BP_Customize_WBP_CategoryContainer_Customize_K2Node_ComponentBoundEvent_1_OnTabButtonSelected__DelegateSignature");
static_assert(sizeof(BP_Customize_C_BndEvt__BP_Customize_WBP_CategoryContainer_Customize_K2Node_ComponentBoundEvent_1_OnTabButtonSelected__DelegateSignature) == 0x000004, "Wrong size on BP_Customize_C_BndEvt__BP_Customize_WBP_CategoryContainer_Customize_K2Node_ComponentBoundEvent_1_OnTabButtonSelected__DelegateSignature");
static_assert(offsetof(BP_Customize_C_BndEvt__BP_Customize_WBP_CategoryContainer_Customize_K2Node_ComponentBoundEvent_1_OnTabButtonSelected__DelegateSignature, Index_0) == 0x000000, "Member 'BP_Customize_C_BndEvt__BP_Customize_WBP_CategoryContainer_Customize_K2Node_ComponentBoundEvent_1_OnTabButtonSelected__DelegateSignature::Index_0' has a wrong offset!");

// Function BP_Customize.BP_Customize_C.BndEvt__BP_Customize_WBP_DetailsContainer_Customize_K2Node_ComponentBoundEvent_2_OnTabButtonSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Customize_C_BndEvt__BP_Customize_WBP_DetailsContainer_Customize_K2Node_ComponentBoundEvent_2_OnTabButtonSelected__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Customize_C_BndEvt__BP_Customize_WBP_DetailsContainer_Customize_K2Node_ComponentBoundEvent_2_OnTabButtonSelected__DelegateSignature) == 0x000004, "Wrong alignment on BP_Customize_C_BndEvt__BP_Customize_WBP_DetailsContainer_Customize_K2Node_ComponentBoundEvent_2_OnTabButtonSelected__DelegateSignature");
static_assert(sizeof(BP_Customize_C_BndEvt__BP_Customize_WBP_DetailsContainer_Customize_K2Node_ComponentBoundEvent_2_OnTabButtonSelected__DelegateSignature) == 0x000004, "Wrong size on BP_Customize_C_BndEvt__BP_Customize_WBP_DetailsContainer_Customize_K2Node_ComponentBoundEvent_2_OnTabButtonSelected__DelegateSignature");
static_assert(offsetof(BP_Customize_C_BndEvt__BP_Customize_WBP_DetailsContainer_Customize_K2Node_ComponentBoundEvent_2_OnTabButtonSelected__DelegateSignature, Index_0) == 0x000000, "Member 'BP_Customize_C_BndEvt__BP_Customize_WBP_DetailsContainer_Customize_K2Node_ComponentBoundEvent_2_OnTabButtonSelected__DelegateSignature::Index_0' has a wrong offset!");

// Function BP_Customize.BP_Customize_C.BndEvt__BP_Customize_WBP_ItemContainer_Customize_K2Node_ComponentBoundEvent_3_OnTabButtonSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Customize_C_BndEvt__BP_Customize_WBP_ItemContainer_Customize_K2Node_ComponentBoundEvent_3_OnTabButtonSelected__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Customize_C_BndEvt__BP_Customize_WBP_ItemContainer_Customize_K2Node_ComponentBoundEvent_3_OnTabButtonSelected__DelegateSignature) == 0x000004, "Wrong alignment on BP_Customize_C_BndEvt__BP_Customize_WBP_ItemContainer_Customize_K2Node_ComponentBoundEvent_3_OnTabButtonSelected__DelegateSignature");
static_assert(sizeof(BP_Customize_C_BndEvt__BP_Customize_WBP_ItemContainer_Customize_K2Node_ComponentBoundEvent_3_OnTabButtonSelected__DelegateSignature) == 0x000004, "Wrong size on BP_Customize_C_BndEvt__BP_Customize_WBP_ItemContainer_Customize_K2Node_ComponentBoundEvent_3_OnTabButtonSelected__DelegateSignature");
static_assert(offsetof(BP_Customize_C_BndEvt__BP_Customize_WBP_ItemContainer_Customize_K2Node_ComponentBoundEvent_3_OnTabButtonSelected__DelegateSignature, Index_0) == 0x000000, "Member 'BP_Customize_C_BndEvt__BP_Customize_WBP_ItemContainer_Customize_K2Node_ComponentBoundEvent_3_OnTabButtonSelected__DelegateSignature::Index_0' has a wrong offset!");

// Function BP_Customize.BP_Customize_C.BPHighlightWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_Customize_C_BPHighlightWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Customize_C_BPHighlightWidget) == 0x000008, "Wrong alignment on BP_Customize_C_BPHighlightWidget");
static_assert(sizeof(BP_Customize_C_BPHighlightWidget) == 0x000008, "Wrong size on BP_Customize_C_BPHighlightWidget");
static_assert(offsetof(BP_Customize_C_BPHighlightWidget, Widget) == 0x000000, "Member 'BP_Customize_C_BPHighlightWidget::Widget' has a wrong offset!");

// Function BP_Customize.BP_Customize_C.BuildAssetSlots
// 0x0180 (0x0180 - 0x0000)
struct BP_Customize_C_BuildAssetSlots final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGymCharacterCustomizationGUIOption> CallFunc_GetOptions_ReturnValue;                   // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymCharacterCustomizationGUIOption    CallFunc_GetCurrentOptionForSlot_ReturnValue;      // 0x0028(0x0050)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGymCharacterCustomizationGUIOption    CallFunc_Array_Get_Item;                           // 0x0088(0x0050)()
	TArray<struct FGymCharacterCustomizationGUIOption> CallFunc_GetVariants_ReturnValue;                  // 0x00D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymCharacterCustomizationGUIOption    CallFunc_Array_Get_Item_1;                         // 0x0110(0x0050)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_166[0x2];                                      // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWPB_ItemButton_Customize_C*            CallFunc_Create_ReturnValue;                       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Customize_C_BuildAssetSlots) == 0x000008, "Wrong alignment on BP_Customize_C_BuildAssetSlots");
static_assert(sizeof(BP_Customize_C_BuildAssetSlots) == 0x000180, "Wrong size on BP_Customize_C_BuildAssetSlots");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, Category) == 0x000000, "Member 'BP_Customize_C_BuildAssetSlots::Category' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_GetOptions_ReturnValue) == 0x000010, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_GetOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_GetCurrentOptionForSlot_ReturnValue) == 0x000028, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_GetCurrentOptionForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'BP_Customize_C_BuildAssetSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, Temp_int_Array_Index_Variable) == 0x000084, "Member 'BP_Customize_C_BuildAssetSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_GetVariants_ReturnValue) == 0x0000D8, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_GetVariants_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000E8, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Length_ReturnValue_1) == 0x0000EC, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, Temp_bool_True_if_break_was_hit_Variable) == 0x0000F0, "Member 'BP_Customize_C_BuildAssetSlots::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Add_ReturnValue) == 0x0000F4, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Add_ReturnValue_1) == 0x0000F8, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Add_ReturnValue_2) == 0x0000FC, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Add_ReturnValue_3) == 0x000100, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Not_PreBool_ReturnValue) == 0x000104, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, Temp_int_Array_Index_Variable_1) == 0x000108, "Member 'BP_Customize_C_BuildAssetSlots::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, Temp_int_Loop_Counter_Variable_1) == 0x000160, "Member 'BP_Customize_C_BuildAssetSlots::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000164, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Less_IntInt_ReturnValue_1) == 0x000165, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Add_IntInt_ReturnValue_1) == 0x000168, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_BooleanAND_ReturnValue) == 0x00016C, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Create_ReturnValue) == 0x000170, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Add_ReturnValue_4) == 0x000178, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildAssetSlots, CallFunc_Array_Add_ReturnValue_5) == 0x00017C, "Member 'BP_Customize_C_BuildAssetSlots::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");

// Function BP_Customize.BP_Customize_C.BuildSlots
// 0x0088 (0x0088 - 0x0000)
struct BP_Customize_C_BuildSlots final
{
public:
	class UGYMCustomizationSlotWidgetBP_C*        CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGymCharacterCustomizationGUIOption> CallFunc_GetSlots_ReturnValue;                     // 0x0020(0x0010)(ReferenceParm)
	struct FGymCharacterCustomizationGUIOption    CallFunc_Array_Get_Item;                           // 0x0030(0x0050)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Customize_C_BuildSlots) == 0x000008, "Wrong alignment on BP_Customize_C_BuildSlots");
static_assert(sizeof(BP_Customize_C_BuildSlots) == 0x000088, "Wrong size on BP_Customize_C_BuildSlots");
static_assert(offsetof(BP_Customize_C_BuildSlots, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'BP_Customize_C_BuildSlots::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildSlots, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Customize_C_BuildSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildSlots, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_Customize_C_BuildSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Customize_C_BuildSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildSlots, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'BP_Customize_C_BuildSlots::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildSlots, CallFunc_GetSlots_ReturnValue) == 0x000020, "Member 'BP_Customize_C_BuildSlots::CallFunc_GetSlots_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildSlots, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Customize_C_BuildSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildSlots, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_Customize_C_BuildSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_BuildSlots, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_Customize_C_BuildSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Customize.BP_Customize_C.CheckAchievements
// 0x0020 (0x0020 - 0x0000)
struct BP_Customize_C_CheckAchievements final
{
public:
	bool                                          CallFunc_IsEverySlotInUse_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Customize_C_CheckAchievements) == 0x000008, "Wrong alignment on BP_Customize_C_CheckAchievements");
static_assert(sizeof(BP_Customize_C_CheckAchievements) == 0x000020, "Wrong size on BP_Customize_C_CheckAchievements");
static_assert(offsetof(BP_Customize_C_CheckAchievements, CallFunc_IsEverySlotInUse_ReturnValue) == 0x000000, "Member 'BP_Customize_C_CheckAchievements::CallFunc_IsEverySlotInUse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_CheckAchievements, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_Customize_C_CheckAchievements::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_CheckAchievements, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000010, "Member 'BP_Customize_C_CheckAchievements::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_CheckAchievements, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Customize_C_CheckAchievements::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue) == 0x000019, "Member 'BP_Customize_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_CheckAchievements, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'BP_Customize_C_CheckAchievements::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Customize.BP_Customize_C.ExecuteUbergraph_BP_Customize
// 0x0360 (0x0360 - 0x0000)
struct BP_Customize_C_ExecuteUbergraph_BP_Customize final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0038(0x0018)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0060(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0088(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_SimulateGamepadUINavigate_NextWidget;     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_3;          // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x00C8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue;             // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        K2Node_DynamicCast_AsWPB_Category_Button_Customize; // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymCharacterCustomizationGUIOption    CallFunc_GetCurrentOptionForSlot_ReturnValue;      // 0x0138(0x0050)()
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue_1;           // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        K2Node_DynamicCast_AsWPB_Category_Button_Customize_1; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue_2;           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_ItemButton_Customize_C*            K2Node_DynamicCast_AsWPB_Item_Button_Customize;    // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymCharacterCustomizationGUIOption    CallFunc_GetCurrentOptionForSlot_ReturnValue_1;    // 0x01B8(0x0050)()
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue_3;           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue_4;           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_Widget;                               // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_4;             // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x2];                                      // 0x023A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_2;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue_5;           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue_6;           // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_ColorButton_Customize_C*           K2Node_DynamicCast_AsWPB_Color_Button_Customize;   // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWPB_CategoryButton_Customize_C*        K2Node_DynamicCast_AsWPB_Category_Button_Customize_2; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymCharacterCustomizationGUIOption    CallFunc_GetCurrentOptionForSlot_ReturnValue_2;    // 0x02A0(0x0050)()
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1; // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_7;                     // 0x02F8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2; // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3; // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4; // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_5; // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_6; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_5;             // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0317(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x032B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_6;                     // 0x0340(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Customize_C_ExecuteUbergraph_BP_Customize) == 0x000008, "Wrong alignment on BP_Customize_C_ExecuteUbergraph_BP_Customize");
static_assert(sizeof(BP_Customize_C_ExecuteUbergraph_BP_Customize) == 0x000360, "Wrong size on BP_Customize_C_ExecuteUbergraph_BP_Customize");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, EntryPoint) == 0x000000, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_InputActionEvent_Key_3) == 0x000008, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_InputActionEvent_Key_2) == 0x000020, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_InputActionEvent_Key_1) == 0x000038, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_InputActionEvent_Key) == 0x000060, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_IsOpen_ReturnValue) == 0x000078, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_InputActionEvent_Key_4) == 0x000088, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_IsOpen_ReturnValue_1) == 0x0000A0, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A4, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_SimulateGamepadUINavigate_NextWidget) == 0x0000B8, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_SimulateGamepadUINavigate_NextWidget' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GamepadUINavigate_ReturnValue) == 0x0000C1, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x0000C2, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Not_PreBool_ReturnValue) == 0x0000C3, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GamepadUINavigate_ReturnValue_2) == 0x0000C4, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GamepadUINavigate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GamepadUINavigate_ReturnValue_3) == 0x0000C5, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GamepadUINavigate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C6, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_InputActionEvent_Key_5) == 0x0000C8, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_InputActionEvent_Key_5' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x0000E0, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_Contains_ReturnValue) == 0x0000E1, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_BooleanAND_ReturnValue) == 0x0000E2, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E3, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_ComponentBoundEvent_Index_2) == 0x0000E4, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_ComponentBoundEvent_Index_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_ComponentBoundEvent_Index_1) == 0x0000E8, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_PlayAnimation_ReturnValue) == 0x0000F0, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000F8, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_PlayAnimation_ReturnValue_2) == 0x000100, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_PlayAnimation_ReturnValue_3) == 0x000108, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_PlayAnimation_ReturnValue_4) == 0x000110, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_PlayAnimation_ReturnValue_5) == 0x000118, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentButton_ReturnValue) == 0x000120, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_AsWPB_Category_Button_Customize) == 0x000128, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_AsWPB_Category_Button_Customize' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentOptionForSlot_ReturnValue) == 0x000138, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentOptionForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentButton_ReturnValue_1) == 0x000188, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_AsWPB_Category_Button_Customize_1) == 0x000190, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_AsWPB_Category_Button_Customize_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentButton_ReturnValue_2) == 0x0001A0, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentButton_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_AsWPB_Item_Button_Customize) == 0x0001A8, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_AsWPB_Item_Button_Customize' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentOptionForSlot_ReturnValue_1) == 0x0001B8, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentOptionForSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentButton_ReturnValue_3) == 0x000208, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentButton_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentButton_ReturnValue_4) == 0x000210, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentButton_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_Contains_ReturnValue_1) == 0x000218, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_Get_Item) == 0x000220, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_Contains_ReturnValue_2) == 0x000228, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_Event_Widget) == 0x000230, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_Contains_ReturnValue_3) == 0x000238, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_Contains_ReturnValue_4) == 0x000239, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_Length_ReturnValue) == 0x00023C, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000240, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_CustomEvent_Index) == 0x000244, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Not_PreBool_ReturnValue_2) == 0x000248, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_Get_Item_1) == 0x000250, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Array_IsEmpty_ReturnValue) == 0x000258, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_Not_PreBool_ReturnValue_3) == 0x000259, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_CreateDelegate_OutputDelegate_2) == 0x00025C, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_ComponentBoundEvent_Index) == 0x00026C, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentButton_ReturnValue_5) == 0x000270, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentButton_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, CallFunc_GetCurrentButton_ReturnValue_6) == 0x000278, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::CallFunc_GetCurrentButton_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_AsWPB_Color_Button_Customize) == 0x000280, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_AsWPB_Color_Button_Customize' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_bSuccess_3) == 0x000288, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Customize_C_ExecuteUbergraph_BP_Customize, K2Node_DynamicCast_AsWPB_Category_Button_Customize_2) == 0x000290, "Member 'BP_Customize_C_ExecuteUbergraph_BP_Customize::K2Node_DynamicCast_AsWPB_Category_Button_Customize_2' has a wrong offset!");
