#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CareerLevelButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CareerContentData_structs.hpp"
#include "TaskData_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "TaskDataListStruct_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CareerLevelButton.BP_CareerLevelButton_C.ExecuteUbergraph_BP_CareerLevelButton
// 0x0108 (0x0108 - 0x0000)
struct BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTaskDataListStruct                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GymGameInstance_C*                  K2Node_DynamicCast_AsBP_Gym_Game_Instance;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGymLoadingScreenOptions               K2Node_MakeStruct_GymLoadingScreenOptions;         // 0x00B0(0x0058)()
};
static_assert(alignof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton) == 0x000008, "Wrong alignment on BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton");
static_assert(sizeof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton) == 0x000108, "Wrong size on BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, EntryPoint) == 0x000000, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, K2Node_Event_IsDesignTime) == 0x000014, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_GetGameInstance_ReturnValue) == 0x000078, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, K2Node_DynamicCast_AsBP_Gym_Game_Instance) == 0x000080, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::K2Node_DynamicCast_AsBP_Gym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_Conv_TextToString_ReturnValue) == 0x000090, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, CallFunc_GetPathName_ReturnValue) == 0x0000A0, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton, K2Node_MakeStruct_GymLoadingScreenOptions) == 0x0000B0, "Member 'BP_CareerLevelButton_C_ExecuteUbergraph_BP_CareerLevelButton::K2Node_MakeStruct_GymLoadingScreenOptions' has a wrong offset!");

// Function BP_CareerLevelButton.BP_CareerLevelButton_C.GetRequiredTasks
// 0x0068 (0x0068 - 0x0000)
struct BP_CareerLevelButton_C_GetRequiredTasks final
{
public:
	int32                                         Required_Points;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCareerContentData                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLevelButton_C_GetRequiredTasks) == 0x000008, "Wrong alignment on BP_CareerLevelButton_C_GetRequiredTasks");
static_assert(sizeof(BP_CareerLevelButton_C_GetRequiredTasks) == 0x000068, "Wrong size on BP_CareerLevelButton_C_GetRequiredTasks");
static_assert(offsetof(BP_CareerLevelButton_C_GetRequiredTasks, Required_Points) == 0x000000, "Member 'BP_CareerLevelButton_C_GetRequiredTasks::Required_Points' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_GetRequiredTasks, CallFunc_Conv_StringToName_ReturnValue) == 0x000004, "Member 'BP_CareerLevelButton_C_GetRequiredTasks::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_GetRequiredTasks, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BP_CareerLevelButton_C_GetRequiredTasks::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_GetRequiredTasks, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'BP_CareerLevelButton_C_GetRequiredTasks::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_CareerLevelButton.BP_CareerLevelButton_C.Init
// 0x00D8 (0x00D8 - 0x0000)
struct BP_CareerLevelButton_C_Init final
{
public:
	class FString                                 CurrentLevel;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsUnlocked;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TaskListElement_C*                 CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunningInPIE_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocationUnlocked_ReturnValue;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebugCareerUnlocked_ReturnValue;        // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientAdmin_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTaskDataListStruct                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTaskData                              CallFunc_Array_Get_Item;                           // 0x0090(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedTask_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCompletedTasks_ReturnValue;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymSaveGameTutorial*                   CallFunc_GetSaveFile_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLevelButton_C_Init) == 0x000008, "Wrong alignment on BP_CareerLevelButton_C_Init");
static_assert(sizeof(BP_CareerLevelButton_C_Init) == 0x0000D8, "Wrong size on BP_CareerLevelButton_C_Init");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CurrentLevel) == 0x000000, "Member 'BP_CareerLevelButton_C_Init::CurrentLevel' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, IsUnlocked) == 0x000010, "Member 'BP_CareerLevelButton_C_Init::IsUnlocked' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_CareerLevelButton_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, Temp_bool_Variable) == 0x000020, "Member 'BP_CareerLevelButton_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, Temp_byte_Variable) == 0x000021, "Member 'BP_CareerLevelButton_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, Temp_byte_Variable_1) == 0x000022, "Member 'BP_CareerLevelButton_C_Init::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, Temp_bool_Variable_1) == 0x000023, "Member 'BP_CareerLevelButton_C_Init::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, Temp_byte_Variable_2) == 0x000024, "Member 'BP_CareerLevelButton_C_Init::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, Temp_byte_Variable_3) == 0x000025, "Member 'BP_CareerLevelButton_C_Init::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_CareerLevelButton_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_CareerLevelButton_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_CareerLevelButton_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_RunningInPIE_ReturnValue) == 0x000034, "Member 'BP_CareerLevelButton_C_Init::CallFunc_RunningInPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_IsLocationUnlocked_ReturnValue) == 0x000035, "Member 'BP_CareerLevelButton_C_Init::CallFunc_IsLocationUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_IsDebugCareerUnlocked_ReturnValue) == 0x000036, "Member 'BP_CareerLevelButton_C_Init::CallFunc_IsDebugCareerUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_GetIsEnabled_ReturnValue) == 0x000037, "Member 'BP_CareerLevelButton_C_Init::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'BP_CareerLevelButton_C_Init::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_IsClientAdmin_ReturnValue) == 0x000040, "Member 'BP_CareerLevelButton_C_Init::CallFunc_IsClientAdmin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_BooleanOR_ReturnValue) == 0x000041, "Member 'BP_CareerLevelButton_C_Init::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, K2Node_Select_Default) == 0x000042, "Member 'BP_CareerLevelButton_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_BooleanOR_ReturnValue_1) == 0x000043, "Member 'BP_CareerLevelButton_C_Init::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, K2Node_Select_Default_1) == 0x000044, "Member 'BP_CareerLevelButton_C_Init::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_BooleanAND_ReturnValue) == 0x000045, "Member 'BP_CareerLevelButton_C_Init::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_BooleanOR_ReturnValue_2) == 0x000046, "Member 'BP_CareerLevelButton_C_Init::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_CareerLevelButton_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000050, "Member 'BP_CareerLevelButton_C_Init::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'BP_CareerLevelButton_C_Init::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'BP_CareerLevelButton_C_Init::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000088, "Member 'BP_CareerLevelButton_C_Init::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_CareerLevelButton_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'BP_CareerLevelButton_C_Init::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_CareerLevelButton_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_Conv_NameToString_ReturnValue) == 0x0000B8, "Member 'BP_CareerLevelButton_C_Init::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_HasCompletedTask_ReturnValue) == 0x0000C8, "Member 'BP_CareerLevelButton_C_Init::CallFunc_HasCompletedTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_GetCompletedTasks_ReturnValue) == 0x0000CC, "Member 'BP_CareerLevelButton_C_Init::CallFunc_GetCompletedTasks_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Init, CallFunc_GetSaveFile_ReturnValue) == 0x0000D0, "Member 'BP_CareerLevelButton_C_Init::CallFunc_GetSaveFile_ReturnValue' has a wrong offset!");

// Function BP_CareerLevelButton.BP_CareerLevelButton_C.InitGameMode
// 0x0050 (0x0050 - 0x0000)
struct BP_CareerLevelButton_C_InitGameMode final
{
public:
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuleDisplayInfo                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLevelButton_C_InitGameMode) == 0x000008, "Wrong alignment on BP_CareerLevelButton_C_InitGameMode");
static_assert(sizeof(BP_CareerLevelButton_C_InitGameMode) == 0x000050, "Wrong size on BP_CareerLevelButton_C_InitGameMode");
static_assert(offsetof(BP_CareerLevelButton_C_InitGameMode, CallFunc_Conv_StringToName_ReturnValue) == 0x000000, "Member 'BP_CareerLevelButton_C_InitGameMode::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_InitGameMode, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_CareerLevelButton_C_InitGameMode::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_InitGameMode, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000048, "Member 'BP_CareerLevelButton_C_InitGameMode::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_CareerLevelButton.BP_CareerLevelButton_C.InitTape
// 0x000C (0x000C - 0x0000)
struct BP_CareerLevelButton_C_InitTape final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTapesCollected_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCollectedTape_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLevelButton_C_InitTape) == 0x000004, "Wrong alignment on BP_CareerLevelButton_C_InitTape");
static_assert(sizeof(BP_CareerLevelButton_C_InitTape) == 0x00000C, "Wrong size on BP_CareerLevelButton_C_InitTape");
static_assert(offsetof(BP_CareerLevelButton_C_InitTape, Temp_bool_Variable) == 0x000000, "Member 'BP_CareerLevelButton_C_InitTape::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_InitTape, Temp_byte_Variable) == 0x000001, "Member 'BP_CareerLevelButton_C_InitTape::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_InitTape, Temp_byte_Variable_1) == 0x000002, "Member 'BP_CareerLevelButton_C_InitTape::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_InitTape, CallFunc_GetTapesCollected_ReturnValue) == 0x000004, "Member 'BP_CareerLevelButton_C_InitTape::CallFunc_GetTapesCollected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_InitTape, CallFunc_HasCollectedTape_ReturnValue) == 0x000008, "Member 'BP_CareerLevelButton_C_InitTape::CallFunc_HasCollectedTape_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_InitTape, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'BP_CareerLevelButton_C_InitTape::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_InitTape, K2Node_Select_Default) == 0x00000A, "Member 'BP_CareerLevelButton_C_InitTape::K2Node_Select_Default' has a wrong offset!");

// Function BP_CareerLevelButton.BP_CareerLevelButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_CareerLevelButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLevelButton_C_PreConstruct) == 0x000001, "Wrong alignment on BP_CareerLevelButton_C_PreConstruct");
static_assert(sizeof(BP_CareerLevelButton_C_PreConstruct) == 0x000001, "Wrong size on BP_CareerLevelButton_C_PreConstruct");
static_assert(offsetof(BP_CareerLevelButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_CareerLevelButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_CareerLevelButton.BP_CareerLevelButton_C.SetCompletedTasks
// 0x0100 (0x0100 - 0x0000)
struct BP_CareerLevelButton_C_SetCompletedTasks final
{
public:
	int32                                         CompletedTasks;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxTasks;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLevelButton_C_SetCompletedTasks) == 0x000008, "Wrong alignment on BP_CareerLevelButton_C_SetCompletedTasks");
static_assert(sizeof(BP_CareerLevelButton_C_SetCompletedTasks) == 0x000100, "Wrong size on BP_CareerLevelButton_C_SetCompletedTasks");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, CompletedTasks) == 0x000000, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::CompletedTasks' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, MaxTasks) == 0x000004, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::MaxTasks' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, Temp_bool_Variable) == 0x000008, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000009, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, CallFunc_Min_ReturnValue) == 0x000068, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, Temp_byte_Variable) == 0x00006C, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000070, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, Temp_byte_Variable_1) == 0x0000C8, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, K2Node_Select_Default) == 0x0000F8, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_SetCompletedTasks, CallFunc_IsVisible_ReturnValue) == 0x0000F9, "Member 'BP_CareerLevelButton_C_SetCompletedTasks::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function BP_CareerLevelButton.BP_CareerLevelButton_C.Unlock
// 0x0009 (0x0009 - 0x0000)
struct BP_CareerLevelButton_C_Unlock final
{
public:
	bool                                          Unlocked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLevelButton_C_Unlock) == 0x000001, "Wrong alignment on BP_CareerLevelButton_C_Unlock");
static_assert(sizeof(BP_CareerLevelButton_C_Unlock) == 0x000009, "Wrong size on BP_CareerLevelButton_C_Unlock");
static_assert(offsetof(BP_CareerLevelButton_C_Unlock, Unlocked) == 0x000000, "Member 'BP_CareerLevelButton_C_Unlock::Unlocked' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Unlock, Temp_bool_Variable) == 0x000001, "Member 'BP_CareerLevelButton_C_Unlock::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Unlock, Temp_byte_Variable) == 0x000002, "Member 'BP_CareerLevelButton_C_Unlock::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerLevelButton_C_Unlock, Temp_byte_Variable_1) == 0x000003, "Member 'BP_CareerLevelButton_C_Unlock::Temp_byte_Variable_1' has a wrong offset!");
