#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CareerMenuWidget

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CareerContentData_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CareerMenuWidget.BP_CareerMenuWidget_C.BPHighlightWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_CareerMenuWidget_C_BPHighlightWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerMenuWidget_C_BPHighlightWidget) == 0x000008, "Wrong alignment on BP_CareerMenuWidget_C_BPHighlightWidget");
static_assert(sizeof(BP_CareerMenuWidget_C_BPHighlightWidget) == 0x000008, "Wrong size on BP_CareerMenuWidget_C_BPHighlightWidget");
static_assert(offsetof(BP_CareerMenuWidget_C_BPHighlightWidget, Widget) == 0x000000, "Member 'BP_CareerMenuWidget_C_BPHighlightWidget::Widget' has a wrong offset!");

// Function BP_CareerMenuWidget.BP_CareerMenuWidget_C.CalculateCompletedTasksForLocation
// 0x0028 (0x0028 - 0x0000)
struct BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation final
{
public:
	class FString                                 LocationID;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Tasks;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CompletedTasks;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCompletedTasksForLocation_Tasks;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation) == 0x000008, "Wrong alignment on BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation");
static_assert(sizeof(BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation) == 0x000028, "Wrong size on BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation, LocationID) == 0x000000, "Member 'BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation::LocationID' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation, Tasks) == 0x000010, "Member 'BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation::Tasks' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation, CompletedTasks) == 0x000018, "Member 'BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation::CompletedTasks' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation, CallFunc_GetCompletedTasksForLocation_Tasks) == 0x000020, "Member 'BP_CareerMenuWidget_C_CalculateCompletedTasksForLocation::CallFunc_GetCompletedTasksForLocation_Tasks' has a wrong offset!");

// Function BP_CareerMenuWidget.BP_CareerMenuWidget_C.CalculateTotalProgressionPercent
// 0x0098 (0x0098 - 0x0000)
struct BP_CareerMenuWidget_C_CalculateTotalProgressionPercent final
{
public:
	double                                        Progression;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TotalTasks;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CompletedTasks;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculateTotalTasksForLocation_Tasks;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculateCompletedTasksForLocation_Tasks; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent) == 0x000008, "Wrong alignment on BP_CareerMenuWidget_C_CalculateTotalProgressionPercent");
static_assert(sizeof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent) == 0x000098, "Wrong size on BP_CareerMenuWidget_C_CalculateTotalProgressionPercent");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, Progression) == 0x000000, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::Progression' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, TotalTasks) == 0x000008, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::TotalTasks' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CompletedTasks) == 0x000010, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CompletedTasks' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_NotEqual_NameName_ReturnValue) == 0x000054, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Conv_NameToString_ReturnValue) == 0x000058, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000068, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_CalculateTotalTasksForLocation_Tasks) == 0x000078, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_CalculateTotalTasksForLocation_Tasks' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_CalculateCompletedTasksForLocation_Tasks) == 0x000080, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_CalculateCompletedTasksForLocation_Tasks' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalProgressionPercent, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BP_CareerMenuWidget_C_CalculateTotalProgressionPercent::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_CareerMenuWidget.BP_CareerMenuWidget_C.CalculateTotalTasksForLocation
// 0x0028 (0x0028 - 0x0000)
struct BP_CareerMenuWidget_C_CalculateTotalTasksForLocation final
{
public:
	class FString                                 LocationID;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Tasks;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalTasks;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTotalTasksForLocation_Tasks;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerMenuWidget_C_CalculateTotalTasksForLocation) == 0x000008, "Wrong alignment on BP_CareerMenuWidget_C_CalculateTotalTasksForLocation");
static_assert(sizeof(BP_CareerMenuWidget_C_CalculateTotalTasksForLocation) == 0x000028, "Wrong size on BP_CareerMenuWidget_C_CalculateTotalTasksForLocation");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalTasksForLocation, LocationID) == 0x000000, "Member 'BP_CareerMenuWidget_C_CalculateTotalTasksForLocation::LocationID' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalTasksForLocation, Tasks) == 0x000010, "Member 'BP_CareerMenuWidget_C_CalculateTotalTasksForLocation::Tasks' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalTasksForLocation, TotalTasks) == 0x000018, "Member 'BP_CareerMenuWidget_C_CalculateTotalTasksForLocation::TotalTasks' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CalculateTotalTasksForLocation, CallFunc_GetTotalTasksForLocation_Tasks) == 0x000020, "Member 'BP_CareerMenuWidget_C_CalculateTotalTasksForLocation::CallFunc_GetTotalTasksForLocation_Tasks' has a wrong offset!");

// Function BP_CareerMenuWidget.BP_CareerMenuWidget_C.CheckAchievements
// 0x00D0 (0x00D0 - 0x0000)
struct BP_CareerMenuWidget_C_CheckAchievements final
{
public:
	TSet<class FString>                           CheckedTapeMaps;                                   // 0x0000(0x0050)(Edit, BlueprintVisible)
	int32                                         TotalCollectedTapes;                               // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_16;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_17;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_18;                // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_19;                // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_20;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_21;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_22;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_23;                // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_24;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_25;                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_26;                // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTapesCollected_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSaveGameTutorial*                   CallFunc_GetSaveFile_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfTimesCompleted_ReturnValue;    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_27;                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_28;                // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_29;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_30;                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_31;                // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_32;                // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_33;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedTask_ReturnValue;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_34;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_35;                // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_36;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_37;                // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_38;                // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_39;                // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_40;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_41;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_42;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_43;                // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_44;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_45;                // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_46;                // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_47;                // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_48;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_49;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_50;                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_51;                // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_52;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_53;                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_54;                // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_55;                // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_56;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_57;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue;       // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_1;     // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_2;     // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_3;     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_4;     // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_5;     // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_6;     // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_7;     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_8;     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_9;     // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_10;    // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_11;    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue_12;    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerMenuWidget_C_CheckAchievements) == 0x000008, "Wrong alignment on BP_CareerMenuWidget_C_CheckAchievements");
static_assert(sizeof(BP_CareerMenuWidget_C_CheckAchievements) == 0x0000D0, "Wrong size on BP_CareerMenuWidget_C_CheckAchievements");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CheckedTapeMaps) == 0x000000, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CheckedTapeMaps' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, TotalCollectedTapes) == 0x000050, "Member 'BP_CareerMenuWidget_C_CheckAchievements::TotalCollectedTapes' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue) == 0x000054, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_1) == 0x000055, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_2) == 0x000056, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_3) == 0x000057, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_4) == 0x000058, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_5) == 0x000059, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_6) == 0x00005A, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_7) == 0x00005B, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_8) == 0x00005C, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_9) == 0x00005D, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_10) == 0x00005E, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_11) == 0x00005F, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_12) == 0x000060, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_13) == 0x000061, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_14) == 0x000062, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_15) == 0x000063, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_16) == 0x000064, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_17) == 0x000065, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_18) == 0x000066, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_19) == 0x000067, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_20) == 0x000068, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_21) == 0x000069, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_22) == 0x00006A, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_23) == 0x00006B, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_24) == 0x00006C, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_25) == 0x00006D, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_26) == 0x00006E, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00006F, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_GetTapesCollected_ReturnValue) == 0x000070, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_GetTapesCollected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_GetSaveFile_ReturnValue) == 0x000078, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_GetSaveFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_GetNumberOfTimesCompleted_ReturnValue) == 0x000084, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_GetNumberOfTimesCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000089, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_27) == 0x00008A, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_28) == 0x00008B, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_29) == 0x00008C, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_30) == 0x00008D, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_31) == 0x00008E, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_32) == 0x00008F, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_33) == 0x000090, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_HasCompletedTask_ReturnValue) == 0x000091, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_HasCompletedTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_34) == 0x000092, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_35) == 0x000093, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_36) == 0x000094, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_37) == 0x000095, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_37' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_38) == 0x000096, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_38' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_39) == 0x000097, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_39' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_40) == 0x000098, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_40' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_41) == 0x000099, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_41' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_42) == 0x00009A, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_42' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_43) == 0x00009B, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_43' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_44) == 0x00009C, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_44' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_45) == 0x00009D, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_45' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_46) == 0x00009E, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_46' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_47) == 0x00009F, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_47' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_48) == 0x0000A0, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_48' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_49) == 0x0000A1, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_49' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_50) == 0x0000A2, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_50' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_51) == 0x0000A3, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_51' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_52) == 0x0000A4, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_52' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_53) == 0x0000A5, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_53' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_54) == 0x0000A6, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_54' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_55) == 0x0000A7, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_55' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_56) == 0x0000A8, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_56' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_BooleanAND_ReturnValue_57) == 0x0000A9, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_BooleanAND_ReturnValue_57' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_GetGameInstance_ReturnValue) == 0x0000B0, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, K2Node_DynamicCast_AsGym_Game_Instance) == 0x0000B8, "Member 'BP_CareerMenuWidget_C_CheckAchievements::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_CareerMenuWidget_C_CheckAchievements::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue) == 0x0000C1, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_1) == 0x0000C2, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_2) == 0x0000C3, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_3) == 0x0000C4, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_4) == 0x0000C5, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_5) == 0x0000C6, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_6) == 0x0000C7, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_7) == 0x0000C8, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_8) == 0x0000C9, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_9) == 0x0000CA, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_10) == 0x0000CB, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_11) == 0x0000CC, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_SetAchievementWithEnum_ReturnValue_12) == 0x0000CD, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_SetAchievementWithEnum_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckAchievements, CallFunc_IsValid_ReturnValue_1) == 0x0000CE, "Member 'BP_CareerMenuWidget_C_CheckAchievements::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_CareerMenuWidget.BP_CareerMenuWidget_C.CheckUnlockedLocation
// 0x00A8 (0x00A8 - 0x0000)
struct BP_CareerMenuWidget_C_CheckUnlockedLocation final
{
public:
	class FName                                   LastUnlockedLocation;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0018(0x0010)(ReferenceParm)
	struct FCareerContentData                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocationUnlocked_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerMenuWidget_C_CheckUnlockedLocation) == 0x000008, "Wrong alignment on BP_CareerMenuWidget_C_CheckUnlockedLocation");
static_assert(sizeof(BP_CareerMenuWidget_C_CheckUnlockedLocation) == 0x0000A8, "Wrong size on BP_CareerMenuWidget_C_CheckUnlockedLocation");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, LastUnlockedLocation) == 0x000000, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::LastUnlockedLocation' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000018, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_Array_Get_Item) == 0x00007C, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_Conv_NameToString_ReturnValue) == 0x000088, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_IsLocationUnlocked_ReturnValue) == 0x000098, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_IsLocationUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_IsEmpty_ReturnValue) == 0x000099, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerMenuWidget_C_CheckUnlockedLocation, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'BP_CareerMenuWidget_C_CheckUnlockedLocation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CareerMenuWidget.BP_CareerMenuWidget_C.DevUnlock
// 0x0068 (0x0068 - 0x0000)
struct BP_CareerMenuWidget_C_DevUnlock final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientAdmin_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunningInPIE_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebugCareerUnlocked_ReturnValue;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
