#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CareerLocationCategoryHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CareerLocationCategoryHeader.BP_CareerLocationCategoryHeader_C
// 0x0048 (0x0308 - 0x02C0)
class UBP_CareerLocationCategoryHeader_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       GoalsCompleted;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LocationIcon;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1Minusnocaps_H2_C*         LocationText;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       UnlocksNeeded;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 LocationID;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_CareerLocationCategoryHeader(int32 EntryPoint);
	void GetNeededTasksNum(int32* Required_Points);
	void PreConstruct(bool IsDesignTime);
	void SetLocationProgress(int32 Current, int32 Max);
	void UpdateNeededTasks();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CareerLocationCategoryHeader_C">();
	}
	static class UBP_CareerLocationCategoryHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CareerLocationCategoryHeader_C>();
	}
};
static_assert(alignof(UBP_CareerLocationCategoryHeader_C) == 0x000008, "Wrong alignment on UBP_CareerLocationCategoryHeader_C");
static_assert(sizeof(UBP_CareerLocationCategoryHeader_C) == 0x000308, "Wrong size on UBP_CareerLocationCategoryHeader_C");
static_assert(offsetof(UBP_CareerLocationCategoryHeader_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_CareerLocationCategoryHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CareerLocationCategoryHeader_C, GoalsCompleted) == 0x0002C8, "Member 'UBP_CareerLocationCategoryHeader_C::GoalsCompleted' has a wrong offset!");
static_assert(offsetof(UBP_CareerLocationCategoryHeader_C, LocationIcon) == 0x0002D0, "Member 'UBP_CareerLocationCategoryHeader_C::LocationIcon' has a wrong offset!");
static_assert(offsetof(UBP_CareerLocationCategoryHeader_C, LocationText) == 0x0002D8, "Member 'UBP_CareerLocationCategoryHeader_C::LocationText' has a wrong offset!");
static_assert(offsetof(UBP_CareerLocationCategoryHeader_C, UnlocksNeeded) == 0x0002E0, "Member 'UBP_CareerLocationCategoryHeader_C::UnlocksNeeded' has a wrong offset!");
static_assert(offsetof(UBP_CareerLocationCategoryHeader_C, WidgetSwitcher) == 0x0002E8, "Member 'UBP_CareerLocationCategoryHeader_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_CareerLocationCategoryHeader_C, Icon) == 0x0002F0, "Member 'UBP_CareerLocationCategoryHeader_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_CareerLocationCategoryHeader_C, LocationID) == 0x0002F8, "Member 'UBP_CareerLocationCategoryHeader_C::LocationID' has a wrong offset!");

}

