#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CartoonWater_Lake_ForTide

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OceanType_structs.hpp"


namespace SDK::Params
{

// Function BP_CartoonWater_Lake_ForTide.BP_CartoonWater_Lake_ForTide_C.ExecuteUbergraph_BP_CartoonWater_Lake_ForTide
// 0x0040 (0x0040 - 0x0000)
struct BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide) == 0x000008, "Wrong alignment on BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide");
static_assert(sizeof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide) == 0x000040, "Wrong size on BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide, EntryPoint) == 0x000000, "Member 'BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide, CallFunc_BreakVector_X) == 0x000020, "Member 'BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide, CallFunc_BreakVector_Y) == 0x000028, "Member 'BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x00003C, "Member 'BP_CartoonWater_Lake_ForTide_C_ExecuteUbergraph_BP_CartoonWater_Lake_ForTide::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_CartoonWater_Lake_ForTide.BP_CartoonWater_Lake_ForTide_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CartoonWater_Lake_ForTide_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CartoonWater_Lake_ForTide_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CartoonWater_Lake_ForTide_C_ReceiveTick");
static_assert(sizeof(BP_CartoonWater_Lake_ForTide_C_ReceiveTick) == 0x000004, "Wrong size on BP_CartoonWater_Lake_ForTide_C_ReceiveTick");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CartoonWater_Lake_ForTide_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CartoonWater_Lake_ForTide.BP_CartoonWater_Lake_ForTide_C.UserConstructionScript
// 0x0078 (0x0078 - 0x0000)
struct BP_CartoonWater_Lake_ForTide_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_7;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_8;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_9;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EOceanType                                    Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_CartoonWater_Lake_ForTide_C_UserConstructionScript");
static_assert(sizeof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript) == 0x000078, "Wrong size on BP_CartoonWater_Lake_ForTide_C_UserConstructionScript");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable) == 0x000000, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_1) == 0x000008, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_2) == 0x000010, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_3) == 0x000018, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_4) == 0x000020, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_5) == 0x000028, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_6) == 0x000030, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_7) == 0x000038, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_8) == 0x000040, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_object_Variable_9) == 0x000048, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, Temp_byte_Variable) == 0x000050, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, K2Node_Select_Default) == 0x000068, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000070, "Member 'BP_CartoonWater_Lake_ForTide_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function BP_CartoonWater_Lake_ForTide.BP_CartoonWater_Lake_ForTide_C.Water Parameters
// 0x0140 (0x0140 - 0x0000)
struct BP_CartoonWater_Lake_ForTide_C_Water_Parameters final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_11; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_12; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_13; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_14; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_15; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_16; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_17; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_18; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_19; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_20; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_21; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_22; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_23; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_24; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_25; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_26; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_27; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_28; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_29; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_30; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_31; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_32; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_33; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_34; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_35; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_36; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_37; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_38; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_39; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_40; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_41; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_42; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_43; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_44; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_45; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_46; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_47; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_48; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_49; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_50; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_51; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5; // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_6; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_7; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_8; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CartoonWater_Lake_ForTide_C_Water_Parameters) == 0x000008, "Wrong alignment on BP_CartoonWater_Lake_ForTide_C_Water_Parameters");
static_assert(sizeof(BP_CartoonWater_Lake_ForTide_C_Water_Parameters) == 0x000140, "Wrong size on BP_CartoonWater_Lake_ForTide_C_Water_Parameters");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_Water_Parameters, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_CartoonWater_Lake_ForTide_C_Water_Parameters::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CartoonWater_Lake_ForTide_C_Water_Parameters, CallFunc_BreakVector_X) == 0x000018, "Member 'BP_CartoonWater_Lake_ForTide_C_Water_Parameters::CallFunc_BreakVector_X' has a wrong offset!");
