#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CareerLocationCategoryHeader

#include "Basic.hpp"

#include "CareerContentData_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CareerLocationCategoryHeader.BP_CareerLocationCategoryHeader_C.ExecuteUbergraph_BP_CareerLocationCategoryHeader
// 0x0068 (0x0068 - 0x0000)
struct BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCareerContentData                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader) == 0x000008, "Wrong alignment on BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader");
static_assert(sizeof(BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader) == 0x000068, "Wrong size on BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader, EntryPoint) == 0x000000, "Member 'BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader, CallFunc_Conv_StringToName_ReturnValue) == 0x000004, "Member 'BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'BP_CareerLocationCategoryHeader_C_ExecuteUbergraph_BP_CareerLocationCategoryHeader::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_CareerLocationCategoryHeader.BP_CareerLocationCategoryHeader_C.GetNeededTasksNum
// 0x0068 (0x0068 - 0x0000)
struct BP_CareerLocationCategoryHeader_C_GetNeededTasksNum final
{
public:
	int32                                         Required_Points;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCareerContentData                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLocationCategoryHeader_C_GetNeededTasksNum) == 0x000008, "Wrong alignment on BP_CareerLocationCategoryHeader_C_GetNeededTasksNum");
static_assert(sizeof(BP_CareerLocationCategoryHeader_C_GetNeededTasksNum) == 0x000068, "Wrong size on BP_CareerLocationCategoryHeader_C_GetNeededTasksNum");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_GetNeededTasksNum, Required_Points) == 0x000000, "Member 'BP_CareerLocationCategoryHeader_C_GetNeededTasksNum::Required_Points' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_GetNeededTasksNum, CallFunc_Conv_StringToName_ReturnValue) == 0x000004, "Member 'BP_CareerLocationCategoryHeader_C_GetNeededTasksNum::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_GetNeededTasksNum, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BP_CareerLocationCategoryHeader_C_GetNeededTasksNum::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_GetNeededTasksNum, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'BP_CareerLocationCategoryHeader_C_GetNeededTasksNum::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_CareerLocationCategoryHeader.BP_CareerLocationCategoryHeader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_CareerLocationCategoryHeader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLocationCategoryHeader_C_PreConstruct) == 0x000001, "Wrong alignment on BP_CareerLocationCategoryHeader_C_PreConstruct");
static_assert(sizeof(BP_CareerLocationCategoryHeader_C_PreConstruct) == 0x000001, "Wrong size on BP_CareerLocationCategoryHeader_C_PreConstruct");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_CareerLocationCategoryHeader_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_CareerLocationCategoryHeader.BP_CareerLocationCategoryHeader_C.SetLocationProgress
// 0x00E8 (0x00E8 - 0x0000)
struct BP_CareerLocationCategoryHeader_C_SetLocationProgress final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
};
static_assert(alignof(BP_CareerLocationCategoryHeader_C_SetLocationProgress) == 0x000008, "Wrong alignment on BP_CareerLocationCategoryHeader_C_SetLocationProgress");
static_assert(sizeof(BP_CareerLocationCategoryHeader_C_SetLocationProgress) == 0x0000E8, "Wrong size on BP_CareerLocationCategoryHeader_C_SetLocationProgress");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, Current) == 0x000000, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::Current' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, Max) == 0x000004, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::Max' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, CallFunc_Min_ReturnValue) == 0x000010, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000068, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_SetLocationProgress, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'BP_CareerLocationCategoryHeader_C_SetLocationProgress::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_CareerLocationCategoryHeader.BP_CareerLocationCategoryHeader_C.UpdateNeededTasks
// 0x00B8 (0x00B8 - 0x0000)
struct BP_CareerLocationCategoryHeader_C_UpdateNeededTasks final
{
public:
	class UGymSaveGameTutorial*                   SaveFile;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCareerContentData                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNeededTasksNum_Required_Points;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCompletedTasksForLocation_Tasks;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0098(0x0018)()
	class UGymSaveGameTutorial*                   CallFunc_GetSaveFile_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks) == 0x000008, "Wrong alignment on BP_CareerLocationCategoryHeader_C_UpdateNeededTasks");
static_assert(sizeof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks) == 0x0000B8, "Wrong size on BP_CareerLocationCategoryHeader_C_UpdateNeededTasks");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, SaveFile) == 0x000000, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::SaveFile' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_Conv_StringToName_ReturnValue) == 0x00000C, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_GetNeededTasksNum_Required_Points) == 0x00006C, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_GetNeededTasksNum_Required_Points' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000070, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_GetCompletedTasksForLocation_Tasks) == 0x000078, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_GetCompletedTasksForLocation_Tasks' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_FTrunc_ReturnValue) == 0x000088, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_FTrunc_ReturnValue_1) == 0x00008C, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_Max_ReturnValue) == 0x000094, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_Conv_IntToText_ReturnValue) == 0x000098, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CareerLocationCategoryHeader_C_UpdateNeededTasks, CallFunc_GetSaveFile_ReturnValue) == 0x0000B0, "Member 'BP_CareerLocationCategoryHeader_C_UpdateNeededTasks::CallFunc_GetSaveFile_ReturnValue' has a wrong offset!");

}

