#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorPhysicsRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EditorPiece_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EditorPhysicsRow.BP_EditorPhysicsRow_C
// 0x0038 (0x0300 - 0x02C8)
class UBP_EditorPhysicsRow_C final : public UBP_EditorPiece_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EditorPhysicsRow_C;              // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInputActionUI_C*                       DownInputActionUI;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_67;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             OptionBox;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       UpInputActionUI;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_EditorOptionSlot_C*                 SelectedOption;                                    // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GymEditorWidget_C*                  EditorGui;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void CreateDurations(class UBP_EditorOptionSlot_C** OptionSlot);
	void CtxDecline();
	void CtxDown();
	void CtxLeft();
	void CtxRight();
	void CtxUp();
	void ExecuteUbergraph_BP_EditorPhysicsRow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditorPhysicsRow_C">();
	}
	static class UBP_EditorPhysicsRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EditorPhysicsRow_C>();
	}
};
static_assert(alignof(UBP_EditorPhysicsRow_C) == 0x000008, "Wrong alignment on UBP_EditorPhysicsRow_C");
static_assert(sizeof(UBP_EditorPhysicsRow_C) == 0x000300, "Wrong size on UBP_EditorPhysicsRow_C");
static_assert(offsetof(UBP_EditorPhysicsRow_C, UberGraphFrame_BP_EditorPhysicsRow_C) == 0x0002C8, "Member 'UBP_EditorPhysicsRow_C::UberGraphFrame_BP_EditorPhysicsRow_C' has a wrong offset!");
static_assert(offsetof(UBP_EditorPhysicsRow_C, DownInputActionUI) == 0x0002D0, "Member 'UBP_EditorPhysicsRow_C::DownInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_EditorPhysicsRow_C, Image_67) == 0x0002D8, "Member 'UBP_EditorPhysicsRow_C::Image_67' has a wrong offset!");
static_assert(offsetof(UBP_EditorPhysicsRow_C, OptionBox) == 0x0002E0, "Member 'UBP_EditorPhysicsRow_C::OptionBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorPhysicsRow_C, UpInputActionUI) == 0x0002E8, "Member 'UBP_EditorPhysicsRow_C::UpInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_EditorPhysicsRow_C, SelectedOption) == 0x0002F0, "Member 'UBP_EditorPhysicsRow_C::SelectedOption' has a wrong offset!");
static_assert(offsetof(UBP_EditorPhysicsRow_C, EditorGui) == 0x0002F8, "Member 'UBP_EditorPhysicsRow_C::EditorGui' has a wrong offset!");

}

