#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorAssetSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_EditorPiece_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EditorAssetSlot.BP_EditorAssetSlot_C
// 0x0068 (0x0330 - 0x02C8)
class UBP_EditorAssetSlot_C final : public UBP_EditorPiece_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EditorAssetSlot_C;               // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Expand;                                            // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       AssetName;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Spacer;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Image;                                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UGymLevelAssetData*                     Asset;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_GymEditorWidget_C*                  EditorGui;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_EditorVariantSlot_C*                SelectedVariant;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimHack;                                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VariantIndex;                                      // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsConstructed;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreFocusAnimation;                              // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CtxDown();
	void CtxUp();
	void ExecuteUbergraph_BP_EditorAssetSlot(int32 EntryPoint);
	void GetOptionCount(int32* Count);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnEditorPieceSelected();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditorAssetSlot_C">();
	}
	static class UBP_EditorAssetSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EditorAssetSlot_C>();
	}
};
static_assert(alignof(UBP_EditorAssetSlot_C) == 0x000008, "Wrong alignment on UBP_EditorAssetSlot_C");
static_assert(sizeof(UBP_EditorAssetSlot_C) == 0x000330, "Wrong size on UBP_EditorAssetSlot_C");
static_assert(offsetof(UBP_EditorAssetSlot_C, UberGraphFrame_BP_EditorAssetSlot_C) == 0x0002C8, "Member 'UBP_EditorAssetSlot_C::UberGraphFrame_BP_EditorAssetSlot_C' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, Expand) == 0x0002D0, "Member 'UBP_EditorAssetSlot_C::Expand' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, AssetName) == 0x0002D8, "Member 'UBP_EditorAssetSlot_C::AssetName' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, ScrollBox) == 0x0002E0, "Member 'UBP_EditorAssetSlot_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, SizeBox) == 0x0002E8, "Member 'UBP_EditorAssetSlot_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, Spacer) == 0x0002F0, "Member 'UBP_EditorAssetSlot_C::Spacer' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, VerticalBox) == 0x0002F8, "Member 'UBP_EditorAssetSlot_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, Image) == 0x000300, "Member 'UBP_EditorAssetSlot_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, Asset) == 0x000308, "Member 'UBP_EditorAssetSlot_C::Asset' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, EditorGui) == 0x000310, "Member 'UBP_EditorAssetSlot_C::EditorGui' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, SelectedVariant) == 0x000318, "Member 'UBP_EditorAssetSlot_C::SelectedVariant' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, AnimHack) == 0x000320, "Member 'UBP_EditorAssetSlot_C::AnimHack' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, VariantIndex) == 0x000324, "Member 'UBP_EditorAssetSlot_C::VariantIndex' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, IsConstructed) == 0x000328, "Member 'UBP_EditorAssetSlot_C::IsConstructed' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetSlot_C, IgnoreFocusAnimation) == 0x000329, "Member 'UBP_EditorAssetSlot_C::IgnoreFocusAnimation' has a wrong offset!");

}

