#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorAssetRow

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EditorAssetRow.BP_EditorAssetRow_C.AddBombTimeModifier
// 0x0148 (0x0148 - 0x0000)
struct BP_EditorAssetRow_C_AddBombTimeModifier final
{
public:
	int32                                         InitialSelection;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditorGuiOption>               TimesSettings;                                     // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                Times;                                             // 0x0018(0x0010)(Edit, BlueprintVisible)
	class UBP_EditorOptionSlot_C*                 CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0018)(ConstParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GymMap_C*                           CallFunc_GetActorOfClass_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymMapRuleModifierControl*             CallFunc_GetRuleModifierControl_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatModifier_Value;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatModifier_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TimeSecondsToString_ReturnValue;          // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditorGuiOption                       K2Node_MakeStruct_EditorGuiOption;                 // 0x00D8(0x0040)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0128(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_FloatValue_ImplicitCast;         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TimeSecondsToString_InSeconds_ImplicitCast; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorAssetRow_C_AddBombTimeModifier) == 0x000008, "Wrong alignment on BP_EditorAssetRow_C_AddBombTimeModifier");
static_assert(sizeof(BP_EditorAssetRow_C_AddBombTimeModifier) == 0x000148, "Wrong size on BP_EditorAssetRow_C_AddBombTimeModifier");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, InitialSelection) == 0x000000, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::InitialSelection' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, TimesSettings) == 0x000008, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::TimesSettings' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, Times) == 0x000018, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::Times' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, Temp_text_Variable) == 0x000040, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_MakeLiteralName_ReturnValue) == 0x000058, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_GetActorOfClass_ReturnValue) == 0x000060, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_GetRuleModifierControl_ReturnValue) == 0x000068, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_GetRuleModifierControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_GetFloatModifier_Value) == 0x000070, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_GetFloatModifier_Value' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_GetFloatModifier_ReturnValue) == 0x000074, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_GetFloatModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, Temp_int_Variable) == 0x000078, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000088, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_BooleanAND_ReturnValue) == 0x0000A0, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_TimeSecondsToString_ReturnValue) == 0x0000A8, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_TimeSecondsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, K2Node_MakeStruct_EditorGuiOption) == 0x0000D8, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::K2Node_MakeStruct_EditorGuiOption' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Array_Add_ReturnValue_1) == 0x000118, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Add_IntInt_ReturnValue_1) == 0x00011C, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, Temp_name_Variable) == 0x000128, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_AddChild_ReturnValue) == 0x000130, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000138, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, K2Node_MakeStruct_FloatValue_ImplicitCast) == 0x000140, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::K2Node_MakeStruct_FloatValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddBombTimeModifier, CallFunc_TimeSecondsToString_InSeconds_ImplicitCast) == 0x000144, "Member 'BP_EditorAssetRow_C_AddBombTimeModifier::CallFunc_TimeSecondsToString_InSeconds_ImplicitCast' has a wrong offset!");

// Function BP_EditorAssetRow.BP_EditorAssetRow_C.AddFlagModifier
// 0x0118 (0x0118 - 0x0000)
struct BP_EditorAssetRow_C_AddFlagModifier final
{
public:
	int32                                         InitialSelection;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditorGuiOption>               FlagsSettings;                                     // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Flags_0;                                           // 0x0018(0x0010)(Edit, BlueprintVisible)
	class UBP_EditorOptionSlot_C*                 CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0018)(ConstParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditorGuiOption                       K2Node_MakeStruct_EditorGuiOption;                 // 0x0098(0x0040)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymMapRuleModifierControl*             CallFunc_GetRuleModifierControl_ReturnValue;       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringModifier_Value;                  // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStringModifier_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0108(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorAssetRow_C_AddFlagModifier) == 0x000008, "Wrong alignment on BP_EditorAssetRow_C_AddFlagModifier");
static_assert(sizeof(BP_EditorAssetRow_C_AddFlagModifier) == 0x000118, "Wrong size on BP_EditorAssetRow_C_AddFlagModifier");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, InitialSelection) == 0x000000, "Member 'BP_EditorAssetRow_C_AddFlagModifier::InitialSelection' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, FlagsSettings) == 0x000008, "Member 'BP_EditorAssetRow_C_AddFlagModifier::FlagsSettings' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, Flags_0) == 0x000018, "Member 'BP_EditorAssetRow_C_AddFlagModifier::Flags_0' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_EditorAssetRow_C_AddFlagModifier::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_EditorAssetRow_C_AddFlagModifier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_EditorAssetRow_C_AddFlagModifier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, Temp_text_Variable) == 0x000050, "Member 'BP_EditorAssetRow_C_AddFlagModifier::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, K2Node_MakeStruct_EditorGuiOption) == 0x000098, "Member 'BP_EditorAssetRow_C_AddFlagModifier::K2Node_MakeStruct_EditorGuiOption' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_MakeLiteralName_ReturnValue) == 0x0000DC, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_GetRuleModifierControl_ReturnValue) == 0x0000E8, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_GetRuleModifierControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_GetStringModifier_Value) == 0x0000F0, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_GetStringModifier_Value' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_GetStringModifier_ReturnValue) == 0x000100, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_GetStringModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000101, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_BooleanAND_ReturnValue) == 0x000102, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_Array_Add_ReturnValue) == 0x000104, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, Temp_name_Variable) == 0x000108, "Member 'BP_EditorAssetRow_C_AddFlagModifier::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddFlagModifier, CallFunc_AddChild_ReturnValue) == 0x000110, "Member 'BP_EditorAssetRow_C_AddFlagModifier::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function BP_EditorAssetRow.BP_EditorAssetRow_C.AddLapModifier
// 0x0108 (0x0108 - 0x0000)
struct BP_EditorAssetRow_C_AddLapModifier final
{
public:
	int32                                         InitialSelection;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditorGuiOption>               LapsSettings;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Laps;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	class UBP_EditorOptionSlot_C*                 CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)(ConstParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0060(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditorGuiOption                       K2Node_MakeStruct_EditorGuiOption;                 // 0x0080(0x0040)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymMapRuleModifierControl*             CallFunc_GetRuleModifierControl_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntModifier_Value;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIntModifier_ReturnValue;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00E8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorAssetRow_C_AddLapModifier) == 0x000008, "Wrong alignment on BP_EditorAssetRow_C_AddLapModifier");
static_assert(sizeof(BP_EditorAssetRow_C_AddLapModifier) == 0x000108, "Wrong size on BP_EditorAssetRow_C_AddLapModifier");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, InitialSelection) == 0x000000, "Member 'BP_EditorAssetRow_C_AddLapModifier::InitialSelection' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, LapsSettings) == 0x000008, "Member 'BP_EditorAssetRow_C_AddLapModifier::LapsSettings' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, Laps) == 0x000018, "Member 'BP_EditorAssetRow_C_AddLapModifier::Laps' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, Temp_text_Variable) == 0x000030, "Member 'BP_EditorAssetRow_C_AddLapModifier::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_EditorAssetRow_C_AddLapModifier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_EditorAssetRow_C_AddLapModifier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Array_Get_Item) == 0x000054, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Conv_IntToText_ReturnValue) == 0x000060, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, K2Node_MakeStruct_EditorGuiOption) == 0x000080, "Member 'BP_EditorAssetRow_C_AddLapModifier::K2Node_MakeStruct_EditorGuiOption' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_MakeLiteralName_ReturnValue) == 0x0000C0, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_GetRuleModifierControl_ReturnValue) == 0x0000D0, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_GetRuleModifierControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_GetIntModifier_Value) == 0x0000D8, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_GetIntModifier_Value' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_GetIntModifier_ReturnValue) == 0x0000DC, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_GetIntModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000DD, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_BooleanAND_ReturnValue) == 0x0000DE, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Array_Add_ReturnValue) == 0x0000E0, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, Temp_int_Variable) == 0x0000E4, "Member 'BP_EditorAssetRow_C_AddLapModifier::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, Temp_name_Variable) == 0x0000E8, "Member 'BP_EditorAssetRow_C_AddLapModifier::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Array_Add_ReturnValue_1) == 0x0000F0, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F4, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLapModifier, CallFunc_AddChild_ReturnValue) == 0x000100, "Member 'BP_EditorAssetRow_C_AddLapModifier::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function BP_EditorAssetRow.BP_EditorAssetRow_C.AddLootModifier
// 0x0148 (0x0148 - 0x0000)
struct BP_EditorAssetRow_C_AddLootModifier final
{
public:
	int32                                         InitialSelection;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditorGuiOption>               LapsSettings;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         LootModes;                                         // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class UBP_EditorOptionSlot_C*                 CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0080(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x00A0(0x0018)(ConstParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FEditorGuiOption                       K2Node_MakeStruct_EditorGuiOption;                 // 0x00C8(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymMapRuleModifierControl*             CallFunc_GetRuleModifierControl_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringModifier_Value;                  // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStringModifier_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0138(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorAssetRow_C_AddLootModifier) == 0x000008, "Wrong alignment on BP_EditorAssetRow_C_AddLootModifier");
static_assert(sizeof(BP_EditorAssetRow_C_AddLootModifier) == 0x000148, "Wrong size on BP_EditorAssetRow_C_AddLootModifier");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, InitialSelection) == 0x000000, "Member 'BP_EditorAssetRow_C_AddLootModifier::InitialSelection' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, LapsSettings) == 0x000008, "Member 'BP_EditorAssetRow_C_AddLootModifier::LapsSettings' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, LootModes) == 0x000018, "Member 'BP_EditorAssetRow_C_AddLootModifier::LootModes' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, Temp_int_Variable) == 0x000028, "Member 'BP_EditorAssetRow_C_AddLootModifier::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, Temp_text_Variable) == 0x000030, "Member 'BP_EditorAssetRow_C_AddLootModifier::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, Temp_text_Variable_1) == 0x000048, "Member 'BP_EditorAssetRow_C_AddLootModifier::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_Create_ReturnValue) == 0x000060, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_EditorAssetRow_C_AddLootModifier::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BP_EditorAssetRow_C_AddLootModifier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'BP_EditorAssetRow_C_AddLootModifier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, K2Node_Select_Default) == 0x000080, "Member 'BP_EditorAssetRow_C_AddLootModifier::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, Temp_text_Variable_2) == 0x0000A0, "Member 'BP_EditorAssetRow_C_AddLootModifier::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, K2Node_MakeStruct_EditorGuiOption) == 0x0000C8, "Member 'BP_EditorAssetRow_C_AddLootModifier::K2Node_MakeStruct_EditorGuiOption' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_MakeLiteralName_ReturnValue) == 0x00010C, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_IsValid_ReturnValue) == 0x000115, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_GetRuleModifierControl_ReturnValue) == 0x000118, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_GetRuleModifierControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_GetStringModifier_Value) == 0x000120, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_GetStringModifier_Value' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_GetStringModifier_ReturnValue) == 0x000130, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_GetStringModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000131, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_BooleanAND_ReturnValue) == 0x000132, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_Array_Add_ReturnValue) == 0x000134, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, Temp_name_Variable) == 0x000138, "Member 'BP_EditorAssetRow_C_AddLootModifier::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddLootModifier, CallFunc_AddChild_ReturnValue) == 0x000140, "Member 'BP_EditorAssetRow_C_AddLootModifier::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function BP_EditorAssetRow.BP_EditorAssetRow_C.AddRuleModifier
// 0x0128 (0x0128 - 0x0000)
struct BP_EditorAssetRow_C_AddRuleModifier final
{
public:
	int32                                         InitialSelection;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditorGuiOption>               LapsSettings;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Rules;                                             // 0x0018(0x0010)(Edit, BlueprintVisible)
	class UBP_EditorOptionSlot_C*                 CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0018)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetRule_ReturnValue;                      // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetRule_ReturnValue_1;                    // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_RuleIdToDisplayName_DisplayName;          // 0x00A8(0x0018)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditorGuiOption                       K2Node_MakeStruct_EditorGuiOption;                 // 0x00C8(0x0040)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0114(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorAssetRow_C_AddRuleModifier) == 0x000008, "Wrong alignment on BP_EditorAssetRow_C_AddRuleModifier");
static_assert(sizeof(BP_EditorAssetRow_C_AddRuleModifier) == 0x000128, "Wrong size on BP_EditorAssetRow_C_AddRuleModifier");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, InitialSelection) == 0x000000, "Member 'BP_EditorAssetRow_C_AddRuleModifier::InitialSelection' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, LapsSettings) == 0x000008, "Member 'BP_EditorAssetRow_C_AddRuleModifier::LapsSettings' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, Rules) == 0x000018, "Member 'BP_EditorAssetRow_C_AddRuleModifier::Rules' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_EditorAssetRow_C_AddRuleModifier::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_EditorAssetRow_C_AddRuleModifier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_EditorAssetRow_C_AddRuleModifier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, Temp_text_Variable) == 0x000050, "Member 'BP_EditorAssetRow_C_AddRuleModifier::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_GetRule_ReturnValue) == 0x00006C, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_GetRule_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000088, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_GetRule_ReturnValue_1) == 0x00008C, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_GetRule_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_Conv_NameToString_ReturnValue) == 0x000098, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_RuleIdToDisplayName_DisplayName) == 0x0000A8, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_RuleIdToDisplayName_DisplayName' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0000C0, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, K2Node_MakeStruct_EditorGuiOption) == 0x0000C8, "Member 'BP_EditorAssetRow_C_AddRuleModifier::K2Node_MakeStruct_EditorGuiOption' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_IsEmpty_ReturnValue) == 0x000108, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000109, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_BooleanOR_ReturnValue) == 0x00010A, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_Array_Length_ReturnValue) == 0x00010C, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_BooleanAND_ReturnValue) == 0x000110, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetRow_C_AddRuleModifier, CallFunc_Less_IntInt_ReturnValue) == 0x000111, "Member 'BP_EditorAssetRow_C_AddRuleModifier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
