#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorToolSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_EditorToolSlot.BP_EditorToolSlot_C.ExecuteUbergraph_BP_EditorToolSlot
// 0x0030 (0x0030 - 0x0000)
struct BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
	EFocusCause                                   CallFunc_GetFocusCause_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0018)()
};
static_assert(alignof(BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot) == 0x000008, "Wrong alignment on BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot");
static_assert(sizeof(BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot) == 0x000030, "Wrong size on BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot");
static_assert(offsetof(BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot, EntryPoint) == 0x000000, "Member 'BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot, CallFunc_GetFocusCause_ReturnValue) == 0x000014, "Member 'BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot::CallFunc_GetFocusCause_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000015, "Member 'BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'BP_EditorToolSlot_C_ExecuteUbergraph_BP_EditorToolSlot::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");

// Function BP_EditorToolSlot.BP_EditorToolSlot_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_EditorToolSlot_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_EditorToolSlot_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on BP_EditorToolSlot_C_OnAddedToFocusPath");
static_assert(sizeof(BP_EditorToolSlot_C_OnAddedToFocusPath) == 0x000008, "Wrong size on BP_EditorToolSlot_C_OnAddedToFocusPath");
static_assert(offsetof(BP_EditorToolSlot_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'BP_EditorToolSlot_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_EditorToolSlot.BP_EditorToolSlot_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_EditorToolSlot_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_EditorToolSlot_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on BP_EditorToolSlot_C_OnRemovedFromFocusPath");
static_assert(sizeof(BP_EditorToolSlot_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on BP_EditorToolSlot_C_OnRemovedFromFocusPath");
static_assert(offsetof(BP_EditorToolSlot_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'BP_EditorToolSlot_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

}

