#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorToolsRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EditorPiece_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EditorToolsRow.BP_EditorToolsRow_C
// 0x0040 (0x0308 - 0x02C8)
class UBP_EditorToolsRow_C final : public UBP_EditorPiece_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EditorToolsRow_C;                // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_67;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ToolsBox;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_EditorToolSlot_C*                   SelectedOption;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GymEditorWidget_C*                  EditorGui;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FString>                         WallToolIgnoreList;                                // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsConstructed;                                     // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CtxDecline();
	void CtxLeft();
	void CtxRight();
	void ExecuteUbergraph_BP_EditorToolsRow(int32 EntryPoint);
	void OnEditorPieceSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditorToolsRow_C">();
	}
	static class UBP_EditorToolsRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EditorToolsRow_C>();
	}
};
static_assert(alignof(UBP_EditorToolsRow_C) == 0x000008, "Wrong alignment on UBP_EditorToolsRow_C");
static_assert(sizeof(UBP_EditorToolsRow_C) == 0x000308, "Wrong size on UBP_EditorToolsRow_C");
static_assert(offsetof(UBP_EditorToolsRow_C, UberGraphFrame_BP_EditorToolsRow_C) == 0x0002C8, "Member 'UBP_EditorToolsRow_C::UberGraphFrame_BP_EditorToolsRow_C' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolsRow_C, Image_67) == 0x0002D0, "Member 'UBP_EditorToolsRow_C::Image_67' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolsRow_C, ToolsBox) == 0x0002D8, "Member 'UBP_EditorToolsRow_C::ToolsBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolsRow_C, SelectedOption) == 0x0002E0, "Member 'UBP_EditorToolsRow_C::SelectedOption' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolsRow_C, EditorGui) == 0x0002E8, "Member 'UBP_EditorToolsRow_C::EditorGui' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolsRow_C, WallToolIgnoreList) == 0x0002F0, "Member 'UBP_EditorToolsRow_C::WallToolIgnoreList' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolsRow_C, IsConstructed) == 0x000300, "Member 'UBP_EditorToolsRow_C::IsConstructed' has a wrong offset!");

}

