#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorAssetSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_EditorAssetSlot.BP_EditorAssetSlot_C.ExecuteUbergraph_BP_EditorAssetSlot
// 0x0158 (0x0158 - 0x0000)
struct BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0008(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0010(0x0008)(NoDestructor)
	EFocusCause                                   CallFunc_GetFocusCause_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGymLevelAssetVariant                  CallFunc_Array_Get_Item;                           // 0x0030(0x0038)()
	class UTexture*                               CallFunc_GetThumbnail_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymAssetVariantId                     K2Node_MakeStruct_GymAssetVariantId;               // 0x007C(0x0010)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorVariantSlot_C*                K2Node_DynamicCast_AsBP_Editor_Variant_Slot;       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EditorVariantSlot_C*                K2Node_DynamicCast_AsBP_Editor_Variant_Slot_1;     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildIndex_ReturnValue_1;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorVariantSlot_C*                K2Node_DynamicCast_AsBP_Editor_Variant_Slot_2;     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorVariantSlot_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot) == 0x000008, "Wrong alignment on BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot");
static_assert(sizeof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot) == 0x000158, "Wrong size on BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, EntryPoint) == 0x000000, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_Event_InFocusEvent_1) == 0x000008, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_Event_InFocusEvent) == 0x000010, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetFocusCause_ReturnValue) == 0x000018, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetFocusCause_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetThumbnail_ReturnValue) == 0x000068, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetThumbnail_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_MakeStruct_GymAssetVariantId) == 0x00007C, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_MakeStruct_GymAssetVariantId' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetChildrenCount_ReturnValue) == 0x00008C, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetChildIndex_ReturnValue) == 0x000090, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Add_IntInt_ReturnValue_2) == 0x00009C, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Percent_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Percent_IntInt_ReturnValue_1) == 0x0000A4, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetChildAt_ReturnValue) == 0x0000A8, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetChildAt_ReturnValue_1) == 0x0000B0, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_DynamicCast_AsBP_Editor_Variant_Slot) == 0x0000B8, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_DynamicCast_AsBP_Editor_Variant_Slot' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_DynamicCast_AsBP_Editor_Variant_Slot_1) == 0x0000C8, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_DynamicCast_AsBP_Editor_Variant_Slot_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_Event_MyGeometry) == 0x0000D4, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_Event_InDeltaTime) == 0x00010C, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_PlayAnimation_ReturnValue) == 0x000110, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetChildIndex_ReturnValue_1) == 0x000118, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetChildIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetChildrenCount_ReturnValue_1) == 0x00011C, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Clamp_ReturnValue) == 0x000120, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_GetChildAt_ReturnValue_2) == 0x000128, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_DynamicCast_AsBP_Editor_Variant_Slot_2) == 0x000130, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_DynamicCast_AsBP_Editor_Variant_Slot_2' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, K2Node_DynamicCast_bSuccess_2) == 0x000138, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, Temp_int_Loop_Counter_Variable) == 0x00013C, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_Add_IntInt_ReturnValue_3) == 0x000144, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_SpawnObject_ReturnValue) == 0x000148, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot, CallFunc_AddChild_ReturnValue) == 0x000150, "Member 'BP_EditorAssetSlot_C_ExecuteUbergraph_BP_EditorAssetSlot::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function BP_EditorAssetSlot.BP_EditorAssetSlot_C.GetOptionCount
// 0x0008 (0x0008 - 0x0000)
struct BP_EditorAssetSlot_C_GetOptionCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorAssetSlot_C_GetOptionCount) == 0x000004, "Wrong alignment on BP_EditorAssetSlot_C_GetOptionCount");
static_assert(sizeof(BP_EditorAssetSlot_C_GetOptionCount) == 0x000008, "Wrong size on BP_EditorAssetSlot_C_GetOptionCount");
static_assert(offsetof(BP_EditorAssetSlot_C_GetOptionCount, Count) == 0x000000, "Member 'BP_EditorAssetSlot_C_GetOptionCount::Count' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_GetOptionCount, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'BP_EditorAssetSlot_C_GetOptionCount::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");

// Function BP_EditorAssetSlot.BP_EditorAssetSlot_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_EditorAssetSlot_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_EditorAssetSlot_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on BP_EditorAssetSlot_C_OnAddedToFocusPath");
static_assert(sizeof(BP_EditorAssetSlot_C_OnAddedToFocusPath) == 0x000008, "Wrong size on BP_EditorAssetSlot_C_OnAddedToFocusPath");
static_assert(offsetof(BP_EditorAssetSlot_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'BP_EditorAssetSlot_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_EditorAssetSlot.BP_EditorAssetSlot_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_EditorAssetSlot_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_EditorAssetSlot_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on BP_EditorAssetSlot_C_OnRemovedFromFocusPath");
static_assert(sizeof(BP_EditorAssetSlot_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on BP_EditorAssetSlot_C_OnRemovedFromFocusPath");
static_assert(offsetof(BP_EditorAssetSlot_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'BP_EditorAssetSlot_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_EditorAssetSlot.BP_EditorAssetSlot_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_EditorAssetSlot_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorAssetSlot_C_Tick) == 0x000004, "Wrong alignment on BP_EditorAssetSlot_C_Tick");
static_assert(sizeof(BP_EditorAssetSlot_C_Tick) == 0x00003C, "Wrong size on BP_EditorAssetSlot_C_Tick");
static_assert(offsetof(BP_EditorAssetSlot_C_Tick, MyGeometry) == 0x000000, "Member 'BP_EditorAssetSlot_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_EditorAssetSlot_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_EditorAssetSlot_C_Tick::InDeltaTime' has a wrong offset!");

}

