#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorAssetRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EditorPiece_classes.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EditorAssetRow.BP_EditorAssetRow_C
// 0x00B0 (0x0378 - 0x02C8)
class UBP_EditorAssetRow_C final : public UBP_EditorPiece_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EditorAssetRow_C;                // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             AssetBox;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_0;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       DownInputActionUI;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_67;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       UpInputActionUI;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_EditorPiece_C*                      SelectedAsset;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UGymLevelAssetData*>             Assets;                                            // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UBP_EditorAssetSlot_C*                  FirstAsset;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GymEditorWidget_C*                  EditorGui;                                         // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 LastTickRuleClass;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGymLevelAssetData*                     SelectedAssetObject;                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedVariantIndex;                              // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LevelKitId;                                        // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsConstructed;                                     // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGymEditorCategory                            Category;                                          // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Current_Rule_Id;                                   // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   CurrentOptionId;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorOptionItem_C*                 Target;                                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddBombTimeModifier();
	void AddFlagModifier();
	void AddLapModifier();
	void AddLootModifier();
	void AddRuleModifier();
	void AddTideSpeedModifier();
	void AddTimeModifier();
	void AssetSupportsRules(class UGymLevelAssetData* Asset, bool* Result);
	void CheckRules(bool* Changed);
	void Construct();
	void CtxConfirm();
	void CtxDecline();
	void CtxDown();
	void CtxLeft();
	void CtxRight();
	void CtxUp();
	void ExecuteUbergraph_BP_EditorAssetRow(int32 EntryPoint);
	void Get_Asset_Slot_for_Asset(const struct FGymAssetVariantId& AssetId, class UBP_EditorAssetSlot_C** AssetSlot, class UBP_EditorVariantSlot_C** VariantSlot, class UGymLevelAssetData** AssetObject, int32* VariantIndex, bool* Success);
	void HideVariantArrows();
	void Init();
	void InitBombModifiers();
	void InitCircuitModifiers();
	void Initialize();
	void InitializeModifiers();
	void InitLootModifiers();
	void InitObbyModifiers();
	void InitSprintModifiers();
	void InitTideModifiers();
	void LevelKitChanged(TArray<class UGymLevelAssetData*>& NewAssets, const struct FGymLevelKit& BewLevelKit);
	void OnEditorPieceSelected();
	void RuleIdToDisplayName(const class FString& RuleId, class FText* DisplayName);
	void SetUpDownArrows(class UBP_EditorPiece_C* AssetSlot);
	void ShowVariantArrows();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditorAssetRow_C">();
	}
	static class UBP_EditorAssetRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EditorAssetRow_C>();
	}
};
static_assert(alignof(UBP_EditorAssetRow_C) == 0x000008, "Wrong alignment on UBP_EditorAssetRow_C");
static_assert(sizeof(UBP_EditorAssetRow_C) == 0x000378, "Wrong size on UBP_EditorAssetRow_C");
static_assert(offsetof(UBP_EditorAssetRow_C, UberGraphFrame_BP_EditorAssetRow_C) == 0x0002C8, "Member 'UBP_EditorAssetRow_C::UberGraphFrame_BP_EditorAssetRow_C' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, AssetBox) == 0x0002D0, "Member 'UBP_EditorAssetRow_C::AssetBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, CommonActionWidget) == 0x0002D8, "Member 'UBP_EditorAssetRow_C::CommonActionWidget' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, CommonActionWidget_0) == 0x0002E0, "Member 'UBP_EditorAssetRow_C::CommonActionWidget_0' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, DownInputActionUI) == 0x0002E8, "Member 'UBP_EditorAssetRow_C::DownInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, Image_67) == 0x0002F0, "Member 'UBP_EditorAssetRow_C::Image_67' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, UpInputActionUI) == 0x0002F8, "Member 'UBP_EditorAssetRow_C::UpInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, SelectedAsset) == 0x000300, "Member 'UBP_EditorAssetRow_C::SelectedAsset' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, Assets) == 0x000308, "Member 'UBP_EditorAssetRow_C::Assets' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, FirstAsset) == 0x000318, "Member 'UBP_EditorAssetRow_C::FirstAsset' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, EditorGui) == 0x000320, "Member 'UBP_EditorAssetRow_C::EditorGui' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, LastTickRuleClass) == 0x000328, "Member 'UBP_EditorAssetRow_C::LastTickRuleClass' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, SelectedAssetObject) == 0x000330, "Member 'UBP_EditorAssetRow_C::SelectedAssetObject' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, SelectedVariantIndex) == 0x000338, "Member 'UBP_EditorAssetRow_C::SelectedVariantIndex' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, LevelKitId) == 0x000340, "Member 'UBP_EditorAssetRow_C::LevelKitId' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, IsConstructed) == 0x000350, "Member 'UBP_EditorAssetRow_C::IsConstructed' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, Category) == 0x000351, "Member 'UBP_EditorAssetRow_C::Category' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, Current_Rule_Id) == 0x000358, "Member 'UBP_EditorAssetRow_C::Current_Rule_Id' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, CurrentOptionId) == 0x000368, "Member 'UBP_EditorAssetRow_C::CurrentOptionId' has a wrong offset!");
static_assert(offsetof(UBP_EditorAssetRow_C, Target) == 0x000370, "Member 'UBP_EditorAssetRow_C::Target' has a wrong offset!");

}

