#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorToolSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EditorToolSlot.BP_EditorToolSlot_C
// 0x0038 (0x02F8 - 0x02C0)
class UBP_EditorToolSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBox;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Tint;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UGymToolSetting*                        Tool;                                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_EditorToolSlot(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditorToolSlot_C">();
	}
	static class UBP_EditorToolSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EditorToolSlot_C>();
	}
};
static_assert(alignof(UBP_EditorToolSlot_C) == 0x000008, "Wrong alignment on UBP_EditorToolSlot_C");
static_assert(sizeof(UBP_EditorToolSlot_C) == 0x0002F8, "Wrong size on UBP_EditorToolSlot_C");
static_assert(offsetof(UBP_EditorToolSlot_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_EditorToolSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolSlot_C, SizeBox) == 0x0002C8, "Member 'UBP_EditorToolSlot_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolSlot_C, TextBox) == 0x0002D0, "Member 'UBP_EditorToolSlot_C::TextBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolSlot_C, Thumbnail) == 0x0002D8, "Member 'UBP_EditorToolSlot_C::Thumbnail' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolSlot_C, Tint) == 0x0002E0, "Member 'UBP_EditorToolSlot_C::Tint' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolSlot_C, Texture) == 0x0002E8, "Member 'UBP_EditorToolSlot_C::Texture' has a wrong offset!");
static_assert(offsetof(UBP_EditorToolSlot_C, Tool) == 0x0002F0, "Member 'UBP_EditorToolSlot_C::Tool' has a wrong offset!");

}

