#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorOptionSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_EditorPiece_classes.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EditorOptionSlot.BP_EditorOptionSlot_C
// 0x0090 (0x0358 - 0x02C8)
class UBP_EditorOptionSlot_C final : public UBP_EditorPiece_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EditorOptionSlot_C;              // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Expand;                                            // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Spacer;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_100;                                     // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GymEditorWidget_C*                  EditorGui;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_EditorOptionItem_C*                 SelectedValue;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimHack;                                          // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditorGuiOption>               Values;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   OptionDisplayName;                                 // 0x0330(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         FirstSelectIndex;                                  // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IgnoreFocusAnimation;                              // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedsConfirm;                                     // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUnsaved;                                          // 0x034E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F[0x1];                                      // 0x034F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OptionId;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void CtxConfirm();
	void CtxDown();
	void CtxUp();
	void ExecuteUbergraph_BP_EditorOptionSlot(int32 EntryPoint);
	void GetOptionCount(int32* Count);
	ESlateVisibility GetVisibility_0();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnEditorPieceSelected();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSelect();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditorOptionSlot_C">();
	}
	static class UBP_EditorOptionSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EditorOptionSlot_C>();
	}
};
static_assert(alignof(UBP_EditorOptionSlot_C) == 0x000008, "Wrong alignment on UBP_EditorOptionSlot_C");
static_assert(sizeof(UBP_EditorOptionSlot_C) == 0x000358, "Wrong size on UBP_EditorOptionSlot_C");
static_assert(offsetof(UBP_EditorOptionSlot_C, UberGraphFrame_BP_EditorOptionSlot_C) == 0x0002C8, "Member 'UBP_EditorOptionSlot_C::UberGraphFrame_BP_EditorOptionSlot_C' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, Expand) == 0x0002D0, "Member 'UBP_EditorOptionSlot_C::Expand' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, NameText) == 0x0002D8, "Member 'UBP_EditorOptionSlot_C::NameText' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, ScrollBox) == 0x0002E0, "Member 'UBP_EditorOptionSlot_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, SizeBox) == 0x0002E8, "Member 'UBP_EditorOptionSlot_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, Spacer) == 0x0002F0, "Member 'UBP_EditorOptionSlot_C::Spacer' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, TextBlock_100) == 0x0002F8, "Member 'UBP_EditorOptionSlot_C::TextBlock_100' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, VerticalBox) == 0x000300, "Member 'UBP_EditorOptionSlot_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, EditorGui) == 0x000308, "Member 'UBP_EditorOptionSlot_C::EditorGui' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, SelectedValue) == 0x000310, "Member 'UBP_EditorOptionSlot_C::SelectedValue' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, AnimHack) == 0x000318, "Member 'UBP_EditorOptionSlot_C::AnimHack' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, Values) == 0x000320, "Member 'UBP_EditorOptionSlot_C::Values' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, OptionDisplayName) == 0x000330, "Member 'UBP_EditorOptionSlot_C::OptionDisplayName' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, FirstSelectIndex) == 0x000348, "Member 'UBP_EditorOptionSlot_C::FirstSelectIndex' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, IgnoreFocusAnimation) == 0x00034C, "Member 'UBP_EditorOptionSlot_C::IgnoreFocusAnimation' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, bNeedsConfirm) == 0x00034D, "Member 'UBP_EditorOptionSlot_C::bNeedsConfirm' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, bUnsaved) == 0x00034E, "Member 'UBP_EditorOptionSlot_C::bUnsaved' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionSlot_C, OptionId) == 0x000350, "Member 'UBP_EditorOptionSlot_C::OptionId' has a wrong offset!");

}

