#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ErrorPopupWidget

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function BP_ErrorPopupWidget.BP_ErrorPopupWidget_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_ErrorPopupWidget_C_CustomEvent final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ErrorPopupWidget_C_CustomEvent) == 0x000001, "Wrong alignment on BP_ErrorPopupWidget_C_CustomEvent");
static_assert(sizeof(BP_ErrorPopupWidget_C_CustomEvent) == 0x000001, "Wrong size on BP_ErrorPopupWidget_C_CustomEvent");
static_assert(offsetof(BP_ErrorPopupWidget_C_CustomEvent, bNewInputType) == 0x000000, "Member 'BP_ErrorPopupWidget_C_CustomEvent::bNewInputType' has a wrong offset!");

// Function BP_ErrorPopupWidget.BP_ErrorPopupWidget_C.ExecuteUbergraph_BP_ErrorPopupWidget
// 0x0138 (0x0138 - 0x0000)
struct BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiMainMenuWidget*                  CallFunc_GetMainMenu_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_5;                              // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message_1;                      // 0x0070(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0018)()
	TDelegate<void(class FText Message)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetCurrentFocusedWidget_ReturnValue;      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGuiGenericButton*                   K2Node_DynamicCast_AsGym_Gui_Generic_Button;       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget) == 0x000008, "Wrong alignment on BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget");
static_assert(sizeof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget) == 0x000138, "Wrong size on BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, EntryPoint) == 0x000000, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_InputActionEvent_Key) == 0x000008, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_GetMainMenu_ReturnValue) == 0x000028, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_GetMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_IsOpen_ReturnValue) == 0x000038, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_GetCurrentInputType_ReturnValue) == 0x000039, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000040, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000048, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_Conv_IntToByte_ReturnValue) == 0x00004C, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable) == 0x000062, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_1) == 0x000063, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_2) == 0x000064, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_3) == 0x000065, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_4) == 0x000066, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_5) == 0x000067, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_6) == 0x000068, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_7) == 0x000069, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_8) == 0x00006A, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, Temp_byte_Variable_9) == 0x00006B, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_CustomEvent_Message_1) == 0x000070, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_CustomEvent_Message) == 0x000090, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_DynamicCast_AsGym_Player_Controller) == 0x0000A0, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000D8, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_IsOpen_ReturnValue_1) == 0x0000E0, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000E1, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_GetCurrentFocusedWidget_ReturnValue) == 0x0000E8, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_GetCurrentFocusedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F0, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_DynamicCast_AsGym_Gui_Generic_Button) == 0x000100, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_DynamicCast_AsGym_Gui_Generic_Button' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_IsValid_ReturnValue_2) == 0x000109, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_BooleanAND_ReturnValue_1) == 0x00010A, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000110, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000118, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_CustomEvent_bNewInputType) == 0x000120, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000128, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_Select_Default) == 0x000130, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget, K2Node_Select_Default_1) == 0x000131, "Member 'BP_ErrorPopupWidget_C_ExecuteUbergraph_BP_ErrorPopupWidget::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_ErrorPopupWidget.BP_ErrorPopupWidget_C.InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_ErrorPopupWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ErrorPopupWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_ErrorPopupWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_ErrorPopupWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_ErrorPopupWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_ErrorPopupWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_ErrorPopupWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function BP_ErrorPopupWidget.BP_ErrorPopupWidget_C.OnCloudError_Event
// 0x0018 (0x0018 - 0x0000)
struct BP_ErrorPopupWidget_C_OnCloudError_Event final
{
public:
	class FText                                   Message_0;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ErrorPopupWidget_C_OnCloudError_Event) == 0x000008, "Wrong alignment on BP_ErrorPopupWidget_C_OnCloudError_Event");
static_assert(sizeof(BP_ErrorPopupWidget_C_OnCloudError_Event) == 0x000018, "Wrong size on BP_ErrorPopupWidget_C_OnCloudError_Event");
static_assert(offsetof(BP_ErrorPopupWidget_C_OnCloudError_Event, Message_0) == 0x000000, "Member 'BP_ErrorPopupWidget_C_OnCloudError_Event::Message_0' has a wrong offset!");

// Function BP_ErrorPopupWidget.BP_ErrorPopupWidget_C.OnGenericError
// 0x0010 (0x0010 - 0x0000)
struct BP_ErrorPopupWidget_C_OnGenericError final
{
public:
	class FString                                 Message_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ErrorPopupWidget_C_OnGenericError) == 0x000008, "Wrong alignment on BP_ErrorPopupWidget_C_OnGenericError");
static_assert(sizeof(BP_ErrorPopupWidget_C_OnGenericError) == 0x000010, "Wrong size on BP_ErrorPopupWidget_C_OnGenericError");
static_assert(offsetof(BP_ErrorPopupWidget_C_OnGenericError, Message_0) == 0x000000, "Member 'BP_ErrorPopupWidget_C_OnGenericError::Message_0' has a wrong offset!");

}

