#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorOptionSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_EditorOptionSlot.BP_EditorOptionSlot_C.ExecuteUbergraph_BP_EditorOptionSlot
// 0x0158 (0x0158 - 0x0000)
struct BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGymAssetVariantId                     K2Node_MakeStruct_GymAssetVariantId;               // 0x0004(0x0010)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0020(0x0008)(NoDestructor)
	class UBP_EditorOptionItem_C*                 CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0030(0x0008)(NoDestructor)
	EFocusCause                                   CallFunc_GetFocusCause_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorOptionItem_C*                 K2Node_DynamicCast_AsBP_Editor_Option_Item;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorOptionItem_C*                 K2Node_DynamicCast_AsBP_Editor_Option_Item_1;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0090(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEditorGuiOption                       CallFunc_Array_Get_Item;                           // 0x00D8(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EditorOptionItem_C*                 K2Node_DynamicCast_AsBP_Editor_Option_Item_2;      // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot) == 0x000008, "Wrong alignment on BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot");
static_assert(sizeof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot) == 0x000158, "Wrong size on BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, EntryPoint) == 0x000000, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_MakeStruct_GymAssetVariantId) == 0x000004, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_MakeStruct_GymAssetVariantId' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_Event_InFocusEvent_1) == 0x000020, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_Event_InFocusEvent) == 0x000030, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_GetFocusCause_ReturnValue) == 0x000038, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_GetFocusCause_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000039, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000040, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_GetChildAt_ReturnValue) == 0x000060, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_DynamicCast_AsBP_Editor_Option_Item) == 0x000068, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_DynamicCast_AsBP_Editor_Option_Item' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_GetChildAt_ReturnValue_1) == 0x000078, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_DynamicCast_AsBP_Editor_Option_Item_1) == 0x000080, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_DynamicCast_AsBP_Editor_Option_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_GetChildrenCount_ReturnValue) == 0x00008C, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_Event_MyGeometry) == 0x000090, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_Event_InDeltaTime) == 0x0000C8, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_PlayAnimation_ReturnValue) == 0x0000D0, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Less_IntInt_ReturnValue) == 0x00011C, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_GetChildIndex_ReturnValue) == 0x000120, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_GetChildAt_ReturnValue_2) == 0x000128, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Add_IntInt_ReturnValue_1) == 0x000130, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_DynamicCast_AsBP_Editor_Option_Item_2) == 0x000138, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_DynamicCast_AsBP_Editor_Option_Item_2' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Add_IntInt_ReturnValue_2) == 0x000144, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Percent_IntInt_ReturnValue) == 0x000148, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Add_IntInt_ReturnValue_3) == 0x00014C, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000150, "Member 'BP_EditorOptionSlot_C_ExecuteUbergraph_BP_EditorOptionSlot::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_EditorOptionSlot.BP_EditorOptionSlot_C.GetOptionCount
// 0x0008 (0x0008 - 0x0000)
struct BP_EditorOptionSlot_C_GetOptionCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorOptionSlot_C_GetOptionCount) == 0x000004, "Wrong alignment on BP_EditorOptionSlot_C_GetOptionCount");
static_assert(sizeof(BP_EditorOptionSlot_C_GetOptionCount) == 0x000008, "Wrong size on BP_EditorOptionSlot_C_GetOptionCount");
static_assert(offsetof(BP_EditorOptionSlot_C_GetOptionCount, Count) == 0x000000, "Member 'BP_EditorOptionSlot_C_GetOptionCount::Count' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_GetOptionCount, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_EditorOptionSlot_C_GetOptionCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_EditorOptionSlot.BP_EditorOptionSlot_C.GetVisibility_0
// 0x0005 (0x0005 - 0x0000)
struct BP_EditorOptionSlot_C_GetVisibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorOptionSlot_C_GetVisibility_0) == 0x000001, "Wrong alignment on BP_EditorOptionSlot_C_GetVisibility_0");
static_assert(sizeof(BP_EditorOptionSlot_C_GetVisibility_0) == 0x000005, "Wrong size on BP_EditorOptionSlot_C_GetVisibility_0");
static_assert(offsetof(BP_EditorOptionSlot_C_GetVisibility_0, ReturnValue) == 0x000000, "Member 'BP_EditorOptionSlot_C_GetVisibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_GetVisibility_0, Temp_bool_Variable) == 0x000001, "Member 'BP_EditorOptionSlot_C_GetVisibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_GetVisibility_0, Temp_byte_Variable) == 0x000002, "Member 'BP_EditorOptionSlot_C_GetVisibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_GetVisibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'BP_EditorOptionSlot_C_GetVisibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_GetVisibility_0, K2Node_Select_Default) == 0x000004, "Member 'BP_EditorOptionSlot_C_GetVisibility_0::K2Node_Select_Default' has a wrong offset!");

// Function BP_EditorOptionSlot.BP_EditorOptionSlot_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_EditorOptionSlot_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_EditorOptionSlot_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on BP_EditorOptionSlot_C_OnAddedToFocusPath");
static_assert(sizeof(BP_EditorOptionSlot_C_OnAddedToFocusPath) == 0x000008, "Wrong size on BP_EditorOptionSlot_C_OnAddedToFocusPath");
static_assert(offsetof(BP_EditorOptionSlot_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'BP_EditorOptionSlot_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_EditorOptionSlot.BP_EditorOptionSlot_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BP_EditorOptionSlot_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_EditorOptionSlot_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on BP_EditorOptionSlot_C_OnRemovedFromFocusPath");
static_assert(sizeof(BP_EditorOptionSlot_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on BP_EditorOptionSlot_C_OnRemovedFromFocusPath");
static_assert(offsetof(BP_EditorOptionSlot_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'BP_EditorOptionSlot_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function BP_EditorOptionSlot.BP_EditorOptionSlot_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_EditorOptionSlot_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorOptionSlot_C_Tick) == 0x000004, "Wrong alignment on BP_EditorOptionSlot_C_Tick");
static_assert(sizeof(BP_EditorOptionSlot_C_Tick) == 0x00003C, "Wrong size on BP_EditorOptionSlot_C_Tick");
static_assert(offsetof(BP_EditorOptionSlot_C_Tick, MyGeometry) == 0x000000, "Member 'BP_EditorOptionSlot_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_EditorOptionSlot_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_EditorOptionSlot_C_Tick::InDeltaTime' has a wrong offset!");

}

