#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorOptionItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EditorOptionItem.BP_EditorOptionItem_C
// 0x0068 (0x0328 - 0x02C0)
class UBP_EditorOptionItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Color;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PaperTexture;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_37;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FEditorGuiOption                       Option;                                            // 0x02E8(0x0040)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_BP_EditorOptionItem(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditorOptionItem_C">();
	}
	static class UBP_EditorOptionItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EditorOptionItem_C>();
	}
};
static_assert(alignof(UBP_EditorOptionItem_C) == 0x000008, "Wrong alignment on UBP_EditorOptionItem_C");
static_assert(sizeof(UBP_EditorOptionItem_C) == 0x000328, "Wrong size on UBP_EditorOptionItem_C");
static_assert(offsetof(UBP_EditorOptionItem_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_EditorOptionItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionItem_C, Color) == 0x0002C8, "Member 'UBP_EditorOptionItem_C::Color' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionItem_C, PaperTexture) == 0x0002D0, "Member 'UBP_EditorOptionItem_C::PaperTexture' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionItem_C, SizeBox_37) == 0x0002D8, "Member 'UBP_EditorOptionItem_C::SizeBox_37' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionItem_C, Text) == 0x0002E0, "Member 'UBP_EditorOptionItem_C::Text' has a wrong offset!");
static_assert(offsetof(UBP_EditorOptionItem_C, Option) == 0x0002E8, "Member 'UBP_EditorOptionItem_C::Option' has a wrong offset!");

}

