#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorPiece

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EditorPiece.BP_EditorPiece_C.ExecuteUbergraph_BP_EditorPiece
// 0x0004 (0x0004 - 0x0000)
struct BP_EditorPiece_C_ExecuteUbergraph_BP_EditorPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorPiece_C_ExecuteUbergraph_BP_EditorPiece) == 0x000004, "Wrong alignment on BP_EditorPiece_C_ExecuteUbergraph_BP_EditorPiece");
static_assert(sizeof(BP_EditorPiece_C_ExecuteUbergraph_BP_EditorPiece) == 0x000004, "Wrong size on BP_EditorPiece_C_ExecuteUbergraph_BP_EditorPiece");
static_assert(offsetof(BP_EditorPiece_C_ExecuteUbergraph_BP_EditorPiece, EntryPoint) == 0x000000, "Member 'BP_EditorPiece_C_ExecuteUbergraph_BP_EditorPiece::EntryPoint' has a wrong offset!");

// Function BP_EditorPiece.BP_EditorPiece_C.GetOptionCount
// 0x0004 (0x0004 - 0x0000)
struct BP_EditorPiece_C_GetOptionCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorPiece_C_GetOptionCount) == 0x000004, "Wrong alignment on BP_EditorPiece_C_GetOptionCount");
static_assert(sizeof(BP_EditorPiece_C_GetOptionCount) == 0x000004, "Wrong size on BP_EditorPiece_C_GetOptionCount");
static_assert(offsetof(BP_EditorPiece_C_GetOptionCount, Count) == 0x000000, "Member 'BP_EditorPiece_C_GetOptionCount::Count' has a wrong offset!");

}

