#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditorToolsRow

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EditorToolsRow.BP_EditorToolsRow_C.ExecuteUbergraph_BP_EditorToolsRow
// 0x00B0 (0x00B0 - 0x0000)
struct BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymWallStyleToolSetting*               CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorToolSlot_C*                   CallFunc_SpawnObject_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EditorToolSlot_C*                   K2Node_DynamicCast_AsBP_Editor_Tool_Slot;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorToolSlot_C*                   K2Node_DynamicCast_AsBP_Editor_Tool_Slot_1;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGymBoundsToolSetting*                  CallFunc_SpawnObject_ReturnValue_2;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_EditorToolSlot_C*                   CallFunc_SpawnObject_ReturnValue_3;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EditorToolSlot_C*                   K2Node_DynamicCast_AsBP_Editor_Tool_Slot_2;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow) == 0x000008, "Wrong alignment on BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow");
static_assert(sizeof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow) == 0x0000B0, "Wrong size on BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, EntryPoint) == 0x000000, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_SpawnObject_ReturnValue_1) == 0x000010, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_GetChildrenCount_ReturnValue) == 0x000018, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_IsValid_ReturnValue_1) == 0x00001D, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_GetChildIndex_ReturnValue) == 0x000020, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_Percent_IntInt_ReturnValue) == 0x00002C, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_GetChildAt_ReturnValue) == 0x000038, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, K2Node_DynamicCast_AsBP_Editor_Tool_Slot) == 0x000048, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::K2Node_DynamicCast_AsBP_Editor_Tool_Slot' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_GetChildAt_ReturnValue_1) == 0x000058, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, K2Node_DynamicCast_AsBP_Editor_Tool_Slot_1) == 0x000060, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::K2Node_DynamicCast_AsBP_Editor_Tool_Slot_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_SpawnObject_ReturnValue_2) == 0x000078, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_SpawnObject_ReturnValue_3) == 0x000080, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_SpawnObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_AddChild_ReturnValue_1) == 0x000088, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_GetChildAt_ReturnValue_2) == 0x000090, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, K2Node_DynamicCast_AsBP_Editor_Tool_Slot_2) == 0x0000A0, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::K2Node_DynamicCast_AsBP_Editor_Tool_Slot_2' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A9, "Member 'BP_EditorToolsRow_C_ExecuteUbergraph_BP_EditorToolsRow::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

