#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EditLevelNamePopup

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EditLevelNamePopup.BP_EditLevelNamePopup_C
// 0x0068 (0x0328 - 0x02C0)
class UBP_EditLevelNamePopup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_PlaymenuButton_C*                  CancelButton;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            ConfirmButton;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    Header;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       InvalidNameyNotification;                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       NameField;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GymGuiMetaPopupHelper_C*           WBP_GymGuiMetaPopupHelper;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        Widgets;                                           // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FString                                 PreviousText;                                      // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnWantsToClose;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__BP_EditLevelNamePopup_CancelButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_EditLevelNamePopup_ConfirmButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_EditLevelNamePopup_NameField_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__BP_EditLevelNamePopup_NameField_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void ExecuteUbergraph_BP_EditLevelNamePopup(int32 EntryPoint);
	void OnInitialized();
	void OnWantsToClose__DelegateSignature(bool ConfirmClicked);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditLevelNamePopup_C">();
	}
	static class UBP_EditLevelNamePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EditLevelNamePopup_C>();
	}
};
static_assert(alignof(UBP_EditLevelNamePopup_C) == 0x000008, "Wrong alignment on UBP_EditLevelNamePopup_C");
static_assert(sizeof(UBP_EditLevelNamePopup_C) == 0x000328, "Wrong size on UBP_EditLevelNamePopup_C");
static_assert(offsetof(UBP_EditLevelNamePopup_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_EditLevelNamePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, CancelButton) == 0x0002C8, "Member 'UBP_EditLevelNamePopup_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, ConfirmButton) == 0x0002D0, "Member 'UBP_EditLevelNamePopup_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, Header) == 0x0002D8, "Member 'UBP_EditLevelNamePopup_C::Header' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, InvalidNameyNotification) == 0x0002E0, "Member 'UBP_EditLevelNamePopup_C::InvalidNameyNotification' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, NameField) == 0x0002E8, "Member 'UBP_EditLevelNamePopup_C::NameField' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, WBP_GymGuiMetaPopupHelper) == 0x0002F0, "Member 'UBP_EditLevelNamePopup_C::WBP_GymGuiMetaPopupHelper' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, Widgets) == 0x0002F8, "Member 'UBP_EditLevelNamePopup_C::Widgets' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, PreviousText) == 0x000308, "Member 'UBP_EditLevelNamePopup_C::PreviousText' has a wrong offset!");
static_assert(offsetof(UBP_EditLevelNamePopup_C, OnWantsToClose) == 0x000318, "Member 'UBP_EditLevelNamePopup_C::OnWantsToClose' has a wrong offset!");

}

