#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FeaturedServerListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.ExecuteUbergraph_BP_FeaturedServerListWidget
// 0x02B0 (0x02B0 - 0x0000)
struct BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ConnectString;                  // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success, const class FString& PlaylistId)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success, const class FString& ConnectString)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesAnotherWidgetHavePriority_ReturnValue; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x0090(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1; // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3; // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4; // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_5; // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success, const class FString& JoinUrl)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPrevJoinButtonValid_Valid;              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPrevJoinButtonValid_Valid_1;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_3;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_JoinUrl;                        // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_2;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlaylistId_1;                   // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_DisplayName;                    // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0120(0x0018)()
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0138(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0150(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_3;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_4;                  // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_5;                  // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0170(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_1;          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x01B8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_1;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlaylistId;                     // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0210(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0270(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0298(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget");
static_assert(sizeof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget) == 0x0002B0, "Wrong size on BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, EntryPoint) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_Success) == 0x000004, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_ConnectString) == 0x000008, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_ConnectString' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_InVisibility) == 0x000048, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000050, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000058, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_DoesAnotherWidgetHavePriority_ReturnValue) == 0x000060, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_DoesAnotherWidgetHavePriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000074, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GetGameInstance_ReturnValue) == 0x000078, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000080, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_Array_Contains_ReturnValue) == 0x000089, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_InputActionEvent_Key_5) == 0x000090, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_InputActionEvent_Key_5' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsVisible_ReturnValue) == 0x0000A8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000AC, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsVisible_ReturnValue_1) == 0x0000BC, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsVisible_ReturnValue_2) == 0x0000BD, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x0000BE, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1) == 0x0000BF, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2) == 0x0000C0, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue) == 0x0000C1, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue_1) == 0x0000C2, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3) == 0x0000C3, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4) == 0x0000C4, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue_2) == 0x0000C5, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_5) == 0x0000C6, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GamepadUINavigate_ReturnValue) == 0x0000C7, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x0000C8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GamepadUINavigate_ReturnValue_2) == 0x0000C9, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GamepadUINavigate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000CC, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsPrevJoinButtonValid_Valid) == 0x0000DC, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsPrevJoinButtonValid_Valid' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000DD, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue_3) == 0x0000DE, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0000DF, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0000E0, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsPrevJoinButtonValid_Valid_1) == 0x0000E1, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsPrevJoinButtonValid_Valid_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanOR_ReturnValue) == 0x0000E2, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue_4) == 0x0000E3, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_Success_3) == 0x0000E4, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_Success_3' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_JoinUrl) == 0x0000E8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_JoinUrl' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_Success_2) == 0x0000F8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_Success_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_PlaylistId_1) == 0x000100, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_PlaylistId_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_DisplayName) == 0x000110, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_DisplayName' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000120, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_InputActionEvent_Key) == 0x000138, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_InputActionEvent_Key_1) == 0x000150, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000168, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsVisible_ReturnValue_3) == 0x000169, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsVisible_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsVisible_ReturnValue_4) == 0x00016A, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsVisible_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue_5) == 0x00016B, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue_6) == 0x00016C, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_IsVisible_ReturnValue_5) == 0x00016D, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_IsVisible_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_InputActionEvent_Key_2) == 0x000170, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue_7) == 0x000188, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GetGameInstance_ReturnValue_1) == 0x000190, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_BooleanAND_ReturnValue_8) == 0x000198, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_DynamicCast_AsGym_Game_Instance_1) == 0x0001A0, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_DynamicCast_AsGym_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001B0, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_InputActionEvent_Key_3) == 0x0001B8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_Success_1) == 0x0001D0, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_Success_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_CustomEvent_PlaylistId) == 0x0001D8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_CustomEvent_PlaylistId' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_GetPlayerName_ReturnValue) == 0x0001E8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001F8, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000210, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_MakeArray_Array) == 0x000260, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_Format_ReturnValue) == 0x000270, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000288, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget, K2Node_InputActionEvent_Key_4) == 0x000298, "Member 'BP_FeaturedServerListWidget_C_ExecuteUbergraph_BP_FeaturedServerListWidget::K2Node_InputActionEvent_Key_4' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.Get_ContainerCreateNew_Visibility
// 0x0001 (0x0001 - 0x0000)
struct BP_FeaturedServerListWidget_C_Get_ContainerCreateNew_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_Get_ContainerCreateNew_Visibility) == 0x000001, "Wrong alignment on BP_FeaturedServerListWidget_C_Get_ContainerCreateNew_Visibility");
static_assert(sizeof(BP_FeaturedServerListWidget_C_Get_ContainerCreateNew_Visibility) == 0x000001, "Wrong size on BP_FeaturedServerListWidget_C_Get_ContainerCreateNew_Visibility");
static_assert(offsetof(BP_FeaturedServerListWidget_C_Get_ContainerCreateNew_Visibility, ReturnValue) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_Get_ContainerCreateNew_Visibility::ReturnValue' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_5
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_5) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_5");
static_assert(sizeof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_5) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_5");
static_assert(offsetof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_5, Key) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_5::Key' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3");
static_assert(sizeof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3");
static_assert(offsetof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3, Key) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3::Key' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1");
static_assert(sizeof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1");
static_assert(offsetof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2");
static_assert(sizeof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2");
static_assert(offsetof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2, Key) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2::Key' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4");
static_assert(sizeof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4");
static_assert(offsetof(BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4, Key) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4::Key' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.IsPrevJoinButtonValid
// 0x0005 (0x0005 - 0x0000)
struct BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid) == 0x000001, "Wrong alignment on BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid");
static_assert(sizeof(BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid) == 0x000005, "Wrong size on BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid");
static_assert(offsetof(BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid, Valid) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid::Valid' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid, CallFunc_Array_IsEmpty_ReturnValue) == 0x000002, "Member 'BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid, CallFunc_Array_Contains_ReturnValue) == 0x000003, "Member 'BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'BP_FeaturedServerListWidget_C_IsPrevJoinButtonValid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.OnCreateGymServer
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_OnCreateGymServer final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ConnectString;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_OnCreateGymServer) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_OnCreateGymServer");
static_assert(sizeof(BP_FeaturedServerListWidget_C_OnCreateGymServer) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_OnCreateGymServer");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnCreateGymServer, Success) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_OnCreateGymServer::Success' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnCreateGymServer, ConnectString) == 0x000008, "Member 'BP_FeaturedServerListWidget_C_OnCreateGymServer::ConnectString' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.OnFeaturedVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_FeaturedServerListWidget_C_OnFeaturedVisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_OnFeaturedVisibilityChanged) == 0x000001, "Wrong alignment on BP_FeaturedServerListWidget_C_OnFeaturedVisibilityChanged");
static_assert(sizeof(BP_FeaturedServerListWidget_C_OnFeaturedVisibilityChanged) == 0x000001, "Wrong size on BP_FeaturedServerListWidget_C_OnFeaturedVisibilityChanged");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnFeaturedVisibilityChanged, InVisibility) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_OnFeaturedVisibilityChanged::InVisibility' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.OnJoinServerRequestComplete_Event
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JoinUrl;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event");
static_assert(sizeof(BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event, Success) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event::Success' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event, JoinUrl) == 0x000008, "Member 'BP_FeaturedServerListWidget_C_OnJoinServerRequestComplete_Event::JoinUrl' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.OnPreviewMouseButtonDown
// 0x02E0 (0x02E0 - 0x0000)
struct BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0220(0x00B8)()
	bool                                          CallFunc_FakeClickHighlightedTextFieldGamepad_ReturnValue; // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown");
static_assert(sizeof(BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown) == 0x0002E0, "Wrong size on BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000220, "Member 'BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown, CallFunc_FakeClickHighlightedTextFieldGamepad_ReturnValue) == 0x0002D8, "Member 'BP_FeaturedServerListWidget_C_OnPreviewMouseButtonDown::CallFunc_FakeClickHighlightedTextFieldGamepad_ReturnValue' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.OnRandomPlaylistReceived_Event
// 0x0018 (0x0018 - 0x0000)
struct BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlaylistId;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event");
static_assert(sizeof(BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event) == 0x000018, "Wrong size on BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event, Success) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event::Success' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event, PlaylistId) == 0x000008, "Member 'BP_FeaturedServerListWidget_C_OnRandomPlaylistReceived_Event::PlaylistId' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.OnServerListUpdated
// 0x0001 (0x0001 - 0x0000)
struct BP_FeaturedServerListWidget_C_OnServerListUpdated final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_OnServerListUpdated) == 0x000001, "Wrong alignment on BP_FeaturedServerListWidget_C_OnServerListUpdated");
static_assert(sizeof(BP_FeaturedServerListWidget_C_OnServerListUpdated) == 0x000001, "Wrong size on BP_FeaturedServerListWidget_C_OnServerListUpdated");
static_assert(offsetof(BP_FeaturedServerListWidget_C_OnServerListUpdated, Success) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_OnServerListUpdated::Success' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.Show
// 0x0020 (0x0020 - 0x0000)
struct BP_FeaturedServerListWidget_C_Show final
{
public:
	class FString                                 PlaylistId;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DisplayName;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedServerListWidget_C_Show) == 0x000008, "Wrong alignment on BP_FeaturedServerListWidget_C_Show");
static_assert(sizeof(BP_FeaturedServerListWidget_C_Show) == 0x000020, "Wrong size on BP_FeaturedServerListWidget_C_Show");
static_assert(offsetof(BP_FeaturedServerListWidget_C_Show, PlaylistId) == 0x000000, "Member 'BP_FeaturedServerListWidget_C_Show::PlaylistId' has a wrong offset!");
static_assert(offsetof(BP_FeaturedServerListWidget_C_Show, DisplayName) == 0x000010, "Member 'BP_FeaturedServerListWidget_C_Show::DisplayName' has a wrong offset!");

// Function BP_FeaturedServerListWidget.BP_FeaturedServerListWidget_C.UpdateHighlightableWidgets
// 0x0038 (0x0038 - 0x0000)
struct BP_FeaturedServerListWidget_C_UpdateHighlightableWidgets final
{
public:
