#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExplorePlaylistLevelDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymExplorePlaylistLevelDetails.BP_GymExplorePlaylistLevelDetails_C
// 0x0038 (0x02F8 - 0x02C0)
class UBP_GymExplorePlaylistLevelDetails_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 MapIconBlock;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MapNameBlock;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 MapName;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 RuleId;                                            // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails(int32 EntryPoint);
	void GetIconFromGamemode(const class FString& GameMode, class UTexture2D** GameModeIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymExplorePlaylistLevelDetails_C">();
	}
	static class UBP_GymExplorePlaylistLevelDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymExplorePlaylistLevelDetails_C>();
	}
};
static_assert(alignof(UBP_GymExplorePlaylistLevelDetails_C) == 0x000008, "Wrong alignment on UBP_GymExplorePlaylistLevelDetails_C");
static_assert(sizeof(UBP_GymExplorePlaylistLevelDetails_C) == 0x0002F8, "Wrong size on UBP_GymExplorePlaylistLevelDetails_C");
static_assert(offsetof(UBP_GymExplorePlaylistLevelDetails_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_GymExplorePlaylistLevelDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistLevelDetails_C, MapIconBlock) == 0x0002C8, "Member 'UBP_GymExplorePlaylistLevelDetails_C::MapIconBlock' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistLevelDetails_C, MapNameBlock) == 0x0002D0, "Member 'UBP_GymExplorePlaylistLevelDetails_C::MapNameBlock' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistLevelDetails_C, MapName) == 0x0002D8, "Member 'UBP_GymExplorePlaylistLevelDetails_C::MapName' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistLevelDetails_C, RuleId) == 0x0002E8, "Member 'UBP_GymExplorePlaylistLevelDetails_C::RuleId' has a wrong offset!");

}

