#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExploreLevelSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"
#include "WBP_GymGuiMetaPopupHelper_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymExploreLevelSettings.BP_GymExploreLevelSettings_C
// 0x0278 (0x05D8 - 0x0360)
class UBP_GymExploreLevelSettings_C final : public UWBP_GymGuiMetaPopupHelper_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GymExploreLevelSettings_C;       // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_PlaymenuButton_Red_C*              BackButton;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_EditLevelNamePopup_C*               BP_EditLevelNamePopup;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       CreatorTime_Button;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CreatorTime_Text;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CreatorTime_Time_Text;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CreatorTime_TimeSwitcher;                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_C*                       Heading_LevelSettings;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        IconSwitcher_Creatortimer;                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        IconSwitcher_Levelname;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        IconSwitcher_MapSaved;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        IconSwitcher_Thumbnail;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_88;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ImageSwitcher;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  LevelName_Button;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelName_Text;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MapSaved_HBox;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MapSaved_Text;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MapSaved_VBox;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        NoThumbnailTextSwitcher;                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Publish_Text;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_ArrowRight_C*               PublishButton;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PublishButtonSwitcher;                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       SaveLevelButton;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       TakeThumbnailButton;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Thumbnail_Loading_Indicator;                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Thumbnail_Text;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThumbnailLevel;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_ArrowLeft_C*                UnpublishButton;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLevelSettingsClosed;                             // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPlayClicked;                                     // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnTakeThumbnailClicked;                            // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGymMapDetailsResult                   MapDetails;                                        // 0x0478(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LockPublishing;                                    // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnMapPublishChanged;                               // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMapNameChanged;                                  // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShouldHaveThumbnail;                               // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RequireMapSave;                                    // 0x0569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VerifyLocalFinishTime;                             // 0x056A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B[0x5];                                      // 0x056B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymLeaderboard                        MapLeaderboard;                                    // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DontLoadThumbnail;                                 // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSaveLevelClicked;                                // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGymLeaderboardRow                     FoundCreatorTime;                                  // 0x0598(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        EditTimestampTemp;                                 // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasRulesClass;                                     // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviousRuleId;                                    // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          UseGameGameRuleId;                                 // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_GymExploreLevelSettings_BackButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreLevelSettings_CreatorTime_Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreLevelSettings_CreatorTime_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreLevelSettings_LevelName_Button_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreLevelSettings_PublishButton_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreLevelSettings_Published_Button_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreLevelSettings_SaveLevelButton_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreLevelSettings_Unpublished_Button_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BPOpen();
	void CloseSettings();
	void Construct();
	void ExecuteUbergraph_BP_GymExploreLevelSettings(int32 EntryPoint);
	void InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5(const struct FKey& Key);
	void OnFail_D09F3421478CD39F92D3BA9778F873B8(const class FString& URL, class UTexture2DDynamic* Texture);
	void OnInitialized();
	void OnLevelNameInputFinished(bool ConfirmClicked);
	void OnLevelSettingsClosed__DelegateSignature();
	void OnMapNameChanged__DelegateSignature(const class FText& NewName);
	void OnMapPublishChanged__DelegateSignature(bool IsPublished);
	void OnMapPublished(bool Success);
	void OnMapRenamed(bool Success);
	void OnMapSaved();
	void OnMapUnpublished(bool Success);
	void OnPlayClicked__DelegateSignature();
	void OnSaveLevelClicked__DelegateSignature();
	void OnSuccess_D09F3421478CD39F92D3BA9778F873B8(const class FString& URL, class UTexture2DDynamic* Texture);
	void OnTakeThumbnailClicked__DelegateSignature();
	void OnThumbnailUploaded(const class FString& LocalFilePath);
	void Update_Finish_Requirement_DEPRECATED();
	void UpdateDetails(const struct FGymMapDetailsResult& Details);
	void UpdateFinishRequirements();
	void UpdateHighlightableWidgets();
	void UpdateIsPublishable();
	void UpdateLeaderboardData(const struct FGymLeaderboard& Leaderboard);
	void UpdateMapSaveRequirement();
	void UpdateThumbnail();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymExploreLevelSettings_C">();
	}
	static class UBP_GymExploreLevelSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymExploreLevelSettings_C>();
	}
};
static_assert(alignof(UBP_GymExploreLevelSettings_C) == 0x000008, "Wrong alignment on UBP_GymExploreLevelSettings_C");
static_assert(sizeof(UBP_GymExploreLevelSettings_C) == 0x0005D8, "Wrong size on UBP_GymExploreLevelSettings_C");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, UberGraphFrame_BP_GymExploreLevelSettings_C) == 0x000360, "Member 'UBP_GymExploreLevelSettings_C::UberGraphFrame_BP_GymExploreLevelSettings_C' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, BackButton) == 0x000368, "Member 'UBP_GymExploreLevelSettings_C::BackButton' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, BP_EditLevelNamePopup) == 0x000370, "Member 'UBP_GymExploreLevelSettings_C::BP_EditLevelNamePopup' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, CreatorTime_Button) == 0x000378, "Member 'UBP_GymExploreLevelSettings_C::CreatorTime_Button' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, CreatorTime_Text) == 0x000380, "Member 'UBP_GymExploreLevelSettings_C::CreatorTime_Text' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, CreatorTime_Time_Text) == 0x000388, "Member 'UBP_GymExploreLevelSettings_C::CreatorTime_Time_Text' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, CreatorTime_TimeSwitcher) == 0x000390, "Member 'UBP_GymExploreLevelSettings_C::CreatorTime_TimeSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, Heading_LevelSettings) == 0x000398, "Member 'UBP_GymExploreLevelSettings_C::Heading_LevelSettings' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, IconSwitcher_Creatortimer) == 0x0003A0, "Member 'UBP_GymExploreLevelSettings_C::IconSwitcher_Creatortimer' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, IconSwitcher_Levelname) == 0x0003A8, "Member 'UBP_GymExploreLevelSettings_C::IconSwitcher_Levelname' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, IconSwitcher_MapSaved) == 0x0003B0, "Member 'UBP_GymExploreLevelSettings_C::IconSwitcher_MapSaved' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, IconSwitcher_Thumbnail) == 0x0003B8, "Member 'UBP_GymExploreLevelSettings_C::IconSwitcher_Thumbnail' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, Image_88) == 0x0003C0, "Member 'UBP_GymExploreLevelSettings_C::Image_88' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, ImageSwitcher) == 0x0003C8, "Member 'UBP_GymExploreLevelSettings_C::ImageSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, LevelName_Button) == 0x0003D0, "Member 'UBP_GymExploreLevelSettings_C::LevelName_Button' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, LevelName_Text) == 0x0003D8, "Member 'UBP_GymExploreLevelSettings_C::LevelName_Text' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, MapSaved_HBox) == 0x0003E0, "Member 'UBP_GymExploreLevelSettings_C::MapSaved_HBox' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, MapSaved_Text) == 0x0003E8, "Member 'UBP_GymExploreLevelSettings_C::MapSaved_Text' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, MapSaved_VBox) == 0x0003F0, "Member 'UBP_GymExploreLevelSettings_C::MapSaved_VBox' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, NoThumbnailTextSwitcher) == 0x0003F8, "Member 'UBP_GymExploreLevelSettings_C::NoThumbnailTextSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, Publish_Text) == 0x000400, "Member 'UBP_GymExploreLevelSettings_C::Publish_Text' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, PublishButton) == 0x000408, "Member 'UBP_GymExploreLevelSettings_C::PublishButton' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, PublishButtonSwitcher) == 0x000410, "Member 'UBP_GymExploreLevelSettings_C::PublishButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, SaveLevelButton) == 0x000418, "Member 'UBP_GymExploreLevelSettings_C::SaveLevelButton' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, TakeThumbnailButton) == 0x000420, "Member 'UBP_GymExploreLevelSettings_C::TakeThumbnailButton' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, Thumbnail_Loading_Indicator) == 0x000428, "Member 'UBP_GymExploreLevelSettings_C::Thumbnail_Loading_Indicator' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, Thumbnail_Text) == 0x000430, "Member 'UBP_GymExploreLevelSettings_C::Thumbnail_Text' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, ThumbnailLevel) == 0x000438, "Member 'UBP_GymExploreLevelSettings_C::ThumbnailLevel' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, UnpublishButton) == 0x000440, "Member 'UBP_GymExploreLevelSettings_C::UnpublishButton' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, OnLevelSettingsClosed) == 0x000448, "Member 'UBP_GymExploreLevelSettings_C::OnLevelSettingsClosed' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, OnPlayClicked) == 0x000458, "Member 'UBP_GymExploreLevelSettings_C::OnPlayClicked' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, OnTakeThumbnailClicked) == 0x000468, "Member 'UBP_GymExploreLevelSettings_C::OnTakeThumbnailClicked' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, MapDetails) == 0x000478, "Member 'UBP_GymExploreLevelSettings_C::MapDetails' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, LockPublishing) == 0x000540, "Member 'UBP_GymExploreLevelSettings_C::LockPublishing' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, OnMapPublishChanged) == 0x000548, "Member 'UBP_GymExploreLevelSettings_C::OnMapPublishChanged' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, OnMapNameChanged) == 0x000558, "Member 'UBP_GymExploreLevelSettings_C::OnMapNameChanged' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, ShouldHaveThumbnail) == 0x000568, "Member 'UBP_GymExploreLevelSettings_C::ShouldHaveThumbnail' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, RequireMapSave) == 0x000569, "Member 'UBP_GymExploreLevelSettings_C::RequireMapSave' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, VerifyLocalFinishTime) == 0x00056A, "Member 'UBP_GymExploreLevelSettings_C::VerifyLocalFinishTime' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, MapLeaderboard) == 0x000570, "Member 'UBP_GymExploreLevelSettings_C::MapLeaderboard' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, DontLoadThumbnail) == 0x000580, "Member 'UBP_GymExploreLevelSettings_C::DontLoadThumbnail' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, OnSaveLevelClicked) == 0x000588, "Member 'UBP_GymExploreLevelSettings_C::OnSaveLevelClicked' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, FoundCreatorTime) == 0x000598, "Member 'UBP_GymExploreLevelSettings_C::FoundCreatorTime' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, EditTimestampTemp) == 0x0005B0, "Member 'UBP_GymExploreLevelSettings_C::EditTimestampTemp' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, HasRulesClass) == 0x0005B8, "Member 'UBP_GymExploreLevelSettings_C::HasRulesClass' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, PreviousRuleId) == 0x0005C0, "Member 'UBP_GymExploreLevelSettings_C::PreviousRuleId' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreLevelSettings_C, UseGameGameRuleId) == 0x0005D0, "Member 'UBP_GymExploreLevelSettings_C::UseGameGameRuleId' has a wrong offset!");

}

