#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExploreMapElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymExploreMapElement.BP_GymExploreMapElement_C
// 0x00C8 (0x0388 - 0x02C0)
class UBP_GymExploreMapElement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ExploreLevelButtonPress;                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ExploreLevelButtonHover;                           // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CreatorName;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gamemode_icon;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverLines;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MapName;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TextBorder;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RemixOriginalCreatorTagMinusSmall_C* WBP_RemixOriginalCreatorTagMinusSmall;             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymMapSearchResult                    MapMeta;                                           // 0x0320(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UBP_GymExploreMenu_C*                   ExploreMenu;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__BP_GymExploreMapElement_Button_157_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreMapElement_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_GymExploreMapElement_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_GymExploreMapElement_Button_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreMapElement_Button_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_GymExploreMapElement(int32 EntryPoint);
	void OnFail_715F5E9D480203D74CA683B63624AACD(const class FString& URL, class UTexture2DDynamic* Texture);
	void OnSuccess_715F5E9D480203D74CA683B63624AACD(const class FString& URL, class UTexture2DDynamic* Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymExploreMapElement_C">();
	}
	static class UBP_GymExploreMapElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymExploreMapElement_C>();
	}
};
static_assert(alignof(UBP_GymExploreMapElement_C) == 0x000008, "Wrong alignment on UBP_GymExploreMapElement_C");
static_assert(sizeof(UBP_GymExploreMapElement_C) == 0x000388, "Wrong size on UBP_GymExploreMapElement_C");
static_assert(offsetof(UBP_GymExploreMapElement_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_GymExploreMapElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, ExploreLevelButtonPress) == 0x0002C8, "Member 'UBP_GymExploreMapElement_C::ExploreLevelButtonPress' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, ExploreLevelButtonHover) == 0x0002D0, "Member 'UBP_GymExploreMapElement_C::ExploreLevelButtonHover' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, Button) == 0x0002D8, "Member 'UBP_GymExploreMapElement_C::Button' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, CreatorName) == 0x0002E0, "Member 'UBP_GymExploreMapElement_C::CreatorName' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, Gamemode_icon) == 0x0002E8, "Member 'UBP_GymExploreMapElement_C::Gamemode_icon' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, Hover) == 0x0002F0, "Member 'UBP_GymExploreMapElement_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, HoverLines) == 0x0002F8, "Member 'UBP_GymExploreMapElement_C::HoverLines' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, MapName) == 0x000300, "Member 'UBP_GymExploreMapElement_C::MapName' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, TextBorder) == 0x000308, "Member 'UBP_GymExploreMapElement_C::TextBorder' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, Thumbnail) == 0x000310, "Member 'UBP_GymExploreMapElement_C::Thumbnail' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, WBP_RemixOriginalCreatorTagMinusSmall) == 0x000318, "Member 'UBP_GymExploreMapElement_C::WBP_RemixOriginalCreatorTagMinusSmall' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, MapMeta) == 0x000320, "Member 'UBP_GymExploreMapElement_C::MapMeta' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMapElement_C, ExploreMenu) == 0x000380, "Member 'UBP_GymExploreMapElement_C::ExploreMenu' has a wrong offset!");

}

