#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymBaseGameMode

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GymBaseGameMode.BP_GymBaseGameMode_C
// 0x0020 (0x0410 - 0x03F0)
class ABP_GymBaseGameMode_C final : public AGymBaseGameMode
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 GymMasterServerUrl;                                // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          OneshotKillReady;                                  // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ServerInitRun;                                     // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void IsHub(bool* Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymBaseGameMode_C">();
	}
	static class ABP_GymBaseGameMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GymBaseGameMode_C>();
	}
};
static_assert(alignof(ABP_GymBaseGameMode_C) == 0x000008, "Wrong alignment on ABP_GymBaseGameMode_C");
static_assert(sizeof(ABP_GymBaseGameMode_C) == 0x000410, "Wrong size on ABP_GymBaseGameMode_C");
static_assert(offsetof(ABP_GymBaseGameMode_C, DefaultSceneRoot) == 0x0003F0, "Member 'ABP_GymBaseGameMode_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GymBaseGameMode_C, GymMasterServerUrl) == 0x0003F8, "Member 'ABP_GymBaseGameMode_C::GymMasterServerUrl' has a wrong offset!");
static_assert(offsetof(ABP_GymBaseGameMode_C, OneshotKillReady) == 0x000408, "Member 'ABP_GymBaseGameMode_C::OneshotKillReady' has a wrong offset!");
static_assert(offsetof(ABP_GymBaseGameMode_C, ServerInitRun) == 0x000409, "Member 'ABP_GymBaseGameMode_C::ServerInitRun' has a wrong offset!");

}

