#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExploreSidebar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymExploreSidebar.BP_GymExploreSidebar_C
// 0x00A8 (0x03B0 - 0x0308)
class UBP_GymExploreSidebar_C final : public UGymGuiGenericTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ExploreSidebarButton_C*            Alllevels;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            AllPlaylists;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            BombTag;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            Career;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            Circuit;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            Featured;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            Loot;                                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            MyLevels;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            MyPlaylists;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            ObstacleCourse;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            Remix;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            Sprint;                                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExploreSidebarButton_C*            Tide;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnTabSelected;                                     // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_GymExploreMenu_C*                   ExploreMenu;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        SidebarWidgets;                                    // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnTabButtonClicked;                                // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__BP_GymExploreSidebar_AllLevels_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_AllPlaylists_K2Node_ComponentBoundEvent_2_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_BombTag_K2Node_ComponentBoundEvent_4_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_Career_K2Node_ComponentBoundEvent_8_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_Circuit_K2Node_ComponentBoundEvent_11_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_Featured_K2Node_ComponentBoundEvent_10_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_Loot_K2Node_ComponentBoundEvent_7_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_MyLevels_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_MyPlaylists_K2Node_ComponentBoundEvent_6_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_ObstacleCourse_K2Node_ComponentBoundEvent_8_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_Sprint_K2Node_ComponentBoundEvent_5_On_Clicked__DelegateSignature();
	void BndEvt__BP_GymExploreSidebar_Tide_K2Node_ComponentBoundEvent_3_On_Clicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_GymExploreSidebar(int32 EntryPoint);
	ESlateVisibility Get_Career_Visibility();
	void OnTabButtonClicked__DelegateSignature(class UWBP_ExploreSidebarButton_C* ClickedButton);
	void OnTabSelected__DelegateSignature(const class FString& Category);
	void RegisterExplreMenu(class UBP_GymExploreMenu_C* ExploreMenu_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymExploreSidebar_C">();
	}
	static class UBP_GymExploreSidebar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymExploreSidebar_C>();
	}
};
static_assert(alignof(UBP_GymExploreSidebar_C) == 0x000008, "Wrong alignment on UBP_GymExploreSidebar_C");
static_assert(sizeof(UBP_GymExploreSidebar_C) == 0x0003B0, "Wrong size on UBP_GymExploreSidebar_C");
static_assert(offsetof(UBP_GymExploreSidebar_C, UberGraphFrame) == 0x000308, "Member 'UBP_GymExploreSidebar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, Alllevels) == 0x000310, "Member 'UBP_GymExploreSidebar_C::Alllevels' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, AllPlaylists) == 0x000318, "Member 'UBP_GymExploreSidebar_C::AllPlaylists' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, BombTag) == 0x000320, "Member 'UBP_GymExploreSidebar_C::BombTag' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, Career) == 0x000328, "Member 'UBP_GymExploreSidebar_C::Career' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, Circuit) == 0x000330, "Member 'UBP_GymExploreSidebar_C::Circuit' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, Featured) == 0x000338, "Member 'UBP_GymExploreSidebar_C::Featured' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, Loot) == 0x000340, "Member 'UBP_GymExploreSidebar_C::Loot' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, MyLevels) == 0x000348, "Member 'UBP_GymExploreSidebar_C::MyLevels' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, MyPlaylists) == 0x000350, "Member 'UBP_GymExploreSidebar_C::MyPlaylists' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, ObstacleCourse) == 0x000358, "Member 'UBP_GymExploreSidebar_C::ObstacleCourse' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, Remix) == 0x000360, "Member 'UBP_GymExploreSidebar_C::Remix' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, Sprint) == 0x000368, "Member 'UBP_GymExploreSidebar_C::Sprint' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, Tide) == 0x000370, "Member 'UBP_GymExploreSidebar_C::Tide' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, OnTabSelected) == 0x000378, "Member 'UBP_GymExploreSidebar_C::OnTabSelected' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, ExploreMenu) == 0x000388, "Member 'UBP_GymExploreSidebar_C::ExploreMenu' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, SidebarWidgets) == 0x000390, "Member 'UBP_GymExploreSidebar_C::SidebarWidgets' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreSidebar_C, OnTabButtonClicked) == 0x0003A0, "Member 'UBP_GymExploreSidebar_C::OnTabButtonClicked' has a wrong offset!");

}

