#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymGameInstance

#include "Basic.hpp"

#include "LoadingScreenTip_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_GymGameInstance.BP_GymGameInstance_C.ExecuteUbergraph_BP_GymGameInstance
// 0x0068 (0x0068 - 0x0000)
struct BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymMapUtils*                           CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGymLoadingScreenOptions               K2Node_MakeStruct_GymLoadingScreenOptions;         // 0x0010(0x0058)()
};
static_assert(alignof(BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance) == 0x000008, "Wrong alignment on BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance");
static_assert(sizeof(BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance) == 0x000068, "Wrong size on BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance");
static_assert(offsetof(BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance, EntryPoint) == 0x000000, "Member 'BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance, K2Node_MakeStruct_GymLoadingScreenOptions) == 0x000010, "Member 'BP_GymGameInstance_C_ExecuteUbergraph_BP_GymGameInstance::K2Node_MakeStruct_GymLoadingScreenOptions' has a wrong offset!");

// Function BP_GymGameInstance.BP_GymGameInstance_C.GetNewLoadingScreenTip
// 0x00A0 (0x00A0 - 0x0000)
struct BP_GymGameInstance_C_GetNewLoadingScreenTip final
{
public:
	TArray<class FName>                           PossibleTips;                                      // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadingScreenTip                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymGameInstance_C_GetNewLoadingScreenTip) == 0x000008, "Wrong alignment on BP_GymGameInstance_C_GetNewLoadingScreenTip");
static_assert(sizeof(BP_GymGameInstance_C_GetNewLoadingScreenTip) == 0x0000A0, "Wrong size on BP_GymGameInstance_C_GetNewLoadingScreenTip");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, PossibleTips) == 0x000000, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::PossibleTips' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Array_Random_OutItem) == 0x00001C, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Array_Random_OutIndex) == 0x000024, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000028, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Array_Get_Item) == 0x00003C, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000090, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Array_AddUnique_ReturnValue) == 0x000094, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Array_Contains_ReturnValue) == 0x000098, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_Array_Contains_ReturnValue_1) == 0x000099, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_BooleanOR_ReturnValue) == 0x00009A, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_BooleanOR_ReturnValue_1) == 0x00009B, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGameInstance_C_GetNewLoadingScreenTip, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'BP_GymGameInstance_C_GetNewLoadingScreenTip::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

