#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExploreLevelSettings

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_GymExploreLevelSettings.BP_GymExploreLevelSettings_C.ExecuteUbergraph_BP_GymExploreLevelSettings
// 0x0438 (0x0438 - 0x0000)
struct BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_3;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1; // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2; // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3; // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_5; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_2;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_1;                      // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ConfirmClicked;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0058(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0078(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x00B8(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x00D8(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_2;       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool ConfirmClicked)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncTaskFetchImage*                   CallFunc_FetchImage_ReturnValue;                   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      CallFunc_GetCachedImage_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      Temp_object_Variable;                              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_3;       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_LocalFilePath;                  // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_ImportFileAsTexture2D_ReturnValue;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_3;                    // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_3;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_URL;                            // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture;                        // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& URL, class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_3;                         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_URL_1;                          // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture_1;                      // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0260(0x0018)(HasGetValueTypeHash)
	TDelegate<void(const class FString& URL, class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0288(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x02A0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x02B8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x02D0(0x0018)(HasGetValueTypeHash)
	struct FGymLeaderboardRow                     CallFunc_Array_Get_Item_4;                         // 0x02E8(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue_4;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FormatTime_ReturnValue;                   // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_5;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0328(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x0348(0x0018)(HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymGameState*                          K2Node_DynamicCast_AsGym_Game_State;               // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LastEditTimestamp_ReturnValue;            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x03A8(0x0018)()
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x03CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiMainMenuWidget*                  CallFunc_GetMainMenu_ReturnValue;                  // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E3[0x1];                                      // 0x03E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_1;            // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_6;                    // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0403(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x040B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings) == 0x000008, "Wrong alignment on BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings");
static_assert(sizeof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings) == 0x000438, "Wrong size on BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, EntryPoint) == 0x000000, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x000028, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GamepadUINavigate_ReturnValue) == 0x000029, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x00002A, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GamepadUINavigate_ReturnValue_2) == 0x00002B, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GamepadUINavigate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GamepadUINavigate_ReturnValue_3) == 0x00002C, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GamepadUINavigate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1) == 0x00002D, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2) == 0x00002E, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3) == 0x00002F, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4) == 0x000030, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_5) == 0x000031, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Not_PreBool_ReturnValue_1) == 0x000032, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CustomEvent_Success_2) == 0x000033, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CustomEvent_Success_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsEmpty_ReturnValue) == 0x000034, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Not_PreBool_ReturnValue_2) == 0x000035, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_SelectInt_ReturnValue) == 0x000038, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CustomEvent_Success_1) == 0x00003D, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CustomEvent_Success_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_SelectInt_ReturnValue_1) == 0x000040, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, Temp_bool_Variable) == 0x000044, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CustomEvent_ConfirmClicked) == 0x000050, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CustomEvent_ConfirmClicked' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetText_ReturnValue) == 0x000058, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, Temp_bool_Variable_1) == 0x000070, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetText_ReturnValue_1) == 0x000078, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Conv_TextToString_ReturnValue) == 0x000090, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_TextIsEmpty_ReturnValue) == 0x0000A0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_NotEqual_TextText_ReturnValue) == 0x0000A1, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A2, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsVisible_ReturnValue) == 0x0000B0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetText_ReturnValue_2) == 0x0000B8, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, Temp_bool_Variable_2) == 0x0000D0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CustomEvent_Success) == 0x0000D1, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetText_ReturnValue_3) == 0x0000D8, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0000F0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_SelectInt_ReturnValue_2) == 0x0000F4, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0000F8, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x0000FC, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000100, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000101, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanAND_ReturnValue_2) == 0x000102, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetActiveWidgetIndex_ReturnValue_2) == 0x000104, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetActiveWidgetIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000108, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanAND_ReturnValue_3) == 0x000109, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanAND_ReturnValue_4) == 0x00010A, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, Temp_int_Array_Index_Variable_1) == 0x00010C, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000110, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_FetchImage_ReturnValue) == 0x000120, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_FetchImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsEmpty_ReturnValue_1) == 0x000128, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsEmpty_ReturnValue_2) == 0x000129, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Not_PreBool_ReturnValue_3) == 0x00012A, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetCachedImage_ReturnValue) == 0x000130, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetCachedImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsValid_ReturnValue_1) == 0x000139, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, Temp_string_Variable) == 0x000140, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000150, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CreateDelegate_OutputDelegate_2) == 0x000154, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanOR_ReturnValue) == 0x000164, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_SelectInt_ReturnValue_3) == 0x000168, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Not_PreBool_ReturnValue_4) == 0x00016C, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, Temp_object_Variable) == 0x000170, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetActiveWidgetIndex_ReturnValue_3) == 0x000178, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetActiveWidgetIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00017C, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanAND_ReturnValue_5) == 0x00017D, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CustomEvent_LocalFilePath) == 0x000180, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CustomEvent_LocalFilePath' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanOR_ReturnValue_1) == 0x000190, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_ImportFileAsTexture2D_ReturnValue) == 0x000198, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_ImportFileAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_BooleanAND_ReturnValue_6) == 0x0001A0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsValid_ReturnValue_2) == 0x0001A1, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_IsEmpty_ReturnValue_3) == 0x0001A2, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_IsEmpty_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Not_PreBool_ReturnValue_5) == 0x0001A3, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001A8, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001B0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CustomEvent_URL) == 0x0001C0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CustomEvent_URL' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CustomEvent_Texture) == 0x0001D0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, CallFunc_Array_Get_Item_2) == 0x0001D8, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001E0, "Member 'BP_GymExploreLevelSettings_C_ExecuteUbergraph_BP_GymExploreLevelSettings::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
