#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExplorePlaylistElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymExplorePlaylistElement.BP_GymExplorePlaylistElement_C
// 0x00A0 (0x0360 - 0x02C0)
class UBP_GymExplorePlaylistElement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ExploreLevelButtonPress;                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ExploreLevelButtonHover;                           // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CreatorName;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverLines;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_167;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaylistName;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TextBorder;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymPlaylistSearchResult               PlaylistMeta;                                      // 0x0320(0x0038)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UBP_GymExploreMenu_C*                   ExploreMenu;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__BP_GymExploreMapElement_Button_157_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreMapElement_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_GymExploreMapElement_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_GymExploreMapElement_Button_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__BP_GymExploreMapElement_Button_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_GymExplorePlaylistElement(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymExplorePlaylistElement_C">();
	}
	static class UBP_GymExplorePlaylistElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymExplorePlaylistElement_C>();
	}
};
static_assert(alignof(UBP_GymExplorePlaylistElement_C) == 0x000008, "Wrong alignment on UBP_GymExplorePlaylistElement_C");
static_assert(sizeof(UBP_GymExplorePlaylistElement_C) == 0x000360, "Wrong size on UBP_GymExplorePlaylistElement_C");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_GymExplorePlaylistElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, ExploreLevelButtonPress) == 0x0002C8, "Member 'UBP_GymExplorePlaylistElement_C::ExploreLevelButtonPress' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, ExploreLevelButtonHover) == 0x0002D0, "Member 'UBP_GymExplorePlaylistElement_C::ExploreLevelButtonHover' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, Button) == 0x0002D8, "Member 'UBP_GymExplorePlaylistElement_C::Button' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, CreatorName) == 0x0002E0, "Member 'UBP_GymExplorePlaylistElement_C::CreatorName' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, Hover) == 0x0002E8, "Member 'UBP_GymExplorePlaylistElement_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, HoverLines) == 0x0002F0, "Member 'UBP_GymExplorePlaylistElement_C::HoverLines' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, Image) == 0x0002F8, "Member 'UBP_GymExplorePlaylistElement_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, Image_167) == 0x000300, "Member 'UBP_GymExplorePlaylistElement_C::Image_167' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, PlaylistName) == 0x000308, "Member 'UBP_GymExplorePlaylistElement_C::PlaylistName' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, TextBorder) == 0x000310, "Member 'UBP_GymExplorePlaylistElement_C::TextBorder' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, Thumbnail) == 0x000318, "Member 'UBP_GymExplorePlaylistElement_C::Thumbnail' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, PlaylistMeta) == 0x000320, "Member 'UBP_GymExplorePlaylistElement_C::PlaylistMeta' has a wrong offset!");
static_assert(offsetof(UBP_GymExplorePlaylistElement_C, ExploreMenu) == 0x000358, "Member 'UBP_GymExplorePlaylistElement_C::ExploreMenu' has a wrong offset!");

}

