#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymEditorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymEditorWidget.BP_GymEditorWidget_C
// 0x0138 (0x04E8 - 0x03B0)
class UBP_GymEditorWidget_C final : public UGymGuiEditorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInputActionUI_C*                       CancelInputActionUI;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_3;                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_4;                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_5;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_13;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       EditorRotationAxisInputActionUI;                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_86;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputActionUI;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       JumpInputActionUI;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelKitText;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       NextKitInputActionUI;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PanelAnchor;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       PrevKitInputActionUI;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PropEditBox;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       PropertyEditorInputAction;                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       RemoveInputActionUI;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RotationBoxes;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentOptionWidgetSelection;                      // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EditorPiece_C*                      CurrentMainPanel;                                  // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGymEditorCategory                            LastCategory;                                      // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         WallToolsIgnoreList;                               // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasWallTools;                                      // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAnyTools;                                       // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenCloseFlag;                                     // 0x0472(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstOpen;                                         // 0x0473(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EGymEditorCategory, class UWidget*>      AssetRows;                                         // 0x0478(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UBP_EditorToolsRow_C*                   ToolsRow;                                          // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                PreviousWidget;                                    // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_GymMap_C*                           GymMap;                                            // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          JustNavigatedManually;                             // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CareerCompleted;                                   // 0x04E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AvailableToolsCheck();
	void BPClose();
	void BPOpen();
	void Construct();
	void ContextualConfirm();
	void ContextualDecline();
	void ContextualDown();
	void ContextualLeft();
	void ContextualRight();
	void ContextualUp();
	void CreateCategoryPanel();
	void EditAssetProperty(class AGymStaticLevelAsset* Asset, const class FText& AssetName);
	void ExecuteUbergraph_BP_GymEditorWidget(int32 EntryPoint);
	struct FSlateBrush GetBrush_0();
	class FText GetLevelKitName();
	class FText GetLevelKitText();
	class UGymToolSetting* GetToolFromBP();
	void LevelKitChanged();
	void OnEditAssetPropertyVariantChanged(class AGymStaticLevelAsset* Asset, const class FText& AssetName);
	void OnMovingAssetChanged(bool bIsMovingAsset);
	void OnPropertiesChangedForAsset(class AGymStaticLevelAsset* Asset);
	void OnVisibilityChanged_Event(ESlateVisibility InVisibility);
	void OpenCategoryAndVariant(EGymEditorCategory Category, const struct FGymAssetVariantId& VariantId);
	void SelectCategory(EGymEditorCategory Category);
	void SetCurrentMainPanel(class UBP_EditorPiece_C* NewMainPanel);
	void StartEditingAssetProperty(class AGymStaticLevelAsset* Asset, const class FText& AssetName);
	void StopEditingAssetProperty();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymEditorWidget_C">();
	}
	static class UBP_GymEditorWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymEditorWidget_C>();
	}
};
static_assert(alignof(UBP_GymEditorWidget_C) == 0x000008, "Wrong alignment on UBP_GymEditorWidget_C");
static_assert(sizeof(UBP_GymEditorWidget_C) == 0x0004E8, "Wrong size on UBP_GymEditorWidget_C");
static_assert(offsetof(UBP_GymEditorWidget_C, UberGraphFrame) == 0x0003B0, "Member 'UBP_GymEditorWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, CancelInputActionUI) == 0x0003B8, "Member 'UBP_GymEditorWidget_C::CancelInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, CommonActionWidget_3) == 0x0003C0, "Member 'UBP_GymEditorWidget_C::CommonActionWidget_3' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, CommonActionWidget_4) == 0x0003C8, "Member 'UBP_GymEditorWidget_C::CommonActionWidget_4' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, CommonActionWidget_5) == 0x0003D0, "Member 'UBP_GymEditorWidget_C::CommonActionWidget_5' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, CommonActionWidget_13) == 0x0003D8, "Member 'UBP_GymEditorWidget_C::CommonActionWidget_13' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, EditorRotationAxisInputActionUI) == 0x0003E0, "Member 'UBP_GymEditorWidget_C::EditorRotationAxisInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, Image) == 0x0003E8, "Member 'UBP_GymEditorWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, Image_86) == 0x0003F0, "Member 'UBP_GymEditorWidget_C::Image_86' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, InputActionUI) == 0x0003F8, "Member 'UBP_GymEditorWidget_C::InputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, JumpInputActionUI) == 0x000400, "Member 'UBP_GymEditorWidget_C::JumpInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, LevelKitText) == 0x000408, "Member 'UBP_GymEditorWidget_C::LevelKitText' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, NextKitInputActionUI) == 0x000410, "Member 'UBP_GymEditorWidget_C::NextKitInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, PanelAnchor) == 0x000418, "Member 'UBP_GymEditorWidget_C::PanelAnchor' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, PrevKitInputActionUI) == 0x000420, "Member 'UBP_GymEditorWidget_C::PrevKitInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, PropEditBox) == 0x000428, "Member 'UBP_GymEditorWidget_C::PropEditBox' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, PropertyEditorInputAction) == 0x000430, "Member 'UBP_GymEditorWidget_C::PropertyEditorInputAction' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, RemoveInputActionUI) == 0x000438, "Member 'UBP_GymEditorWidget_C::RemoveInputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, RotationBoxes) == 0x000440, "Member 'UBP_GymEditorWidget_C::RotationBoxes' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, CurrentOptionWidgetSelection) == 0x000448, "Member 'UBP_GymEditorWidget_C::CurrentOptionWidgetSelection' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, CurrentMainPanel) == 0x000450, "Member 'UBP_GymEditorWidget_C::CurrentMainPanel' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, LastCategory) == 0x000458, "Member 'UBP_GymEditorWidget_C::LastCategory' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, WallToolsIgnoreList) == 0x000460, "Member 'UBP_GymEditorWidget_C::WallToolsIgnoreList' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, HasWallTools) == 0x000470, "Member 'UBP_GymEditorWidget_C::HasWallTools' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, HasAnyTools) == 0x000471, "Member 'UBP_GymEditorWidget_C::HasAnyTools' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, OpenCloseFlag) == 0x000472, "Member 'UBP_GymEditorWidget_C::OpenCloseFlag' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, FirstOpen) == 0x000473, "Member 'UBP_GymEditorWidget_C::FirstOpen' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, AssetRows) == 0x000478, "Member 'UBP_GymEditorWidget_C::AssetRows' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, ToolsRow) == 0x0004C8, "Member 'UBP_GymEditorWidget_C::ToolsRow' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, PreviousWidget) == 0x0004D0, "Member 'UBP_GymEditorWidget_C::PreviousWidget' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, GymMap) == 0x0004D8, "Member 'UBP_GymEditorWidget_C::GymMap' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, JustNavigatedManually) == 0x0004E0, "Member 'UBP_GymEditorWidget_C::JustNavigatedManually' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorWidget_C, CareerCompleted) == 0x0004E1, "Member 'UBP_GymEditorWidget_C::CareerCompleted' has a wrong offset!");

}

