#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymEditorCategorySlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymEditorCategorySlot.BP_GymEditorCategorySlot_C
// 0x0078 (0x0338 - 0x02C0)
class UBP_GymEditorCategorySlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PaperTexture;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBox;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ThumbnailScale;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymCategoryInfo                       Category;                                          // 0x0300(0x0030)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UBP_GymEditorWidget_C*                  EditorGui;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_GymEditorCategorySlot(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymEditorCategorySlot_C">();
	}
	static class UBP_GymEditorCategorySlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymEditorCategorySlot_C>();
	}
};
static_assert(alignof(UBP_GymEditorCategorySlot_C) == 0x000008, "Wrong alignment on UBP_GymEditorCategorySlot_C");
static_assert(sizeof(UBP_GymEditorCategorySlot_C) == 0x000338, "Wrong size on UBP_GymEditorCategorySlot_C");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_GymEditorCategorySlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, Border_0) == 0x0002C8, "Member 'UBP_GymEditorCategorySlot_C::Border_0' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, Button) == 0x0002D0, "Member 'UBP_GymEditorCategorySlot_C::Button' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, PaperTexture) == 0x0002D8, "Member 'UBP_GymEditorCategorySlot_C::PaperTexture' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, SizeBox) == 0x0002E0, "Member 'UBP_GymEditorCategorySlot_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, TextBox) == 0x0002E8, "Member 'UBP_GymEditorCategorySlot_C::TextBox' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, Thumbnail) == 0x0002F0, "Member 'UBP_GymEditorCategorySlot_C::Thumbnail' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, ThumbnailScale) == 0x0002F8, "Member 'UBP_GymEditorCategorySlot_C::ThumbnailScale' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, Category) == 0x000300, "Member 'UBP_GymEditorCategorySlot_C::Category' has a wrong offset!");
static_assert(offsetof(UBP_GymEditorCategorySlot_C, EditorGui) == 0x000330, "Member 'UBP_GymEditorCategorySlot_C::EditorGui' has a wrong offset!");

}

