#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymMainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_GymMainMenu.BP_GymMainMenu_C.ExecuteUbergraph_BP_GymMainMenu
// 0x0058 (0x0058 - 0x0000)
struct BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success, const struct FGymUnclaimedRewardResponse& Response)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymUnclaimedRewardResponse            K2Node_CustomEvent_Response;                       // 0x0028(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GymGameInstance_C*                  K2Node_DynamicCast_AsBP_Gym_Game_Instance;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu) == 0x000008, "Wrong alignment on BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu");
static_assert(sizeof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu) == 0x000058, "Wrong size on BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, EntryPoint) == 0x000000, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, K2Node_CustomEvent_Success) == 0x000020, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, K2Node_CustomEvent_Response) == 0x000028, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::K2Node_CustomEvent_Response' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, K2Node_DynamicCast_AsBP_Gym_Game_Instance) == 0x000048, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::K2Node_DynamicCast_AsBP_Gym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_GymMainMenu_C_ExecuteUbergraph_BP_GymMainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GymMainMenu.BP_GymMainMenu_C.GetColorAndOpacity_0
// 0x0014 (0x0014 - 0x0000)
struct BP_GymMainMenu_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_GymMainMenu_C_GetColorAndOpacity_0) == 0x000004, "Wrong alignment on BP_GymMainMenu_C_GetColorAndOpacity_0");
static_assert(sizeof(BP_GymMainMenu_C_GetColorAndOpacity_0) == 0x000014, "Wrong size on BP_GymMainMenu_C_GetColorAndOpacity_0");
static_assert(offsetof(BP_GymMainMenu_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'BP_GymMainMenu_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");

// Function BP_GymMainMenu.BP_GymMainMenu_C.OnUnclaimedRewards
// 0x0018 (0x0018 - 0x0000)
struct BP_GymMainMenu_C_OnUnclaimedRewards final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymUnclaimedRewardResponse            Response;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_GymMainMenu_C_OnUnclaimedRewards) == 0x000008, "Wrong alignment on BP_GymMainMenu_C_OnUnclaimedRewards");
static_assert(sizeof(BP_GymMainMenu_C_OnUnclaimedRewards) == 0x000018, "Wrong size on BP_GymMainMenu_C_OnUnclaimedRewards");
static_assert(offsetof(BP_GymMainMenu_C_OnUnclaimedRewards, Success) == 0x000000, "Member 'BP_GymMainMenu_C_OnUnclaimedRewards::Success' has a wrong offset!");
static_assert(offsetof(BP_GymMainMenu_C_OnUnclaimedRewards, Response) == 0x000008, "Member 'BP_GymMainMenu_C_OnUnclaimedRewards::Response' has a wrong offset!");

}

