#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExploreSidebar

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_GymExploreSidebar.BP_GymExploreSidebar_C.ExecuteUbergraph_BP_GymExploreSidebar
// 0x0298 (0x0298 - 0x0000)
struct BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0030(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGymMapSearchFilters                   K2Node_MakeStruct_GymMapSearchFilters;             // 0x0060(0x0040)()
	struct FGymMapSearchFilters                   K2Node_MakeStruct_GymMapSearchFilters_1;           // 0x00A0(0x0040)()
	struct FGymMapSearchFilters                   K2Node_MakeStruct_GymMapSearchFilters_2;           // 0x00E0(0x0040)()
	struct FGymMapSearchFilters                   K2Node_MakeStruct_GymMapSearchFilters_3;           // 0x0120(0x0040)()
	struct FGymMapSearchFilters                   K2Node_MakeStruct_GymMapSearchFilters_4;           // 0x0160(0x0040)()
	struct FGymMapSearchFilters                   K2Node_MakeStruct_GymMapSearchFilters_5;           // 0x01A0(0x0040)()
	struct FGymMapSearchFilters                   K2Node_MakeStruct_GymMapSearchFilters_6;           // 0x01E0(0x0040)()
	class UBP_GymExploreMenu_C*                   K2Node_CustomEvent_ExploreMenu;                    // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGymMapSearchFilters                   K2Node_MakeStruct_GymMapSearchFilters_7;           // 0x0228(0x0040)()
	bool                                          Temp_bool_Variable;                                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsDemo_ReturnValue;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientAdmin_ReturnValue;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar) == 0x000008, "Wrong alignment on BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar");
static_assert(sizeof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar) == 0x000298, "Wrong size on BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, EntryPoint) == 0x000000, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, Temp_byte_Variable) == 0x000004, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, CallFunc_GetText_ReturnValue_1) == 0x000030, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, Temp_byte_Variable_1) == 0x000048, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000050, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeStruct_GymMapSearchFilters) == 0x000060, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeStruct_GymMapSearchFilters' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeStruct_GymMapSearchFilters_1) == 0x0000A0, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeStruct_GymMapSearchFilters_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeStruct_GymMapSearchFilters_2) == 0x0000E0, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeStruct_GymMapSearchFilters_2' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeStruct_GymMapSearchFilters_3) == 0x000120, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeStruct_GymMapSearchFilters_3' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeStruct_GymMapSearchFilters_4) == 0x000160, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeStruct_GymMapSearchFilters_4' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeStruct_GymMapSearchFilters_5) == 0x0001A0, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeStruct_GymMapSearchFilters_5' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeStruct_GymMapSearchFilters_6) == 0x0001E0, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeStruct_GymMapSearchFilters_6' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_CustomEvent_ExploreMenu) == 0x000220, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_CustomEvent_ExploreMenu' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeStruct_GymMapSearchFilters_7) == 0x000228, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeStruct_GymMapSearchFilters_7' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, Temp_bool_Variable) == 0x000268, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_MakeArray_Array) == 0x000270, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, CallFunc_IsDemo_ReturnValue) == 0x000280, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::CallFunc_IsDemo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, K2Node_Select_Default) == 0x000281, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000288, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar, CallFunc_IsClientAdmin_ReturnValue) == 0x000290, "Member 'BP_GymExploreSidebar_C_ExecuteUbergraph_BP_GymExploreSidebar::CallFunc_IsClientAdmin_ReturnValue' has a wrong offset!");

// Function BP_GymExploreSidebar.BP_GymExploreSidebar_C.Get_Career_Visibility
// 0x0018 (0x0018 - 0x0000)
struct BP_GymExploreSidebar_C_Get_Career_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientAdmin_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExploreSidebar_C_Get_Career_Visibility) == 0x000008, "Wrong alignment on BP_GymExploreSidebar_C_Get_Career_Visibility");
static_assert(sizeof(BP_GymExploreSidebar_C_Get_Career_Visibility) == 0x000018, "Wrong size on BP_GymExploreSidebar_C_Get_Career_Visibility");
static_assert(offsetof(BP_GymExploreSidebar_C_Get_Career_Visibility, ReturnValue) == 0x000000, "Member 'BP_GymExploreSidebar_C_Get_Career_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_Get_Career_Visibility, Temp_bool_Variable) == 0x000001, "Member 'BP_GymExploreSidebar_C_Get_Career_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_Get_Career_Visibility, Temp_byte_Variable) == 0x000002, "Member 'BP_GymExploreSidebar_C_Get_Career_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_Get_Career_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'BP_GymExploreSidebar_C_Get_Career_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_Get_Career_Visibility, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_GymExploreSidebar_C_Get_Career_Visibility::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_Get_Career_Visibility, CallFunc_IsClientAdmin_ReturnValue) == 0x000010, "Member 'BP_GymExploreSidebar_C_Get_Career_Visibility::CallFunc_IsClientAdmin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExploreSidebar_C_Get_Career_Visibility, K2Node_Select_Default) == 0x000011, "Member 'BP_GymExploreSidebar_C_Get_Career_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function BP_GymExploreSidebar.BP_GymExploreSidebar_C.OnTabButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_GymExploreSidebar_C_OnTabButtonClicked__DelegateSignature final
{
public:
	class UWBP_ExploreSidebarButton_C*            ClickedButton;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExploreSidebar_C_OnTabButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_GymExploreSidebar_C_OnTabButtonClicked__DelegateSignature");
static_assert(sizeof(BP_GymExploreSidebar_C_OnTabButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BP_GymExploreSidebar_C_OnTabButtonClicked__DelegateSignature");
static_assert(offsetof(BP_GymExploreSidebar_C_OnTabButtonClicked__DelegateSignature, ClickedButton) == 0x000000, "Member 'BP_GymExploreSidebar_C_OnTabButtonClicked__DelegateSignature::ClickedButton' has a wrong offset!");

// Function BP_GymExploreSidebar.BP_GymExploreSidebar_C.OnTabSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_GymExploreSidebar_C_OnTabSelected__DelegateSignature final
{
public:
	class FString                                 Category;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExploreSidebar_C_OnTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_GymExploreSidebar_C_OnTabSelected__DelegateSignature");
static_assert(sizeof(BP_GymExploreSidebar_C_OnTabSelected__DelegateSignature) == 0x000010, "Wrong size on BP_GymExploreSidebar_C_OnTabSelected__DelegateSignature");
static_assert(offsetof(BP_GymExploreSidebar_C_OnTabSelected__DelegateSignature, Category) == 0x000000, "Member 'BP_GymExploreSidebar_C_OnTabSelected__DelegateSignature::Category' has a wrong offset!");

// Function BP_GymExploreSidebar.BP_GymExploreSidebar_C.RegisterExplreMenu
// 0x0008 (0x0008 - 0x0000)
struct BP_GymExploreSidebar_C_RegisterExplreMenu final
{
public:
	class UBP_GymExploreMenu_C*                   ExploreMenu_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExploreSidebar_C_RegisterExplreMenu) == 0x000008, "Wrong alignment on BP_GymExploreSidebar_C_RegisterExplreMenu");
static_assert(sizeof(BP_GymExploreSidebar_C_RegisterExplreMenu) == 0x000008, "Wrong size on BP_GymExploreSidebar_C_RegisterExplreMenu");
static_assert(offsetof(BP_GymExploreSidebar_C_RegisterExplreMenu, ExploreMenu_0) == 0x000000, "Member 'BP_GymExploreSidebar_C_RegisterExplreMenu::ExploreMenu_0' has a wrong offset!");

}

