#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymGUIPlaylistScoreboardWidget

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "RowData_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_GymGUIPlaylistScoreboardWidget.BP_GymGUIPlaylistScoreboardWidget_C.AwardScores
// 0x00C0 (0x00C0 - 0x0000)
struct BP_GymGUIPlaylistScoreboardWidget_C_AwardScores final
{
public:
	int32                                         TotalScore;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ThisLevelScore;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TrueScoreAwarded;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MissingScore;                                      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0088(0x0018)()
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GymTournamentEntry_C*               CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetThisLevelScore_Score;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalScore_Total_Score;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores) == 0x000008, "Wrong alignment on BP_GymGUIPlaylistScoreboardWidget_C_AwardScores");
static_assert(sizeof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores) == 0x0000C0, "Wrong size on BP_GymGUIPlaylistScoreboardWidget_C_AwardScores");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, TotalScore) == 0x000000, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::TotalScore' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, ThisLevelScore) == 0x000004, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::ThisLevelScore' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, TrueScoreAwarded) == 0x000008, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::TrueScoreAwarded' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, MissingScore) == 0x00000C, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::MissingScore' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, Temp_int_Variable) == 0x000010, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Conv_IntToText_ReturnValue) == 0x000088, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Clamp_ReturnValue) == 0x0000A0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A4, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_GetThisLevelScore_Score) == 0x0000B4, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_GetThisLevelScore_Score' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_AwardScores, CallFunc_GetTotalScore_Total_Score) == 0x0000BC, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_AwardScores::CallFunc_GetTotalScore_Total_Score' has a wrong offset!");

// Function BP_GymGUIPlaylistScoreboardWidget.BP_GymGUIPlaylistScoreboardWidget_C.EndSessionComplete
// 0x0001 (0x0001 - 0x0000)
struct BP_GymGUIPlaylistScoreboardWidget_C_EndSessionComplete final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymGUIPlaylistScoreboardWidget_C_EndSessionComplete) == 0x000001, "Wrong alignment on BP_GymGUIPlaylistScoreboardWidget_C_EndSessionComplete");
static_assert(sizeof(BP_GymGUIPlaylistScoreboardWidget_C_EndSessionComplete) == 0x000001, "Wrong size on BP_GymGUIPlaylistScoreboardWidget_C_EndSessionComplete");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_EndSessionComplete, Success) == 0x000000, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_EndSessionComplete::Success' has a wrong offset!");

// Function BP_GymGUIPlaylistScoreboardWidget.BP_GymGUIPlaylistScoreboardWidget_C.ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget
// 0x0330 (0x0330 - 0x0000)
struct BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0038(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0050(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0068(0x0018)(HasGetValueTypeHash)
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_1;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GymTournamentEntry_C*               CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GymTournamentEntry_C*               CallFunc_Array_Get_Item_1;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0158(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsValidLevel;                        // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable;                              // 0x01D0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x01E8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlaylist_ReturnValue;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalAndFinal_ReturnValue;              // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSingleCareerLevel_ReturnValue;          // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSingleCareerLevel_ReturnValue_1;        // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlaylist_ReturnValue_1;            // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlaylist_ReturnValue_2;            // 0x0206(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0207(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2; // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3; // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_3;          // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPauseMenuOpen_Yes;                      // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPauseMenuOpen_Yes_1;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPauseMenuOpen_Yes_2;                    // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPauseMenuOpen_Yes_3;                    // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalAndFinal_ReturnValue_1;            // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymPlaylistScoreboardEntry            CallFunc_GetMyScore_Data;                          // 0x0230(0x0038)()
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x0268(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlaylistName_ReturnValue;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B[0x5];                                      // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymPlaylistScoreboardEntry            CallFunc_GetMyScore_Data_1;                        // 0x02A0(0x0038)()
	class FString                                 CallFunc_GetPlaylistName_ReturnValue_1;            // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GymGameInstance_C*                  K2Node_DynamicCast_AsBP_Gym_Game_Instance;         // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalAndFinal_ReturnValue_2;            // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_TimeUntilTravel_ImplicitCast;   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget) == 0x000008, "Wrong alignment on BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget");
static_assert(sizeof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget) == 0x000330, "Wrong size on BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, EntryPoint) == 0x000000, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000010, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_bool_Variable) == 0x000019, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_byte_Variable) == 0x00001A, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_byte_Variable_1) == 0x00001B, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_InputActionEvent_Key_3) == 0x000020, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_InputActionEvent_Key_2) == 0x000038, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_InputActionEvent_Key_1) == 0x000050, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_InputActionEvent_Key) == 0x000068, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000080, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_byte_Variable_2) == 0x000098, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_byte_Variable_3) == 0x000099, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsValid_ReturnValue) == 0x00009A, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_bool_Variable_1) == 0x0000A8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_int_Variable) == 0x0000AC, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000B0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_DynamicCast_AsGym_Game_Instance_1) == 0x0000B8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_DynamicCast_AsGym_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_SwitchEnum_CmpSuccess) == 0x0000C1, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000108, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000118, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000120, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_CustomEvent_Index) == 0x000128, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Array_Get_Item) == 0x000130, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000138, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_byte_Variable_4) == 0x00013C, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Array_Get_Item_1) == 0x000148, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000150, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000154, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_Event_MyGeometry) == 0x000158, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_Event_InDeltaTime) == 0x000190, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000194, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000198, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_byte_Variable_5) == 0x0001A0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_FMax_ReturnValue) == 0x0001A8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_Event_bIsValidLevel) == 0x0001B0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_Event_bIsValidLevel' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Not_PreBool_ReturnValue) == 0x0001B1, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001B8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001C0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_BooleanOR_ReturnValue) == 0x0001C8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001C9, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_bool_Variable_2) == 0x0001CA, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x0001CB, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_Select_Default) == 0x0001CC, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, Temp_struct_Variable) == 0x0001D0, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_InputActionEvent_Key_4) == 0x0001E8, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsLocalPlaylist_ReturnValue) == 0x000200, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsLocalPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsLocalAndFinal_ReturnValue) == 0x000201, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsLocalAndFinal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsSingleCareerLevel_ReturnValue) == 0x000202, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsSingleCareerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_Select_Default_1) == 0x000203, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsSingleCareerLevel_ReturnValue_1) == 0x000204, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsSingleCareerLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsLocalPlaylist_ReturnValue_1) == 0x000205, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsLocalPlaylist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsLocalPlaylist_ReturnValue_2) == 0x000206, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsLocalPlaylist_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_Select_Default_2) == 0x000207, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x000208, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_MakeArray_Array) == 0x000210, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1) == 0x000220, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2) == 0x000221, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3) == 0x000222, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_GamepadUINavigate_ReturnValue) == 0x000223, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x000224, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_GamepadUINavigate_ReturnValue_2) == 0x000225, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_GamepadUINavigate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_GamepadUINavigate_ReturnValue_3) == 0x000226, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_GamepadUINavigate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsPauseMenuOpen_Yes) == 0x000227, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsPauseMenuOpen_Yes' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsValid_ReturnValue_1) == 0x000228, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsPauseMenuOpen_Yes_1) == 0x000229, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsPauseMenuOpen_Yes_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsPauseMenuOpen_Yes_2) == 0x00022A, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsPauseMenuOpen_Yes_2' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsPauseMenuOpen_Yes_3) == 0x00022B, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsPauseMenuOpen_Yes_3' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_IsLocalAndFinal_ReturnValue_1) == 0x00022C, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_IsLocalAndFinal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, CallFunc_GetMyScore_Data) == 0x000230, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::CallFunc_GetMyScore_Data' has a wrong offset!");
static_assert(offsetof(BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget, K2Node_InputActionEvent_Key_5) == 0x000268, "Member 'BP_GymGUIPlaylistScoreboardWidget_C_ExecuteUbergraph_BP_GymGUIPlaylistScoreboardWidget::K2Node_InputActionEvent_Key_5' has a wrong offset!");
