#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExplorePlaylistLevelDetails

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_GymExplorePlaylistLevelDetails.BP_GymExplorePlaylistLevelDetails_C.ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails
// 0x0028 (0x0028 - 0x0000)
struct BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetIconFromGamemode_GameModeIcon;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails) == 0x000008, "Wrong alignment on BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails");
static_assert(sizeof(BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails) == 0x000028, "Wrong size on BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails");
static_assert(offsetof(BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails, EntryPoint) == 0x000000, "Member 'BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails, CallFunc_GetIconFromGamemode_GameModeIcon) == 0x000008, "Member 'BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails::CallFunc_GetIconFromGamemode_GameModeIcon' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'BP_GymExplorePlaylistLevelDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistLevelDetails::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BP_GymExplorePlaylistLevelDetails.BP_GymExplorePlaylistLevelDetails_C.GetIconFromGamemode
// 0x0068 (0x0068 - 0x0000)
struct BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode final
{
public:
	class FString                                 GameMode;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             GameModeIcon;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuleDisplayInfo                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode) == 0x000008, "Wrong alignment on BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode");
static_assert(sizeof(BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode) == 0x000068, "Wrong size on BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode");
static_assert(offsetof(BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode, GameMode) == 0x000000, "Member 'BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode::GameMode' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode, GameModeIcon) == 0x000010, "Member 'BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode::GameModeIcon' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'BP_GymExplorePlaylistLevelDetails_C_GetIconFromGamemode::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

