#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymGameInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GymGameInstance.BP_GymGameInstance_C
// 0x0038 (0x05A0 - 0x0568)
class UBP_GymGameInstance_C final : public UGymGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          OneshotKillReady;                                  // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LookingForServer;                                  // 0x0571(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572[0x6];                                      // 0x0572(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MenuPlayback;                                      // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentLoadingScreenTipId;                         // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenCareerMenu;                                    // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LastCareerLevel;                                   // 0x0590(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GymGameInstance(int32 EntryPoint);
	void GetNewLoadingScreenTip();
	void LoadMainMenu();
	void ReceiveInit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymGameInstance_C">();
	}
	static class UBP_GymGameInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymGameInstance_C>();
	}
};
static_assert(alignof(UBP_GymGameInstance_C) == 0x000008, "Wrong alignment on UBP_GymGameInstance_C");
static_assert(sizeof(UBP_GymGameInstance_C) == 0x0005A0, "Wrong size on UBP_GymGameInstance_C");
static_assert(offsetof(UBP_GymGameInstance_C, UberGraphFrame) == 0x000568, "Member 'UBP_GymGameInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymGameInstance_C, OneshotKillReady) == 0x000570, "Member 'UBP_GymGameInstance_C::OneshotKillReady' has a wrong offset!");
static_assert(offsetof(UBP_GymGameInstance_C, LookingForServer) == 0x000571, "Member 'UBP_GymGameInstance_C::LookingForServer' has a wrong offset!");
static_assert(offsetof(UBP_GymGameInstance_C, MenuPlayback) == 0x000578, "Member 'UBP_GymGameInstance_C::MenuPlayback' has a wrong offset!");
static_assert(offsetof(UBP_GymGameInstance_C, CurrentLoadingScreenTipId) == 0x000580, "Member 'UBP_GymGameInstance_C::CurrentLoadingScreenTipId' has a wrong offset!");
static_assert(offsetof(UBP_GymGameInstance_C, OpenCareerMenu) == 0x000588, "Member 'UBP_GymGameInstance_C::OpenCareerMenu' has a wrong offset!");
static_assert(offsetof(UBP_GymGameInstance_C, LastCareerLevel) == 0x000590, "Member 'UBP_GymGameInstance_C::LastCareerLevel' has a wrong offset!");

}

