#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExploreMenu

#include "Basic.hpp"

#include "E_LastExploreType_structs.hpp"
#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymExploreMenu.BP_GymExploreMenu_C
// 0x0168 (0x04A0 - 0x0338)
class UBP_GymExploreMenu_C final : public UGymGuiGlobalMetaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_AddToPlaylistMenu_C*                AddToPlaylistMenu;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GymExploreDescription_C*            BP_GymExploreDescription;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GymExploreResultsData_C*            BP_GymExploreResultsData;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GymExploreSidebar_C*                BP_GymExploreSidebar;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ReportWidget_C*                     BP_ReportWidget;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            BuyFullGame;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContentArea;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          CreatorFilter;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DemoSwitcher;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DetailsOverlay;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GymExploreMapDetails_C*             DetailsWidget;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_C*                       Explore;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          MapFilter;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Pagination_PageListContainer_C*    Pagination;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GymExplorePlaylistDetails_C*        PlaylistDetailsWidget;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TransparentBackground;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWidget*>                        MapWidgets;                                        // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWidget*>                        ExploreMenuWidgets;                                // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWidget*                                LastSelectedMap;                                   // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        SidebarWidgets;                                    // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWidget*                                LastSelectedSidebar;                               // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldGetFeatured;                                 // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LastExploreType                             LastSearchType;                                    // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymMapSearchFilters                   LastFilters;                                       // 0x0420(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ChanginPage;                                       // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreNextSidebarGamepadClick;                     // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_462[0x2];                                      // 0x0462(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastClearMapIndex;                                 // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SearchTimer;                                       // 0x0468(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   LastTickMapFilter;                                 // 0x0470(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LastTickCreatorFilter;                             // 0x0488(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__BP_GymExploreMenu_CreatorFilter_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__BP_GymExploreMenu_MapFilter_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BPClose();
	void BPHighlightWidget(class UWidget* Widget);
	void BPOpen();
	void ClearMapList();
	void CloseDetails();
	void Construct();
	void Event_Map_Search_Complete(bool Success);
	void Event_Playlist_Search_Complete(bool Success);
	void ExecuteUbergraph_BP_GymExploreMenu(int32 EntryPoint);
	void Filter(TArray<struct FGymMapSearchResult>* Filtered);
	void GamepadMapSelectCheck();
	void GamepadSidebarCheck();
	ESlateVisibility GetVisibility_0();
	void InpActEvt_Exit_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_5(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_6(const struct FKey& Key);
	void ListenSearchFilterChanged();
	void MapClicked(const class FString& MapId);
	void MapSearchChanged(const struct FGymMapSearchFilters& Filters);
	void MapSearchFeatured();
	void MapSearchMyMaps();
	void OnAddToPlaylistMenuVisibilityChanged(ESlateVisibility InVisibility);
	void OnInitialized();
	void OnMapDetailsReceived_Event(bool Success, const struct FGymMapDetailsResult& Details);
	void OnMapNameSearchChanged();
	void OnPageChanged_Event(int32 Page);
	void OnPlaylistDetailsReceived(bool Success, const struct FGymPlaylistDetailsResult& Details);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnSidebarButtonClicked(class UWBP_ExploreSidebarButton_C* ClickedButton);
	void PlaylistClicked(const class FString& PlaylistId);
	void PlaylistSearchChanged();
	void PlaylistSearchOwnLists();
	void PopulateMapList();
	void PopulatePlaylistList();
	void SearchFilterChanged();
	void ShowAddToPlaylist(const class FString& MapId);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymExploreMenu_C">();
	}
	static class UBP_GymExploreMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymExploreMenu_C>();
	}
};
static_assert(alignof(UBP_GymExploreMenu_C) == 0x000008, "Wrong alignment on UBP_GymExploreMenu_C");
static_assert(sizeof(UBP_GymExploreMenu_C) == 0x0004A0, "Wrong size on UBP_GymExploreMenu_C");
static_assert(offsetof(UBP_GymExploreMenu_C, UberGraphFrame) == 0x000338, "Member 'UBP_GymExploreMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, AddToPlaylistMenu) == 0x000340, "Member 'UBP_GymExploreMenu_C::AddToPlaylistMenu' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, BP_GymExploreDescription) == 0x000348, "Member 'UBP_GymExploreMenu_C::BP_GymExploreDescription' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, BP_GymExploreResultsData) == 0x000350, "Member 'UBP_GymExploreMenu_C::BP_GymExploreResultsData' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, BP_GymExploreSidebar) == 0x000358, "Member 'UBP_GymExploreMenu_C::BP_GymExploreSidebar' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, BP_ReportWidget) == 0x000360, "Member 'UBP_GymExploreMenu_C::BP_ReportWidget' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, BuyFullGame) == 0x000368, "Member 'UBP_GymExploreMenu_C::BuyFullGame' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, ContentArea) == 0x000370, "Member 'UBP_GymExploreMenu_C::ContentArea' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, CreatorFilter) == 0x000378, "Member 'UBP_GymExploreMenu_C::CreatorFilter' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, DemoSwitcher) == 0x000380, "Member 'UBP_GymExploreMenu_C::DemoSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, DetailsOverlay) == 0x000388, "Member 'UBP_GymExploreMenu_C::DetailsOverlay' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, DetailsWidget) == 0x000390, "Member 'UBP_GymExploreMenu_C::DetailsWidget' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, Explore) == 0x000398, "Member 'UBP_GymExploreMenu_C::Explore' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, MapFilter) == 0x0003A0, "Member 'UBP_GymExploreMenu_C::MapFilter' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, Pagination) == 0x0003A8, "Member 'UBP_GymExploreMenu_C::Pagination' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, PlaylistDetailsWidget) == 0x0003B0, "Member 'UBP_GymExploreMenu_C::PlaylistDetailsWidget' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, ScrollBox) == 0x0003B8, "Member 'UBP_GymExploreMenu_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, TransparentBackground) == 0x0003C0, "Member 'UBP_GymExploreMenu_C::TransparentBackground' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, HighlightableWidgets) == 0x0003C8, "Member 'UBP_GymExploreMenu_C::HighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, MapWidgets) == 0x0003D8, "Member 'UBP_GymExploreMenu_C::MapWidgets' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, ExploreMenuWidgets) == 0x0003E8, "Member 'UBP_GymExploreMenu_C::ExploreMenuWidgets' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, LastSelectedMap) == 0x0003F8, "Member 'UBP_GymExploreMenu_C::LastSelectedMap' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, SidebarWidgets) == 0x000400, "Member 'UBP_GymExploreMenu_C::SidebarWidgets' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, LastSelectedSidebar) == 0x000410, "Member 'UBP_GymExploreMenu_C::LastSelectedSidebar' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, ShouldGetFeatured) == 0x000418, "Member 'UBP_GymExploreMenu_C::ShouldGetFeatured' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, LastSearchType) == 0x000419, "Member 'UBP_GymExploreMenu_C::LastSearchType' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, LastFilters) == 0x000420, "Member 'UBP_GymExploreMenu_C::LastFilters' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, ChanginPage) == 0x000460, "Member 'UBP_GymExploreMenu_C::ChanginPage' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, IgnoreNextSidebarGamepadClick) == 0x000461, "Member 'UBP_GymExploreMenu_C::IgnoreNextSidebarGamepadClick' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, LastClearMapIndex) == 0x000464, "Member 'UBP_GymExploreMenu_C::LastClearMapIndex' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, SearchTimer) == 0x000468, "Member 'UBP_GymExploreMenu_C::SearchTimer' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, LastTickMapFilter) == 0x000470, "Member 'UBP_GymExploreMenu_C::LastTickMapFilter' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreMenu_C, LastTickCreatorFilter) == 0x000488, "Member 'UBP_GymExploreMenu_C::LastTickCreatorFilter' has a wrong offset!");

}

