#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymBaseGameMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GymBaseGameMode.BP_GymBaseGameMode_C.IsHub
// 0x00A0 (0x00A0 - 0x0000)
struct BP_GymBaseGameMode_C_IsHub final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCommandLine_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseCommandLine_OutTokens;               // 0x0028(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_ParseCommandLine_OutSwitches;             // 0x0038(0x0010)(ReferenceParm)
	TMap<class FString, class FString>            CallFunc_ParseCommandLine_OutParams;               // 0x0048(0x0050)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymBaseGameMode_C_IsHub) == 0x000008, "Wrong alignment on BP_GymBaseGameMode_C_IsHub");
static_assert(sizeof(BP_GymBaseGameMode_C_IsHub) == 0x0000A0, "Wrong size on BP_GymBaseGameMode_C_IsHub");
static_assert(offsetof(BP_GymBaseGameMode_C_IsHub, Value) == 0x000000, "Member 'BP_GymBaseGameMode_C_IsHub::Value' has a wrong offset!");
static_assert(offsetof(BP_GymBaseGameMode_C_IsHub, Temp_string_Variable) == 0x000008, "Member 'BP_GymBaseGameMode_C_IsHub::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymBaseGameMode_C_IsHub, CallFunc_GetCommandLine_ReturnValue) == 0x000018, "Member 'BP_GymBaseGameMode_C_IsHub::CallFunc_GetCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymBaseGameMode_C_IsHub, CallFunc_ParseCommandLine_OutTokens) == 0x000028, "Member 'BP_GymBaseGameMode_C_IsHub::CallFunc_ParseCommandLine_OutTokens' has a wrong offset!");
static_assert(offsetof(BP_GymBaseGameMode_C_IsHub, CallFunc_ParseCommandLine_OutSwitches) == 0x000038, "Member 'BP_GymBaseGameMode_C_IsHub::CallFunc_ParseCommandLine_OutSwitches' has a wrong offset!");
static_assert(offsetof(BP_GymBaseGameMode_C_IsHub, CallFunc_ParseCommandLine_OutParams) == 0x000048, "Member 'BP_GymBaseGameMode_C_IsHub::CallFunc_ParseCommandLine_OutParams' has a wrong offset!");
static_assert(offsetof(BP_GymBaseGameMode_C_IsHub, CallFunc_Array_Contains_ReturnValue) == 0x000098, "Member 'BP_GymBaseGameMode_C_IsHub::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

}

