#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExploreRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymExploreRow.BP_GymExploreRow_C
// 0x0050 (0x0310 - 0x02C0)
class UBP_GymExploreRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Content;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TitleRow;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x02E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class UTexture2D*                             TitleIcon;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         NumElements;                                       // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddElement(class UUserWidget* Element);
	void Construct();
	void ExecuteUbergraph_BP_GymExploreRow(int32 EntryPoint);
	void FillRow();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymExploreRow_C">();
	}
	static class UBP_GymExploreRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymExploreRow_C>();
	}
};
static_assert(alignof(UBP_GymExploreRow_C) == 0x000008, "Wrong alignment on UBP_GymExploreRow_C");
static_assert(sizeof(UBP_GymExploreRow_C) == 0x000310, "Wrong size on UBP_GymExploreRow_C");
static_assert(offsetof(UBP_GymExploreRow_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_GymExploreRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreRow_C, Content) == 0x0002C8, "Member 'UBP_GymExploreRow_C::Content' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreRow_C, IconImage) == 0x0002D0, "Member 'UBP_GymExploreRow_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreRow_C, TextBlock) == 0x0002D8, "Member 'UBP_GymExploreRow_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreRow_C, TitleRow) == 0x0002E0, "Member 'UBP_GymExploreRow_C::TitleRow' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreRow_C, TitleText) == 0x0002E8, "Member 'UBP_GymExploreRow_C::TitleText' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreRow_C, TitleIcon) == 0x000300, "Member 'UBP_GymExploreRow_C::TitleIcon' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreRow_C, NumElements) == 0x000308, "Member 'UBP_GymExploreRow_C::NumElements' has a wrong offset!");

}

