#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExplorePlaylistDetails

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GymExplorePlaylistDetails.BP_GymExplorePlaylistDetails_C.SetMaxPlayersText
// 0x01B8 (0x01B8 - 0x0000)
struct BP_GymExplorePlaylistDetails_C_SetMaxPlayersText final
{
public:
	struct FGymPlaylistDetailsResult              Details_0;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         MaxPlayers;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 MaxPlayerCounts;                                   // 0x0068(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymPlaylistMapInfo                    CallFunc_Array_Get_Item;                           // 0x0080(0x0080)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MinOfIntArray_IndexOfMinValue;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MinOfIntArray_MinValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0140(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0018)()
};
static_assert(alignof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText) == 0x000008, "Wrong alignment on BP_GymExplorePlaylistDetails_C_SetMaxPlayersText");
static_assert(sizeof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText) == 0x0001B8, "Wrong size on BP_GymExplorePlaylistDetails_C_SetMaxPlayersText");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, Details_0) == 0x000000, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::Details_0' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, MaxPlayers) == 0x000060, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::MaxPlayers' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, MaxPlayerCounts) == 0x000068, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::MaxPlayerCounts' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00007C, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000100, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000108, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_FTrunc_ReturnValue) == 0x000110, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, Temp_int_Loop_Counter_Variable) == 0x000118, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Multiply_IntInt_ReturnValue) == 0x00011C, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Less_IntInt_ReturnValue) == 0x000120, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Add_IntInt_ReturnValue) == 0x000124, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_MinOfIntArray_IndexOfMinValue) == 0x000128, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_MinOfIntArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_MinOfIntArray_MinValue) == 0x00012C, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_MinOfIntArray_MinValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Array_Add_ReturnValue) == 0x000130, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000138, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, K2Node_MakeStruct_FormatArgumentData) == 0x000140, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, K2Node_MakeArray_Array) == 0x000190, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetMaxPlayersText, CallFunc_Format_ReturnValue) == 0x0001A0, "Member 'BP_GymExplorePlaylistDetails_C_SetMaxPlayersText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_GymExplorePlaylistDetails.BP_GymExplorePlaylistDetails_C.SetDetails
// 0x01A8 (0x01A8 - 0x0000)
struct BP_GymExplorePlaylistDetails_C_SetDetails final
{
public:
	struct FGymPlaylistDetailsResult              Details_0;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0118(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0130(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0190(0x0018)()
};
static_assert(alignof(BP_GymExplorePlaylistDetails_C_SetDetails) == 0x000008, "Wrong alignment on BP_GymExplorePlaylistDetails_C_SetDetails");
static_assert(sizeof(BP_GymExplorePlaylistDetails_C_SetDetails) == 0x0001A8, "Wrong size on BP_GymExplorePlaylistDetails_C_SetDetails");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, Details_0) == 0x000000, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::Details_0' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000078, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, K2Node_SwitchString_CmpSuccess) == 0x0000F8, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, CallFunc_Conv_StringToText_ReturnValue) == 0x000100, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000118, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, K2Node_MakeStruct_FormatArgumentData_1) == 0x000130, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, K2Node_MakeArray_Array_2) == 0x000180, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_SetDetails, CallFunc_Format_ReturnValue_1) == 0x000190, "Member 'BP_GymExplorePlaylistDetails_C_SetDetails::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_GymExplorePlaylistDetails.BP_GymExplorePlaylistDetails_C.PopulateLevels
// 0x0108 (0x0108 - 0x0000)
struct BP_GymExplorePlaylistDetails_C_PopulateLevels final
{
public:
	struct FGymPlaylistDetailsResult              Details_0;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UBP_GymExplorePlaylistLevelDetails_C*   CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymPlaylistMapInfo                    CallFunc_Array_Get_Item;                           // 0x0078(0x0080)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExplorePlaylistDetails_C_PopulateLevels) == 0x000008, "Wrong alignment on BP_GymExplorePlaylistDetails_C_PopulateLevels");
static_assert(sizeof(BP_GymExplorePlaylistDetails_C_PopulateLevels) == 0x000108, "Wrong size on BP_GymExplorePlaylistDetails_C_PopulateLevels");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, Details_0) == 0x000000, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::Details_0' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, CallFunc_Create_ReturnValue) == 0x000060, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PopulateLevels, CallFunc_AddChild_ReturnValue) == 0x000100, "Member 'BP_GymExplorePlaylistDetails_C_PopulateLevels::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function BP_GymExplorePlaylistDetails.BP_GymExplorePlaylistDetails_C.ScaleButton
// 0x0040 (0x0040 - 0x0000)
struct BP_GymExplorePlaylistDetails_C_ScaleButton final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Hover;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExplorePlaylistDetails_C_ScaleButton) == 0x000008, "Wrong alignment on BP_GymExplorePlaylistDetails_C_ScaleButton");
static_assert(sizeof(BP_GymExplorePlaylistDetails_C_ScaleButton) == 0x000040, "Wrong size on BP_GymExplorePlaylistDetails_C_ScaleButton");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_ScaleButton, InWidget) == 0x000000, "Member 'BP_GymExplorePlaylistDetails_C_ScaleButton::InWidget' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_ScaleButton, Hover) == 0x000008, "Member 'BP_GymExplorePlaylistDetails_C_ScaleButton::Hover' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_ScaleButton, Temp_bool_Variable) == 0x000009, "Member 'BP_GymExplorePlaylistDetails_C_ScaleButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_ScaleButton, Temp_struct_Variable) == 0x000010, "Member 'BP_GymExplorePlaylistDetails_C_ScaleButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_ScaleButton, Temp_struct_Variable_1) == 0x000020, "Member 'BP_GymExplorePlaylistDetails_C_ScaleButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_ScaleButton, K2Node_Select_Default) == 0x000030, "Member 'BP_GymExplorePlaylistDetails_C_ScaleButton::K2Node_Select_Default' has a wrong offset!");

// Function BP_GymExplorePlaylistDetails.BP_GymExplorePlaylistDetails_C.ConfirmReacted_Event
// 0x0001 (0x0001 - 0x0000)
struct BP_GymExplorePlaylistDetails_C_ConfirmReacted_Event final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExplorePlaylistDetails_C_ConfirmReacted_Event) == 0x000001, "Wrong alignment on BP_GymExplorePlaylistDetails_C_ConfirmReacted_Event");
static_assert(sizeof(BP_GymExplorePlaylistDetails_C_ConfirmReacted_Event) == 0x000001, "Wrong size on BP_GymExplorePlaylistDetails_C_ConfirmReacted_Event");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_ConfirmReacted_Event, Result) == 0x000000, "Member 'BP_GymExplorePlaylistDetails_C_ConfirmReacted_Event::Result' has a wrong offset!");

// Function BP_GymExplorePlaylistDetails.BP_GymExplorePlaylistDetails_C.PlaylistDeleted
// 0x0001 (0x0001 - 0x0000)
struct BP_GymExplorePlaylistDetails_C_PlaylistDeleted final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExplorePlaylistDetails_C_PlaylistDeleted) == 0x000001, "Wrong alignment on BP_GymExplorePlaylistDetails_C_PlaylistDeleted");
static_assert(sizeof(BP_GymExplorePlaylistDetails_C_PlaylistDeleted) == 0x000001, "Wrong size on BP_GymExplorePlaylistDetails_C_PlaylistDeleted");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_PlaylistDeleted, Success) == 0x000000, "Member 'BP_GymExplorePlaylistDetails_C_PlaylistDeleted::Success' has a wrong offset!");

// Function BP_GymExplorePlaylistDetails.BP_GymExplorePlaylistDetails_C.CustomEvent_0
// 0x0001 (0x0001 - 0x0000)
struct BP_GymExplorePlaylistDetails_C_CustomEvent_0 final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExplorePlaylistDetails_C_CustomEvent_0) == 0x000001, "Wrong alignment on BP_GymExplorePlaylistDetails_C_CustomEvent_0");
static_assert(sizeof(BP_GymExplorePlaylistDetails_C_CustomEvent_0) == 0x000001, "Wrong size on BP_GymExplorePlaylistDetails_C_CustomEvent_0");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_CustomEvent_0, Success) == 0x000000, "Member 'BP_GymExplorePlaylistDetails_C_CustomEvent_0::Success' has a wrong offset!");

// Function BP_GymExplorePlaylistDetails.BP_GymExplorePlaylistDetails_C.ExecuteUbergraph_BP_GymExplorePlaylistDetails
// 0x01C8 (0x01C8 - 0x0000)
struct BP_GymExplorePlaylistDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0030(0x0018)()
	bool                                          K2Node_CustomEvent_Result;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGymPlaylistDetailsResult              K2Node_MakeStruct_GymPlaylistDetailsResult;        // 0x0058(0x0060)()
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_1;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class UBP_ConfirmWidget_C*                    K2Node_DynamicCast_AsBP_Confirm_Widget;            // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0018)()
	bool                                          CallFunc_ShowConfirm_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array_1;                          // 0x0180(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_2;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymExplorePlaylistDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistDetails) == 0x000008, "Wrong alignment on BP_GymExplorePlaylistDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistDetails");
static_assert(sizeof(BP_GymExplorePlaylistDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistDetails) == 0x0001C8, "Wrong size on BP_GymExplorePlaylistDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistDetails");
static_assert(offsetof(BP_GymExplorePlaylistDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistDetails, EntryPoint) == 0x000000, "Member 'BP_GymExplorePlaylistDetails_C_ExecuteUbergraph_BP_GymExplorePlaylistDetails::EntryPoint' has a wrong offset!");
