#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymExploreDescription

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymExploreDescription.BP_GymExploreDescription_C
// 0x0038 (0x02F8 - 0x02C0)
class UBP_GymExploreDescription_C final : public UUserWidget
{
public:
	class UImage*                                 IconImage;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TitleRow;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x02D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class UTexture2D*                             TitleIcon;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AddElement(class UBP_GymExploreMapElement_C* Element);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymExploreDescription_C">();
	}
	static class UBP_GymExploreDescription_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymExploreDescription_C>();
	}
};
static_assert(alignof(UBP_GymExploreDescription_C) == 0x000008, "Wrong alignment on UBP_GymExploreDescription_C");
static_assert(sizeof(UBP_GymExploreDescription_C) == 0x0002F8, "Wrong size on UBP_GymExploreDescription_C");
static_assert(offsetof(UBP_GymExploreDescription_C, IconImage) == 0x0002C0, "Member 'UBP_GymExploreDescription_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreDescription_C, TextBlock) == 0x0002C8, "Member 'UBP_GymExploreDescription_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreDescription_C, TitleRow) == 0x0002D0, "Member 'UBP_GymExploreDescription_C::TitleRow' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreDescription_C, TitleText) == 0x0002D8, "Member 'UBP_GymExploreDescription_C::TitleText' has a wrong offset!");
static_assert(offsetof(UBP_GymExploreDescription_C, TitleIcon) == 0x0002F0, "Member 'UBP_GymExploreDescription_C::TitleIcon' has a wrong offset!");

}

