#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymMovieLoadingScreen1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "LoadingScreenTip_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_GymMovieLoadingScreen1.BP_GymMovieLoadingScreen1_C.ExecuteUbergraph_BP_GymMovieLoadingScreen1
// 0x02D8 (0x02D8 - 0x0000)
struct BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncTaskFetchImage*                   CallFunc_FetchImage_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      CallFunc_GetCachedImage_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuleDisplayInfo                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_URL;                            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture;                        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& URL, class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_URL_1;                          // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture_1;                      // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& URL, class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0138(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadingScreenTip                      CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0150(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_GetAssetByObjectPath_ReturnValue;         // 0x01B0(0x0068)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLastUsedTextureUri_ReturnValue;        // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetLastUsedTimestamp_ReturnValue;         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1) == 0x000008, "Wrong alignment on BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1");
static_assert(sizeof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1) == 0x0002D8, "Wrong size on BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, EntryPoint) == 0x000000, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000028, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_FetchImage_ReturnValue) == 0x000038, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_FetchImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetCachedImage_ReturnValue) == 0x000050, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetCachedImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_IsEmpty_ReturnValue) == 0x000059, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_SwitchString_CmpSuccess) == 0x00005A, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_IsEmpty_ReturnValue_1) == 0x00005B, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000078, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, Temp_byte_Variable) == 0x0000C1, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, Temp_string_Variable) == 0x0000C8, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, Temp_object_Variable) == 0x0000D8, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_CustomEvent_URL) == 0x0000E0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_CustomEvent_URL' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_CustomEvent_Texture) == 0x0000F0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_CustomEvent_URL_1) == 0x000108, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_CustomEvent_URL_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_CustomEvent_Texture_1) == 0x000118, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_CustomEvent_Texture_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_PlayAnimation_ReturnValue) == 0x000120, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000138, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, Temp_bool_Variable) == 0x000148, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000150, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000198, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_Add_IntInt_ReturnValue) == 0x00019C, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetAssetRegistry_ReturnValue) == 0x0001A0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetAssetRegistry_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetAssetByObjectPath_ReturnValue) == 0x0001B0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetAssetByObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, Temp_int_Variable) == 0x000218, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetAsset_ReturnValue) == 0x000220, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_DynamicCast_AsTexture_2D) == 0x000228, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_DynamicCast_bSuccess_1) == 0x000230, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000238, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, Temp_byte_Variable_1) == 0x000240, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_MakeLiteralString_ReturnValue) == 0x000248, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetLastUsedTextureUri_ReturnValue) == 0x000258, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetLastUsedTextureUri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_Select_Default) == 0x000268, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000269, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_GetLastUsedTimestamp_ReturnValue) == 0x000270, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_GetLastUsedTimestamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, K2Node_Event_IsDesignTime) == 0x000278, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000280, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000288, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_BooleanAND_ReturnValue) == 0x000289, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_BreakColor_R) == 0x00028C, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_BreakColor_G) == 0x000290, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_BreakColor_B) == 0x000294, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_BreakColor_A) == 0x000298, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_Conv_BoolToString_ReturnValue) == 0x0002A0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_MakeColor_ReturnValue) == 0x0002B0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_Concat_StrStr_ReturnValue) == 0x0002C0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1, CallFunc_PlayAnimation_ReturnValue_1) == 0x0002D0, "Member 'BP_GymMovieLoadingScreen1_C_ExecuteUbergraph_BP_GymMovieLoadingScreen1::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_GymMovieLoadingScreen1.BP_GymMovieLoadingScreen1_C.GetTip
// 0x0010 (0x0010 - 0x0000)
struct BP_GymMovieLoadingScreen1_C_GetTip final
{
public:
	TArray<class FText>                           PossibleTips;                                      // 0x0000(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(BP_GymMovieLoadingScreen1_C_GetTip) == 0x000008, "Wrong alignment on BP_GymMovieLoadingScreen1_C_GetTip");
static_assert(sizeof(BP_GymMovieLoadingScreen1_C_GetTip) == 0x000010, "Wrong size on BP_GymMovieLoadingScreen1_C_GetTip");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_GetTip, PossibleTips) == 0x000000, "Member 'BP_GymMovieLoadingScreen1_C_GetTip::PossibleTips' has a wrong offset!");

// Function BP_GymMovieLoadingScreen1.BP_GymMovieLoadingScreen1_C.OnFail_E9773FFD44823402320564B0D11FD0E4
// 0x0018 (0x0018 - 0x0000)
struct BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4 final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      Texture;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4) == 0x000008, "Wrong alignment on BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4");
static_assert(sizeof(BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4) == 0x000018, "Wrong size on BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4, URL) == 0x000000, "Member 'BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4::URL' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4, Texture) == 0x000010, "Member 'BP_GymMovieLoadingScreen1_C_OnFail_E9773FFD44823402320564B0D11FD0E4::Texture' has a wrong offset!");

// Function BP_GymMovieLoadingScreen1.BP_GymMovieLoadingScreen1_C.OnSuccess_E9773FFD44823402320564B0D11FD0E4
// 0x0018 (0x0018 - 0x0000)
struct BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4 final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      Texture;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4) == 0x000008, "Wrong alignment on BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4");
static_assert(sizeof(BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4) == 0x000018, "Wrong size on BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4, URL) == 0x000000, "Member 'BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4::URL' has a wrong offset!");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4, Texture) == 0x000010, "Member 'BP_GymMovieLoadingScreen1_C_OnSuccess_E9773FFD44823402320564B0D11FD0E4::Texture' has a wrong offset!");

// Function BP_GymMovieLoadingScreen1.BP_GymMovieLoadingScreen1_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_GymMovieLoadingScreen1_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GymMovieLoadingScreen1_C_PreConstruct) == 0x000001, "Wrong alignment on BP_GymMovieLoadingScreen1_C_PreConstruct");
static_assert(sizeof(BP_GymMovieLoadingScreen1_C_PreConstruct) == 0x000001, "Wrong size on BP_GymMovieLoadingScreen1_C_PreConstruct");
static_assert(offsetof(BP_GymMovieLoadingScreen1_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_GymMovieLoadingScreen1_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

