#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GymMovieLoadingScreen1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_GymMovieLoadingScreen1.BP_GymMovieLoadingScreen1_C
// 0x0088 (0x03C8 - 0x0340)
class UBP_GymMovieLoadingScreen1_C final : public UGymLoadingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DownloadedFadeIn;                                  // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CardOverlay;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GameMode;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   GameModeDescription;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_54;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_329;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageMain;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageMainDownloaded;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelName;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MapNameContainer;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TipsContainer;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   TipsText;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NewVar;                                            // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipFadeIn;                                        // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DesignTime;                                        // 0x03C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldPlayAnim;                                    // 0x03C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent();
	void ExecuteUbergraph_BP_GymMovieLoadingScreen1(int32 EntryPoint);
	void GetTip();
	void OnFail_E9773FFD44823402320564B0D11FD0E4(const class FString& URL, class UTexture2DDynamic* Texture);
	void OnSuccess_E9773FFD44823402320564B0D11FD0E4(const class FString& URL, class UTexture2DDynamic* Texture);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GymMovieLoadingScreen1_C">();
	}
	static class UBP_GymMovieLoadingScreen1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GymMovieLoadingScreen1_C>();
	}
};
static_assert(alignof(UBP_GymMovieLoadingScreen1_C) == 0x000008, "Wrong alignment on UBP_GymMovieLoadingScreen1_C");
static_assert(sizeof(UBP_GymMovieLoadingScreen1_C) == 0x0003C8, "Wrong size on UBP_GymMovieLoadingScreen1_C");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, UberGraphFrame) == 0x000340, "Member 'UBP_GymMovieLoadingScreen1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, DownloadedFadeIn) == 0x000348, "Member 'UBP_GymMovieLoadingScreen1_C::DownloadedFadeIn' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, CardOverlay) == 0x000350, "Member 'UBP_GymMovieLoadingScreen1_C::CardOverlay' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, CircularThrobber) == 0x000358, "Member 'UBP_GymMovieLoadingScreen1_C::CircularThrobber' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, GameMode) == 0x000360, "Member 'UBP_GymMovieLoadingScreen1_C::GameMode' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, GameModeDescription) == 0x000368, "Member 'UBP_GymMovieLoadingScreen1_C::GameModeDescription' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, GameModeIcon) == 0x000370, "Member 'UBP_GymMovieLoadingScreen1_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, Image_54) == 0x000378, "Member 'UBP_GymMovieLoadingScreen1_C::Image_54' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, Image_142) == 0x000380, "Member 'UBP_GymMovieLoadingScreen1_C::Image_142' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, Image_329) == 0x000388, "Member 'UBP_GymMovieLoadingScreen1_C::Image_329' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, ImageMain) == 0x000390, "Member 'UBP_GymMovieLoadingScreen1_C::ImageMain' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, ImageMainDownloaded) == 0x000398, "Member 'UBP_GymMovieLoadingScreen1_C::ImageMainDownloaded' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, LevelName) == 0x0003A0, "Member 'UBP_GymMovieLoadingScreen1_C::LevelName' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, MapNameContainer) == 0x0003A8, "Member 'UBP_GymMovieLoadingScreen1_C::MapNameContainer' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, TipsContainer) == 0x0003B0, "Member 'UBP_GymMovieLoadingScreen1_C::TipsContainer' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, TipsText) == 0x0003B8, "Member 'UBP_GymMovieLoadingScreen1_C::TipsText' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, NewVar) == 0x0003C0, "Member 'UBP_GymMovieLoadingScreen1_C::NewVar' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, SkipFadeIn) == 0x0003C4, "Member 'UBP_GymMovieLoadingScreen1_C::SkipFadeIn' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, DesignTime) == 0x0003C5, "Member 'UBP_GymMovieLoadingScreen1_C::DesignTime' has a wrong offset!");
static_assert(offsetof(UBP_GymMovieLoadingScreen1_C, ShouldPlayAnim) == 0x0003C6, "Member 'UBP_GymMovieLoadingScreen1_C::ShouldPlayAnim' has a wrong offset!");

}

