#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InfoPopup

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function BP_InfoPopup.BP_InfoPopup_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_InfoPopup_C_CustomEvent final
{
public:
	class FString                                 Message_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InfoPopup_C_CustomEvent) == 0x000008, "Wrong alignment on BP_InfoPopup_C_CustomEvent");
static_assert(sizeof(BP_InfoPopup_C_CustomEvent) == 0x000010, "Wrong size on BP_InfoPopup_C_CustomEvent");
static_assert(offsetof(BP_InfoPopup_C_CustomEvent, Message_0) == 0x000000, "Member 'BP_InfoPopup_C_CustomEvent::Message_0' has a wrong offset!");

// Function BP_InfoPopup.BP_InfoPopup_C.ExecuteUbergraph_BP_InfoPopup
// 0x00C8 (0x00C8 - 0x0000)
struct BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0018(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1; // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetCurrentFocusedWidget_ReturnValue;      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGymGuiGenericButton*                   K2Node_DynamicCast_AsGym_Gui_Generic_Button;       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup) == 0x000008, "Wrong alignment on BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup");
static_assert(sizeof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup) == 0x0000C8, "Wrong size on BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, EntryPoint) == 0x000000, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_IsValid_ReturnValue_2) == 0x000012, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_IsValid_ReturnValue_3) == 0x000013, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, K2Node_InputActionEvent_Key) == 0x000018, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_IsValid_ReturnValue_4) == 0x000031, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, K2Node_CustomEvent_Message) == 0x000040, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, K2Node_DynamicCast_AsGym_Player_Controller) == 0x000050, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000078, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_GetCurrentInputType_ReturnValue) == 0x000080, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000084, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_Conv_IntToByte_ReturnValue) == 0x000088, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00009C, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x00009D, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1) == 0x00009E, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_GetCurrentFocusedWidget_ReturnValue) == 0x0000A0, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_GetCurrentFocusedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, K2Node_DynamicCast_AsGym_Gui_Generic_Button) == 0x0000A8, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::K2Node_DynamicCast_AsGym_Gui_Generic_Button' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_IsValid_ReturnValue_5) == 0x0000B1, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B2, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000B3, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_HasUserFocus_ReturnValue) == 0x0000B4, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_HasUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_Not_PreBool_ReturnValue) == 0x0000B5, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_BooleanOR_ReturnValue) == 0x0000B6, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000B8, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000C0, "Member 'BP_InfoPopup_C_ExecuteUbergraph_BP_InfoPopup::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function BP_InfoPopup.BP_InfoPopup_C.InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_InfoPopup_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_InfoPopup_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_InfoPopup_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_InfoPopup_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_InfoPopup_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_InfoPopup_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_InfoPopup_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0::Key' has a wrong offset!");

}

