#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InfoPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InfoPopup.BP_InfoPopup_C
// 0x0040 (0x0378 - 0x0338)
class UBP_InfoPopup_C final : public UGymGuiGlobalMetaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PushAnim;                                          // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                AcceptButton;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Message;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget*                                LastFocusedWidget;                                 // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ConfirmWidget_AcceptButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_InfoPopup_AcceptButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_InfoPopup_AcceptButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BPClose();
	void BPOpen();
	void Construct();
	void CustomEvent(const class FString& Message_0);
	void ExecuteUbergraph_BP_InfoPopup(int32 EntryPoint);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0(const struct FKey& Key);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InfoPopup_C">();
	}
	static class UBP_InfoPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InfoPopup_C>();
	}
};
static_assert(alignof(UBP_InfoPopup_C) == 0x000008, "Wrong alignment on UBP_InfoPopup_C");
static_assert(sizeof(UBP_InfoPopup_C) == 0x000378, "Wrong size on UBP_InfoPopup_C");
static_assert(offsetof(UBP_InfoPopup_C, UberGraphFrame) == 0x000338, "Member 'UBP_InfoPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InfoPopup_C, PushAnim) == 0x000340, "Member 'UBP_InfoPopup_C::PushAnim' has a wrong offset!");
static_assert(offsetof(UBP_InfoPopup_C, HoverAnim) == 0x000348, "Member 'UBP_InfoPopup_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_InfoPopup_C, AcceptButton) == 0x000350, "Member 'UBP_InfoPopup_C::AcceptButton' has a wrong offset!");
static_assert(offsetof(UBP_InfoPopup_C, ContentBorder) == 0x000358, "Member 'UBP_InfoPopup_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UBP_InfoPopup_C, HoverBorder) == 0x000360, "Member 'UBP_InfoPopup_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UBP_InfoPopup_C, Message) == 0x000368, "Member 'UBP_InfoPopup_C::Message' has a wrong offset!");
static_assert(offsetof(UBP_InfoPopup_C, LastFocusedWidget) == 0x000370, "Member 'UBP_InfoPopup_C::LastFocusedWidget' has a wrong offset!");

}

