#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Leaderboard_Entry_Singleline

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Leaderboard_Entry_Singleline.BP_Leaderboard_Entry_Singleline_C.ExecuteUbergraph_BP_Leaderboard_Entry_Singleline
// 0x0060 (0x0060 - 0x0000)
struct BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FormatTime_ReturnValue;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0048(0x0018)()
};
static_assert(alignof(BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline) == 0x000008, "Wrong alignment on BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline");
static_assert(sizeof(BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline) == 0x000060, "Wrong size on BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline");
static_assert(offsetof(BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline, EntryPoint) == 0x000000, "Member 'BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline, CallFunc_FormatTime_ReturnValue) == 0x000008, "Member 'BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline::CallFunc_FormatTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000048, "Member 'BP_Leaderboard_Entry_Singleline_C_ExecuteUbergraph_BP_Leaderboard_Entry_Singleline::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

}

