#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Leaderboards

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_Leaderboards.BP_Leaderboards_C.ExecuteUbergraph_BP_Leaderboards
// 0x0120 (0x0120 - 0x0000)
struct BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Leaderboard_Entry_Singleline_C*     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGymLeaderboard                        K2Node_CustomEvent_Data;                           // 0x0018(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGymLeaderboardRow                     CallFunc_Array_Get_Item;                           // 0x0078(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiMainMenuWidget*                  CallFunc_GetMainMenu_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GymExploreMenu_C*                   K2Node_DynamicCast_AsBP_Gym_Explore_Menu;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiPauseMenu*                       CallFunc_GetPauseMenu_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards) == 0x000008, "Wrong alignment on BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards");
static_assert(sizeof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards) == 0x000120, "Wrong size on BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, EntryPoint) == 0x000000, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GetIsEnabled_ReturnValue) == 0x000004, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, K2Node_CustomEvent_Data) == 0x000018, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, K2Node_InputAxisEvent_AxisValue) == 0x000034, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Abs_ReturnValue) == 0x000048, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_FClamp_ReturnValue) == 0x000050, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GetChildrenCount_ReturnValue) == 0x00005C, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000064, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GetScrollOffset_ReturnValue) == 0x000068, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000070, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_FClamp_ReturnValue_1) == 0x0000A0, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_IsVisible_ReturnValue) == 0x0000B0, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, K2Node_DynamicCast_AsGym_Player_Controller) == 0x0000B8, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GetMainMenu_ReturnValue) == 0x0000C8, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GetMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, K2Node_DynamicCast_AsBP_Gym_Explore_Menu) == 0x0000D8, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::K2Node_DynamicCast_AsBP_Gym_Explore_Menu' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_IsOpen_ReturnValue) == 0x0000E1, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_IsVisible_ReturnValue_1) == 0x0000E2, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_GetPauseMenu_ReturnValue) == 0x0000E8, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_GetPauseMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_IsOpen_ReturnValue_1) == 0x0000F1, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_BooleanAND_ReturnValue) == 0x0000F2, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Abs_A_ImplicitCast) == 0x0000F8, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000100, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_FClamp_Max_ImplicitCast) == 0x000108, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000110, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000118, "Member 'BP_Leaderboards_C_ExecuteUbergraph_BP_Leaderboards::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function BP_Leaderboards.BP_Leaderboards_C.InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1
// 0x0004 (0x0004 - 0x0000)
struct BP_Leaderboards_C_InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Leaderboards_C_InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1) == 0x000004, "Wrong alignment on BP_Leaderboards_C_InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1");
static_assert(sizeof(BP_Leaderboards_C_InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1) == 0x000004, "Wrong size on BP_Leaderboards_C_InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1");
static_assert(offsetof(BP_Leaderboards_C_InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1, AxisValue) == 0x000000, "Member 'BP_Leaderboards_C_InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1::AxisValue' has a wrong offset!");

// Function BP_Leaderboards.BP_Leaderboards_C.SetData
// 0x0010 (0x0010 - 0x0000)
struct BP_Leaderboards_C_SetData final
{
public:
	struct FGymLeaderboard                        Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_Leaderboards_C_SetData) == 0x000008, "Wrong alignment on BP_Leaderboards_C_SetData");
static_assert(sizeof(BP_Leaderboards_C_SetData) == 0x000010, "Wrong size on BP_Leaderboards_C_SetData");
static_assert(offsetof(BP_Leaderboards_C_SetData, Data) == 0x000000, "Member 'BP_Leaderboards_C_SetData::Data' has a wrong offset!");

}

