#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LobbyKeyJoin

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function BP_LobbyKeyJoin.BP_LobbyKeyJoin_C.CancelFind
// 0x0001 (0x0001 - 0x0000)
struct BP_LobbyKeyJoin_C_CancelFind final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyKeyJoin_C_CancelFind) == 0x000001, "Wrong alignment on BP_LobbyKeyJoin_C_CancelFind");
static_assert(sizeof(BP_LobbyKeyJoin_C_CancelFind) == 0x000001, "Wrong size on BP_LobbyKeyJoin_C_CancelFind");
static_assert(offsetof(BP_LobbyKeyJoin_C_CancelFind, Success) == 0x000000, "Member 'BP_LobbyKeyJoin_C_CancelFind::Success' has a wrong offset!");

// Function BP_LobbyKeyJoin.BP_LobbyKeyJoin_C.ExecuteUbergraph_BP_LobbyKeyJoin
// 0x0278 (0x0278 - 0x0000)
struct BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryTravelToCurrentSession_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0070(0x0018)()
	TDelegate<void(TArray<struct FGymSessionSearchResult>& SessionResults, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGymSessionSearchFilters               K2Node_MakeStruct_GymSessionSearchFilters;         // 0x00A8(0x0020)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGymSessionSearchResult>        K2Node_CustomEvent_SessionResults;                 // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_Successful;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymSessionSearchResult                CallFunc_Array_Get_Item;                           // 0x00E8(0x0148)()
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_1;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0248(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin) == 0x000008, "Wrong alignment on BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin");
static_assert(sizeof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin) == 0x000278, "Wrong size on BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, EntryPoint) == 0x000000, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_TryTravelToCurrentSession_ReturnValue) == 0x000028, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_TryTravelToCurrentSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000030, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CustomEvent_InVisibility) == 0x000048, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x000050, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Array_Add_ReturnValue_1) == 0x000054, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Array_Add_ReturnValue_2) == 0x000058, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Array_Add_ReturnValue_3) == 0x00005C, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Array_Add_ReturnValue_4) == 0x000060, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Array_Add_ReturnValue_5) == 0x000064, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000068, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_GetText_ReturnValue) == 0x000070, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Conv_TextToString_ReturnValue) == 0x000098, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_MakeStruct_GymSessionSearchFilters) == 0x0000A8, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_MakeStruct_GymSessionSearchFilters' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_IsEmpty_ReturnValue) == 0x0000C8, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CustomEvent_SessionResults) == 0x0000D0, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CustomEvent_SessionResults' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CustomEvent_Successful) == 0x0000E0, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CustomEvent_Successful' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Array_IsEmpty_ReturnValue) == 0x000230, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_Not_PreBool_ReturnValue) == 0x000231, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000238, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CustomEvent_Success_1) == 0x000240, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CustomEvent_Success_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_InputActionEvent_Key) == 0x000248, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CustomEvent_Success) == 0x000260, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin, K2Node_CreateDelegate_OutputDelegate_3) == 0x000264, "Member 'BP_LobbyKeyJoin_C_ExecuteUbergraph_BP_LobbyKeyJoin::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BP_LobbyKeyJoin.BP_LobbyKeyJoin_C.InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_LobbyKeyJoin_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyKeyJoin_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_LobbyKeyJoin_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_LobbyKeyJoin_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_LobbyKeyJoin_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_LobbyKeyJoin_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_LobbyKeyJoin_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function BP_LobbyKeyJoin.BP_LobbyKeyJoin_C.JoinComplete
// 0x0001 (0x0001 - 0x0000)
struct BP_LobbyKeyJoin_C_JoinComplete final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyKeyJoin_C_JoinComplete) == 0x000001, "Wrong alignment on BP_LobbyKeyJoin_C_JoinComplete");
static_assert(sizeof(BP_LobbyKeyJoin_C_JoinComplete) == 0x000001, "Wrong size on BP_LobbyKeyJoin_C_JoinComplete");
static_assert(offsetof(BP_LobbyKeyJoin_C_JoinComplete, Success) == 0x000000, "Member 'BP_LobbyKeyJoin_C_JoinComplete::Success' has a wrong offset!");

// Function BP_LobbyKeyJoin.BP_LobbyKeyJoin_C.OnFindSessionsCompleteEvent_Event
// 0x0018 (0x0018 - 0x0000)
struct BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event final
{
public:
	TArray<struct FGymSessionSearchResult>        SessionResults;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Successful;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event) == 0x000008, "Wrong alignment on BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event");
static_assert(sizeof(BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event) == 0x000018, "Wrong size on BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event, SessionResults) == 0x000000, "Member 'BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event::SessionResults' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event, Successful) == 0x000010, "Member 'BP_LobbyKeyJoin_C_OnFindSessionsCompleteEvent_Event::Successful' has a wrong offset!");

// Function BP_LobbyKeyJoin.BP_LobbyKeyJoin_C.OnPreviewMouseButtonDown
// 0x0308 (0x0308 - 0x0000)
struct BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0220(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FakeClickHighlightedTextFieldGamepad_ReturnValue; // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B[0x5];                                      // 0x024B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0250(0x00B8)()
};
static_assert(alignof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown");
static_assert(sizeof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown) == 0x000308, "Wrong size on BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000220, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, CallFunc_FakeClickHighlightedTextFieldGamepad_ReturnValue) == 0x000239, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::CallFunc_FakeClickHighlightedTextFieldGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000240, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, CallFunc_GetCurrentInputType_ReturnValue) == 0x000248, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, K2Node_SwitchEnum_CmpSuccess) == 0x000249, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00024A, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000250, "Member 'BP_LobbyKeyJoin_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function BP_LobbyKeyJoin.BP_LobbyKeyJoin_C.OnVisibilityChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct BP_LobbyKeyJoin_C_OnVisibilityChanged_Event final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyKeyJoin_C_OnVisibilityChanged_Event) == 0x000001, "Wrong alignment on BP_LobbyKeyJoin_C_OnVisibilityChanged_Event");
static_assert(sizeof(BP_LobbyKeyJoin_C_OnVisibilityChanged_Event) == 0x000001, "Wrong size on BP_LobbyKeyJoin_C_OnVisibilityChanged_Event");
static_assert(offsetof(BP_LobbyKeyJoin_C_OnVisibilityChanged_Event, InVisibility) == 0x000000, "Member 'BP_LobbyKeyJoin_C_OnVisibilityChanged_Event::InVisibility' has a wrong offset!");

}

