#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Leaderboards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Leaderboards.BP_Leaderboards_C
// 0x0028 (0x02E8 - 0x02C0)
class UBP_Leaderboards_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Box;                                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_57;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        LastScroll;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Clear();
	void ExecuteUbergraph_BP_Leaderboards(int32 EntryPoint);
	void InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_1(float AxisValue);
	void SetData(const struct FGymLeaderboard& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Leaderboards_C">();
	}
	static class UBP_Leaderboards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Leaderboards_C>();
	}
};
static_assert(alignof(UBP_Leaderboards_C) == 0x000008, "Wrong alignment on UBP_Leaderboards_C");
static_assert(sizeof(UBP_Leaderboards_C) == 0x0002E8, "Wrong size on UBP_Leaderboards_C");
static_assert(offsetof(UBP_Leaderboards_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_Leaderboards_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Leaderboards_C, Box) == 0x0002C8, "Member 'UBP_Leaderboards_C::Box' has a wrong offset!");
static_assert(offsetof(UBP_Leaderboards_C, Image_57) == 0x0002D0, "Member 'UBP_Leaderboards_C::Image_57' has a wrong offset!");
static_assert(offsetof(UBP_Leaderboards_C, ScrollBox_0) == 0x0002D8, "Member 'UBP_Leaderboards_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UBP_Leaderboards_C, LastScroll) == 0x0002E0, "Member 'UBP_Leaderboards_C::LastScroll' has a wrong offset!");

}

