#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LobbyKeyJoin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_LobbyKeyJoin.BP_LobbyKeyJoin_C
// 0x0038 (0x02F8 - 0x02C0)
class UBP_LobbyKeyJoin_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_PlaymenuButton_Red_C*              CancelButton;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    Header;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       InvalidKeyNotification;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            JoinButton;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       NameField;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GymGuiMetaPopupHelper_C*           WBP_GymGuiMetaPopupHelper;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__BP_LobbyKeyJoin_CancelButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_LobbyKeyJoin_JoinButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void CancelFind(bool Success);
	void ExecuteUbergraph_BP_LobbyKeyJoin(int32 EntryPoint);
	void InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0(const struct FKey& Key);
	void JoinComplete(bool Success);
	void OnFindSessionsCompleteEvent_Event(const TArray<struct FGymSessionSearchResult>& SessionResults, bool Successful);
	void OnInitialized();
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnVisibilityChanged_Event(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LobbyKeyJoin_C">();
	}
	static class UBP_LobbyKeyJoin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LobbyKeyJoin_C>();
	}
};
static_assert(alignof(UBP_LobbyKeyJoin_C) == 0x000008, "Wrong alignment on UBP_LobbyKeyJoin_C");
static_assert(sizeof(UBP_LobbyKeyJoin_C) == 0x0002F8, "Wrong size on UBP_LobbyKeyJoin_C");
static_assert(offsetof(UBP_LobbyKeyJoin_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_LobbyKeyJoin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LobbyKeyJoin_C, CancelButton) == 0x0002C8, "Member 'UBP_LobbyKeyJoin_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UBP_LobbyKeyJoin_C, Header) == 0x0002D0, "Member 'UBP_LobbyKeyJoin_C::Header' has a wrong offset!");
static_assert(offsetof(UBP_LobbyKeyJoin_C, InvalidKeyNotification) == 0x0002D8, "Member 'UBP_LobbyKeyJoin_C::InvalidKeyNotification' has a wrong offset!");
static_assert(offsetof(UBP_LobbyKeyJoin_C, JoinButton) == 0x0002E0, "Member 'UBP_LobbyKeyJoin_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UBP_LobbyKeyJoin_C, NameField) == 0x0002E8, "Member 'UBP_LobbyKeyJoin_C::NameField' has a wrong offset!");
static_assert(offsetof(UBP_LobbyKeyJoin_C, WBP_GymGuiMetaPopupHelper) == 0x0002F0, "Member 'UBP_LobbyKeyJoin_C::WBP_GymGuiMetaPopupHelper' has a wrong offset!");

}

