#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MouseCursor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MouseCursor.BP_MouseCursor_C
// 0x0038 (0x02F8 - 0x02C0)
class UBP_MouseCursor_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               CursorSizeBox;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_20;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        DefaultScaleX;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultScaleY;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OriginalScale;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_MouseCursor(int32 EntryPoint);
	void OnSoftwareCursorScaleChanged(float NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MouseCursor_C">();
	}
	static class UBP_MouseCursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MouseCursor_C>();
	}
};
static_assert(alignof(UBP_MouseCursor_C) == 0x000008, "Wrong alignment on UBP_MouseCursor_C");
static_assert(sizeof(UBP_MouseCursor_C) == 0x0002F8, "Wrong size on UBP_MouseCursor_C");
static_assert(offsetof(UBP_MouseCursor_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_MouseCursor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MouseCursor_C, CursorSizeBox) == 0x0002C8, "Member 'UBP_MouseCursor_C::CursorSizeBox' has a wrong offset!");
static_assert(offsetof(UBP_MouseCursor_C, Image_20) == 0x0002D0, "Member 'UBP_MouseCursor_C::Image_20' has a wrong offset!");
static_assert(offsetof(UBP_MouseCursor_C, DefaultScaleX) == 0x0002D8, "Member 'UBP_MouseCursor_C::DefaultScaleX' has a wrong offset!");
static_assert(offsetof(UBP_MouseCursor_C, DefaultScaleY) == 0x0002E0, "Member 'UBP_MouseCursor_C::DefaultScaleY' has a wrong offset!");
static_assert(offsetof(UBP_MouseCursor_C, OriginalScale) == 0x0002E8, "Member 'UBP_MouseCursor_C::OriginalScale' has a wrong offset!");

}

