#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Multipliersingleline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Multipliersingleline.BP_Multipliersingleline_C
// 0x0038 (0x02F8 - 0x02C0)
class UBP_Multipliersingleline_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Multiplier;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MultiplierCategory;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymPlayerXPMultiplierRow              Data;                                              // 0x02D8(0x0020)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_BP_Multipliersingleline(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Multipliersingleline_C">();
	}
	static class UBP_Multipliersingleline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Multipliersingleline_C>();
	}
};
static_assert(alignof(UBP_Multipliersingleline_C) == 0x000008, "Wrong alignment on UBP_Multipliersingleline_C");
static_assert(sizeof(UBP_Multipliersingleline_C) == 0x0002F8, "Wrong size on UBP_Multipliersingleline_C");
static_assert(offsetof(UBP_Multipliersingleline_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_Multipliersingleline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Multipliersingleline_C, Multiplier) == 0x0002C8, "Member 'UBP_Multipliersingleline_C::Multiplier' has a wrong offset!");
static_assert(offsetof(UBP_Multipliersingleline_C, MultiplierCategory) == 0x0002D0, "Member 'UBP_Multipliersingleline_C::MultiplierCategory' has a wrong offset!");
static_assert(offsetof(UBP_Multipliersingleline_C, Data) == 0x0002D8, "Member 'UBP_Multipliersingleline_C::Data' has a wrong offset!");

}

