#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PauseMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PauseMenuWidget.BP_PauseMenuWidget_C
// 0x0288 (0x05D0 - 0x0348)
class UBP_PauseMenuWidget_C final : public UGymGuiPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           AdminMultiplayer_VBox;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GymExploreLevelSettings_C*          BP_GymExploreLevelSettings_PauseMenu;              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Leaderboards_C*                     BP_Leaderboards;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasLeaveToMenuOverlayWidget_C*      CanvasLeaveToMenuOverlayWidget;                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CardOverlay;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CompletedTaskText;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CreatorName;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExclamationIcon;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GameMode;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GameModeDesc;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GoalsContainer;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GoalsListContainer;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputActionUI;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LobbyVisibilityButton_C*           KeyEnableButton;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LobbyVisibilityButton_C*           KeyVisibilityButton;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Red_Horizontal_C*   LeaveButton;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               LevelDetails_WBox;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H1_C*                    LevelName;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LevelName_HBox;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       LevelSettingsButton;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LevelStuff;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LobbyKeyEnable_HBox;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LobbyKeyVisible_HBox;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LobbyVisibilityButton_C*           LobbyVisibilityButton;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LocationIcon;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MapId;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxplayersCount;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       RestartButton;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       SaveLevelButton;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       SettingsButton1;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       SettingsButton2;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         UnsavedChangesWarning_VisibilityBox;               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UserIcon;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UserIcon_1;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UserIcon_2;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Visibility_HBox;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LobbyKeyText_C*                    WBP_LobbyKeyText;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RemixOriginalCreatorTag_C*         WBP_RemixOriginalCreatorTag;                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FCustomLevelFileInfo                   CurrentLevelData;                                  // 0x0498(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGymMapDetailsResult                   MapDetails;                                        // 0x04F8(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWidget*                                CurrentHighlight;                                  // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DontTrustInput;                                    // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_PauseMenuWidget_KeyEnableButotn_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PauseMenuWidget_KeyVisibilityButton_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PauseMenuWidget_LeaveButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PauseMenuWidget_LevelSettingsButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PauseMenuWidget_RestartButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PauseMenuWidget_SaveLevelButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PauseMenuWidget_SettingsButton1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PauseMenuWidget_SettingsButton2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PauseMenuWidget_WBP_LobbyVisibilityButton_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BP_OnThumbnailUpdated(const class FString& LocalFilePath);
	void BPClose();
	void BPHighlightWidget(class UWidget* Widget);
	void BPOpen();
	void Construct();
	void CustomEvent(bool Success, const struct FGymMapDetailsResult& Details);
	void ExecuteUbergraph_BP_PauseMenuWidget(int32 EntryPoint);
	void GatherMapDetails();
	void GatherScoreboardData();
	void GetCareerHighlightWidgets(TArray<class UWidget*>* Array);
	void GetHighlightableWidgets(TArray<class UWidget*>* Widgets);
	void GetOnlineHighlighableWidgets(TArray<class UWidget*>* Widgets);
	void GetServerInfo(struct FGymServerInfo* Server_Info);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0(const struct FKey& Key);
	void LeaveToMainMenu(bool ConfirmClicked);
	void Navigate_To_Custom_Highlightable_Down(class UWidget* FromWidget, class UWidget** ToWidget);
	void Navigate_To_Custom_Highlightable_Left(class UWidget* FromWidget, class UWidget** ToWidget);
	void Navigate_To_Custom_Highlightable_Right(class UWidget* FromWidget, class UWBP_LobbyKeyText_C** ToWidget);
	void Navigate_To_Custom_Highlightable_Up(class UWidget* FromWidget, class UWidget** ToWidget);
	void Navigate_To_Custom_Highlightable_Widgets(class UWidget* FromWidget, EUINavDirection Direction, bool* Success);
	void OnControllerDisconnected();
	void OnEndSessionCompleteEvent(bool Success);
	void OnInitialized();
	void OnInvalidLevel();
	void OnLeaderboardReceived_Event(bool Success, const struct FGymLeaderboard& Leaderboard);
	void OnLevelSettingsClosed();
	void OnLevelSettingsNameChanged(const class FText& NewName);
	void OnLevelSettingsPlayClicked();
	void OnLevelSettingsPublishChanged(bool IsPublished);
	void OnLevelSettingsSaveLevelClicked();
	void OnLevelSettingsTakeThumbnailClicked();
	void OnMapSaved();
	void OpenLevelSettingsMenu();
	void PopulateCareerMenu();
	void PopulateGamemodeCard();
	void PopulateGoalMapTaskList();
	void PopulateRaceTaskList();
	void SetAdminVisibility();
	void ToggleKeyVisibility();
	void UpdateLevelInfo(const struct FCustomLevelFileInfo& LevelInfo);
	void UpdateServerInfo(const struct FGymServerInfo& ServerInfo);
	void UpdateSessionVisibility();
	void UpdateUseKey();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PauseMenuWidget_C">();
	}
	static class UBP_PauseMenuWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PauseMenuWidget_C>();
	}
};
static_assert(alignof(UBP_PauseMenuWidget_C) == 0x000008, "Wrong alignment on UBP_PauseMenuWidget_C");
static_assert(sizeof(UBP_PauseMenuWidget_C) == 0x0005D0, "Wrong size on UBP_PauseMenuWidget_C");
static_assert(offsetof(UBP_PauseMenuWidget_C, UberGraphFrame) == 0x000348, "Member 'UBP_PauseMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, AdminMultiplayer_VBox) == 0x000350, "Member 'UBP_PauseMenuWidget_C::AdminMultiplayer_VBox' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, BP_GymExploreLevelSettings_PauseMenu) == 0x000358, "Member 'UBP_PauseMenuWidget_C::BP_GymExploreLevelSettings_PauseMenu' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, BP_Leaderboards) == 0x000360, "Member 'UBP_PauseMenuWidget_C::BP_Leaderboards' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, CanvasLeaveToMenuOverlayWidget) == 0x000368, "Member 'UBP_PauseMenuWidget_C::CanvasLeaveToMenuOverlayWidget' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, CardOverlay) == 0x000370, "Member 'UBP_PauseMenuWidget_C::CardOverlay' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, CompletedTaskText) == 0x000378, "Member 'UBP_PauseMenuWidget_C::CompletedTaskText' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, CreatorName) == 0x000380, "Member 'UBP_PauseMenuWidget_C::CreatorName' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, ExclamationIcon) == 0x000388, "Member 'UBP_PauseMenuWidget_C::ExclamationIcon' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, GameMode) == 0x000390, "Member 'UBP_PauseMenuWidget_C::GameMode' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, GameModeDesc) == 0x000398, "Member 'UBP_PauseMenuWidget_C::GameModeDesc' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, GameModeIcon) == 0x0003A0, "Member 'UBP_PauseMenuWidget_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, GoalsContainer) == 0x0003A8, "Member 'UBP_PauseMenuWidget_C::GoalsContainer' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, GoalsListContainer) == 0x0003B0, "Member 'UBP_PauseMenuWidget_C::GoalsListContainer' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, Image_142) == 0x0003B8, "Member 'UBP_PauseMenuWidget_C::Image_142' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, InputActionUI) == 0x0003C0, "Member 'UBP_PauseMenuWidget_C::InputActionUI' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, KeyEnableButton) == 0x0003C8, "Member 'UBP_PauseMenuWidget_C::KeyEnableButton' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, KeyVisibilityButton) == 0x0003D0, "Member 'UBP_PauseMenuWidget_C::KeyVisibilityButton' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LeaveButton) == 0x0003D8, "Member 'UBP_PauseMenuWidget_C::LeaveButton' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LevelDetails_WBox) == 0x0003E0, "Member 'UBP_PauseMenuWidget_C::LevelDetails_WBox' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LevelName) == 0x0003E8, "Member 'UBP_PauseMenuWidget_C::LevelName' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LevelName_HBox) == 0x0003F0, "Member 'UBP_PauseMenuWidget_C::LevelName_HBox' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LevelSettingsButton) == 0x0003F8, "Member 'UBP_PauseMenuWidget_C::LevelSettingsButton' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LevelStuff) == 0x000400, "Member 'UBP_PauseMenuWidget_C::LevelStuff' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LobbyKeyEnable_HBox) == 0x000408, "Member 'UBP_PauseMenuWidget_C::LobbyKeyEnable_HBox' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LobbyKeyVisible_HBox) == 0x000410, "Member 'UBP_PauseMenuWidget_C::LobbyKeyVisible_HBox' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LobbyVisibilityButton) == 0x000418, "Member 'UBP_PauseMenuWidget_C::LobbyVisibilityButton' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, LocationIcon) == 0x000420, "Member 'UBP_PauseMenuWidget_C::LocationIcon' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, MapId) == 0x000428, "Member 'UBP_PauseMenuWidget_C::MapId' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, MaxplayersCount) == 0x000430, "Member 'UBP_PauseMenuWidget_C::MaxplayersCount' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, RestartButton) == 0x000438, "Member 'UBP_PauseMenuWidget_C::RestartButton' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, SaveLevelButton) == 0x000440, "Member 'UBP_PauseMenuWidget_C::SaveLevelButton' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, SettingsButton1) == 0x000448, "Member 'UBP_PauseMenuWidget_C::SettingsButton1' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, SettingsButton2) == 0x000450, "Member 'UBP_PauseMenuWidget_C::SettingsButton2' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, UnsavedChangesWarning_VisibilityBox) == 0x000458, "Member 'UBP_PauseMenuWidget_C::UnsavedChangesWarning_VisibilityBox' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, UserIcon) == 0x000460, "Member 'UBP_PauseMenuWidget_C::UserIcon' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, UserIcon_1) == 0x000468, "Member 'UBP_PauseMenuWidget_C::UserIcon_1' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, UserIcon_2) == 0x000470, "Member 'UBP_PauseMenuWidget_C::UserIcon_2' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, Visibility_HBox) == 0x000478, "Member 'UBP_PauseMenuWidget_C::Visibility_HBox' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, WBP_LobbyKeyText) == 0x000480, "Member 'UBP_PauseMenuWidget_C::WBP_LobbyKeyText' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, WBP_RemixOriginalCreatorTag) == 0x000488, "Member 'UBP_PauseMenuWidget_C::WBP_RemixOriginalCreatorTag' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, WidgetSwitcher) == 0x000490, "Member 'UBP_PauseMenuWidget_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, CurrentLevelData) == 0x000498, "Member 'UBP_PauseMenuWidget_C::CurrentLevelData' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, MapDetails) == 0x0004F8, "Member 'UBP_PauseMenuWidget_C::MapDetails' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, CurrentHighlight) == 0x0005C0, "Member 'UBP_PauseMenuWidget_C::CurrentHighlight' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenuWidget_C, DontTrustInput) == 0x0005C8, "Member 'UBP_PauseMenuWidget_C::DontTrustInput' has a wrong offset!");

}

