#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlaylistSearchEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PlaylistSearchEntryWidget.BP_PlaylistSearchEntryWidget_C
// 0x00B0 (0x0370 - 0x02C0)
class UBP_PlaylistSearchEntryWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AddPushAnim;                                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AddHoverAnim;                                      // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                AddButton;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_65;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_99;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MapCountField;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameField;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TournamentModeName;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                VisibilityHoverBorder;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymPlaylistSearchResult               Playlist;                                          // 0x0320(0x0038)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UBP_AddToPlaylistMenu_C*                ParentMenu;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 MapId;                                             // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AddedToPlaylist(bool Success);
	void BndEvt__BP_PlaylistSearchEntryWidget_AddButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_PlaylistSearchEntryWidget_AddButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_ServerEntryWidget_JoinButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_PlaylistSearchEntryWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlaylistSearchEntryWidget_C">();
	}
	static class UBP_PlaylistSearchEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlaylistSearchEntryWidget_C>();
	}
};
static_assert(alignof(UBP_PlaylistSearchEntryWidget_C) == 0x000008, "Wrong alignment on UBP_PlaylistSearchEntryWidget_C");
static_assert(sizeof(UBP_PlaylistSearchEntryWidget_C) == 0x000370, "Wrong size on UBP_PlaylistSearchEntryWidget_C");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_PlaylistSearchEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, AddPushAnim) == 0x0002C8, "Member 'UBP_PlaylistSearchEntryWidget_C::AddPushAnim' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, AddHoverAnim) == 0x0002D0, "Member 'UBP_PlaylistSearchEntryWidget_C::AddHoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, AddButton) == 0x0002D8, "Member 'UBP_PlaylistSearchEntryWidget_C::AddButton' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, ContentBorder) == 0x0002E0, "Member 'UBP_PlaylistSearchEntryWidget_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, Image) == 0x0002E8, "Member 'UBP_PlaylistSearchEntryWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, Image_65) == 0x0002F0, "Member 'UBP_PlaylistSearchEntryWidget_C::Image_65' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, Image_99) == 0x0002F8, "Member 'UBP_PlaylistSearchEntryWidget_C::Image_99' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, MapCountField) == 0x000300, "Member 'UBP_PlaylistSearchEntryWidget_C::MapCountField' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, NameField) == 0x000308, "Member 'UBP_PlaylistSearchEntryWidget_C::NameField' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, TournamentModeName) == 0x000310, "Member 'UBP_PlaylistSearchEntryWidget_C::TournamentModeName' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, VisibilityHoverBorder) == 0x000318, "Member 'UBP_PlaylistSearchEntryWidget_C::VisibilityHoverBorder' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, Playlist) == 0x000320, "Member 'UBP_PlaylistSearchEntryWidget_C::Playlist' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, ParentMenu) == 0x000358, "Member 'UBP_PlaylistSearchEntryWidget_C::ParentMenu' has a wrong offset!");
static_assert(offsetof(UBP_PlaylistSearchEntryWidget_C, MapId) == 0x000360, "Member 'UBP_PlaylistSearchEntryWidget_C::MapId' has a wrong offset!");

}

