#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PlayMenuWidget.BP_PlayMenuWidget_C
// 0x0100 (0x0478 - 0x0378)
class UBP_PlayMenuWidget_C final : public UGymGuiPlayMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_PlaymenuButton_Horizontal_C*       AllLevelsButton;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_FeaturedServerListWidget_C*         BP_FeaturedServerListWidget;                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasChallengeOverlayWidget_C*        CanvasChallengeOverlayWidget;                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPlayPartyWidget_C*               CanvasPlayPartyWidget;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayMenuFeaturedButton3_C*         Career_FeaturedButton;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    CareerText;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       CreateMarathonButton;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       CreateTournamentButton;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DemoSwitcher;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       DiscordButton;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButtonXL_DarkBlue_Horizontal_C* Explore_FeaturedButton;                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    Header_Style1_H2;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_184;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       JoinLobbyButton;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButtonXL_Green_Horizontal_C* MatchmakingButton;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  NDAButton;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    OnlineText;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayMenuFeaturedButton_C*          Royale_FeaturedButton;                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayMenuFeaturedButton3_C*         Spotlight_DemoButton;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayMenuFeaturedButton3_C*         Spotlight_FeaturedButton;                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    SpotlightText;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayMenuFeaturedButton_C*          Tournament_FeaturedButton;                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       TutorialButton;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UGymSaveGameTutorial*                   SaveFile;                                          // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 Daily1Id;                                          // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Daily2Id;                                          // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          FirstOpen;                                         // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TournamentList;                                    // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreatingFeatured;                                // 0x0472(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__BP_PlayMenuWidget_Career_FeaturedButton_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_CreateLobbyButton_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_CreateLobbyButton_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_Explore_FeaturedButton_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_JoinLobbyButton_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_MatchmakingButton_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_Royale_FeaturedButton_K2Node_ComponentBoundEvent_23_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_Spotlight_DemoButton_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_Spotlight_FeaturedButton_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_Tournament_FeaturedButton_K2Node_ComponentBoundEvent_26_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_PlayMenuWidget_TutorialButton_K2Node_ComponentBoundEvent_19_OnClicked__DelegateSignature();
	void BndEvt__CanvasPlayMenuWidget_DiscordButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();
	void BndEvt__CanvasPlayMenuWidget_NDAButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BPClose();
	void BPOpen();
	ESlateVisibility CareerCompletedVisibility();
	void Construct();
	void CreateRandomTournament(bool IsCreatingFeatured_0, const int32 Length);
	void CustomEvent(const TArray<struct FGymSessionSearchResult>& SessionResults, bool Successful);
	void CustomEvent_0(bool Success);
	void CustomEvent_2(bool Success, const class FString& PlaylistId);
	void Enable_Buttons(bool IsEnabled);
	void ExecuteUbergraph_BP_PlayMenuWidget(int32 EntryPoint);
	ESlateVisibility Get_button_private_grayout_Visibility();
	ESlateVisibility Get_button_public_grayout_Visibility();
	ESlateVisibility Get_LobbyStatusButtons_Visibility();
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0(const struct FKey& Key);
	void OnCreateGymServer(bool Success, const class FString& ConnectString);
	void OnCreateGymTutorial(bool Success, const class FString& Connect_String);
	void OnCreateSessionCompleteEvent_Event(bool Success);
	void OnDailyPlaylistsReceived_Event(bool Success, const TArray<struct FGymDailyPlaylist>& Playlists);
	void OnJoinServerRequestComplete_Event(bool Success, const class FString& JoinUrl);
	void OnRandomPlaylistReceived_Event(bool Success, const class FString& PlaylistId);
	void OnStartSessionCompleteEvent_Event(bool Success);
	void RandomPlaylistReceived(bool Success, const class FString& PlaylistId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayMenuWidget_C">();
	}
	static class UBP_PlayMenuWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayMenuWidget_C>();
	}
};
static_assert(alignof(UBP_PlayMenuWidget_C) == 0x000008, "Wrong alignment on UBP_PlayMenuWidget_C");
static_assert(sizeof(UBP_PlayMenuWidget_C) == 0x000478, "Wrong size on UBP_PlayMenuWidget_C");
static_assert(offsetof(UBP_PlayMenuWidget_C, UberGraphFrame) == 0x000378, "Member 'UBP_PlayMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, AllLevelsButton) == 0x000380, "Member 'UBP_PlayMenuWidget_C::AllLevelsButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, BP_FeaturedServerListWidget) == 0x000388, "Member 'UBP_PlayMenuWidget_C::BP_FeaturedServerListWidget' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, CanvasChallengeOverlayWidget) == 0x000390, "Member 'UBP_PlayMenuWidget_C::CanvasChallengeOverlayWidget' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, CanvasPlayPartyWidget) == 0x000398, "Member 'UBP_PlayMenuWidget_C::CanvasPlayPartyWidget' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Career_FeaturedButton) == 0x0003A0, "Member 'UBP_PlayMenuWidget_C::Career_FeaturedButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, CareerText) == 0x0003A8, "Member 'UBP_PlayMenuWidget_C::CareerText' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, CreateMarathonButton) == 0x0003B0, "Member 'UBP_PlayMenuWidget_C::CreateMarathonButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, CreateTournamentButton) == 0x0003B8, "Member 'UBP_PlayMenuWidget_C::CreateTournamentButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, DemoSwitcher) == 0x0003C0, "Member 'UBP_PlayMenuWidget_C::DemoSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, DiscordButton) == 0x0003C8, "Member 'UBP_PlayMenuWidget_C::DiscordButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Explore_FeaturedButton) == 0x0003D0, "Member 'UBP_PlayMenuWidget_C::Explore_FeaturedButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Header_Style1_H2) == 0x0003D8, "Member 'UBP_PlayMenuWidget_C::Header_Style1_H2' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Image_184) == 0x0003E0, "Member 'UBP_PlayMenuWidget_C::Image_184' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, JoinLobbyButton) == 0x0003E8, "Member 'UBP_PlayMenuWidget_C::JoinLobbyButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, MatchmakingButton) == 0x0003F0, "Member 'UBP_PlayMenuWidget_C::MatchmakingButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, NDAButton) == 0x0003F8, "Member 'UBP_PlayMenuWidget_C::NDAButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, OnlineText) == 0x000400, "Member 'UBP_PlayMenuWidget_C::OnlineText' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Royale_FeaturedButton) == 0x000408, "Member 'UBP_PlayMenuWidget_C::Royale_FeaturedButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Spotlight_DemoButton) == 0x000410, "Member 'UBP_PlayMenuWidget_C::Spotlight_DemoButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Spotlight_FeaturedButton) == 0x000418, "Member 'UBP_PlayMenuWidget_C::Spotlight_FeaturedButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, SpotlightText) == 0x000420, "Member 'UBP_PlayMenuWidget_C::SpotlightText' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Tournament_FeaturedButton) == 0x000428, "Member 'UBP_PlayMenuWidget_C::Tournament_FeaturedButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, TutorialButton) == 0x000430, "Member 'UBP_PlayMenuWidget_C::TutorialButton' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, HighlightableWidgets) == 0x000438, "Member 'UBP_PlayMenuWidget_C::HighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, SaveFile) == 0x000448, "Member 'UBP_PlayMenuWidget_C::SaveFile' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Daily1Id) == 0x000450, "Member 'UBP_PlayMenuWidget_C::Daily1Id' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, Daily2Id) == 0x000460, "Member 'UBP_PlayMenuWidget_C::Daily2Id' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, FirstOpen) == 0x000470, "Member 'UBP_PlayMenuWidget_C::FirstOpen' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, TournamentList) == 0x000471, "Member 'UBP_PlayMenuWidget_C::TournamentList' has a wrong offset!");
static_assert(offsetof(UBP_PlayMenuWidget_C, IsCreatingFeatured) == 0x000472, "Member 'UBP_PlayMenuWidget_C::IsCreatingFeatured' has a wrong offset!");

}

