#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PauseMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TaskData_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"
#include "TaskDataListStruct_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function BP_PauseMenuWidget.BP_PauseMenuWidget_C.BP_OnThumbnailUpdated
// 0x0010 (0x0010 - 0x0000)
struct BP_PauseMenuWidget_C_BP_OnThumbnailUpdated final
{
public:
	class FString                                 LocalFilePath;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PauseMenuWidget_C_BP_OnThumbnailUpdated) == 0x000008, "Wrong alignment on BP_PauseMenuWidget_C_BP_OnThumbnailUpdated");
static_assert(sizeof(BP_PauseMenuWidget_C_BP_OnThumbnailUpdated) == 0x000010, "Wrong size on BP_PauseMenuWidget_C_BP_OnThumbnailUpdated");
static_assert(offsetof(BP_PauseMenuWidget_C_BP_OnThumbnailUpdated, LocalFilePath) == 0x000000, "Member 'BP_PauseMenuWidget_C_BP_OnThumbnailUpdated::LocalFilePath' has a wrong offset!");

// Function BP_PauseMenuWidget.BP_PauseMenuWidget_C.BPHighlightWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_PauseMenuWidget_C_BPHighlightWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PauseMenuWidget_C_BPHighlightWidget) == 0x000008, "Wrong alignment on BP_PauseMenuWidget_C_BPHighlightWidget");
static_assert(sizeof(BP_PauseMenuWidget_C_BPHighlightWidget) == 0x000008, "Wrong size on BP_PauseMenuWidget_C_BPHighlightWidget");
static_assert(offsetof(BP_PauseMenuWidget_C_BPHighlightWidget, Widget) == 0x000000, "Member 'BP_PauseMenuWidget_C_BPHighlightWidget::Widget' has a wrong offset!");

// Function BP_PauseMenuWidget.BP_PauseMenuWidget_C.CustomEvent
// 0x00D0 (0x00D0 - 0x0000)
struct BP_PauseMenuWidget_C_CustomEvent final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymMapDetailsResult                   Details;                                           // 0x0008(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_PauseMenuWidget_C_CustomEvent) == 0x000008, "Wrong alignment on BP_PauseMenuWidget_C_CustomEvent");
static_assert(sizeof(BP_PauseMenuWidget_C_CustomEvent) == 0x0000D0, "Wrong size on BP_PauseMenuWidget_C_CustomEvent");
static_assert(offsetof(BP_PauseMenuWidget_C_CustomEvent, Success) == 0x000000, "Member 'BP_PauseMenuWidget_C_CustomEvent::Success' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_CustomEvent, Details) == 0x000008, "Member 'BP_PauseMenuWidget_C_CustomEvent::Details' has a wrong offset!");

// Function BP_PauseMenuWidget.BP_PauseMenuWidget_C.ExecuteUbergraph_BP_PauseMenuWidget
// 0x0728 (0x0728 - 0x0000)
struct BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool ConfirmClicked)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUseSessionKey_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSessionVisibility_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1; // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2; // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3; // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetHighlightableWidgets_Widgets;          // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetHighlightableWidgets_Widgets_1;        // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetHighlightableWidgets_Widgets_2;        // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetHighlightableWidgets_Widgets_3;        // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_3;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_1; // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_2; // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_3; // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText NewName)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidLevel_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomLevelFileInfo                   CallFunc_GetCurrentMapData_ReturnValue;            // 0x0138(0x0060)()
	bool                                          CallFunc_IsCareer_ReturnValue;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymLoadingScreenOptions               K2Node_MakeStruct_GymLoadingScreenOptions;         // 0x01A0(0x0058)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_2;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymMapDetailsResult                   K2Node_CustomEvent_Details;                        // 0x0218(0x00C8)()
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidLevel_ReturnValue_1;               // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCareerRace_ReturnValue;                 // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCareer_ReturnValue_1;                   // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCareerRace_ReturnValue_1;               // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE[0x2];                                      // 0x02EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymBaseGameMode*                       K2Node_DynamicCast_AsGym_Base_Game_Mode;           // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymRules*                              CallFunc_GetRuleInstance_ReturnValue;              // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_1;          // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCareerRules*                        K2Node_DynamicCast_AsGym_Career_Rules;             // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCareerName_ReturnValue;                // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FCustomLevelFileInfo                   K2Node_Event_LevelInfo;                            // 0x0348(0x0060)(ConstParm)
	struct FGymServerInfo                         CallFunc_GetServerInfo_Server_Info;                // 0x03A8(0x0158)()
	class UWidget*                                K2Node_Event_Widget;                               // 0x0500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasScoreboardWidget_C*              K2Node_DynamicCast_AsCanvas_Scoreboard_Widget;     // 0x0508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCareerRace_ReturnValue_2;               // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_1;                      // 0x0513(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymLeaderboard                        K2Node_CustomEvent_Leaderboard;                    // 0x0518(0x0010)()
	TDelegate<void(bool IsPublished)>             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0528(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0538(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success, const struct FGymLeaderboard& Leaderboard)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0550(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPublished;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewName;                        // 0x0568(0x0018)()
	bool                                          CallFunc_IsValidLevel_ReturnValue_2;               // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_LocalFilePath;                        // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidLevel_ReturnValue_3;               // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomLevelFileInfo                   CallFunc_GetCurrentMapData_ReturnValue_1;          // 0x05A0(0x0060)()
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0600(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0618(0x0018)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0640(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65A[0x6];                                      // 0x065A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0660(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x067D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidLevel_ReturnValue_4;               // 0x067E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x067F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ConfirmClicked;                 // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0688(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x0698(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x06A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x06A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x06A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x06B8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x06D0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x06E8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0700(0x0018)()
	TDelegate<void(bool Success, const struct FGymMapDetailsResult& Details)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0718(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget) == 0x000008, "Wrong alignment on BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget");
static_assert(sizeof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget) == 0x000728, "Wrong size on BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, EntryPoint) == 0x000000, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_InputActionEvent_Key) == 0x000008, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetCurrentInputType_ReturnValue) == 0x000028, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, Temp_int_Variable) == 0x000040, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Conv_IntToByte_ReturnValue) == 0x000044, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, Temp_byte_Variable) == 0x000045, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000046, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, Temp_byte_Variable_1) == 0x000047, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, Temp_bool_Variable) == 0x000058, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000060, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000078, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetUseSessionKey_ReturnValue) == 0x000080, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetUseSessionKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000081, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000088, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetSessionVisibility_ReturnValue) == 0x000090, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetSessionVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x000091, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000092, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1) == 0x000093, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2) == 0x000094, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3) == 0x000095, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000098, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4) == 0x0000A0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetHighlightableWidgets_Widgets) == 0x0000B0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetHighlightableWidgets_Widgets' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_AsGym_Player_Controller) == 0x0000C0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GamepadUINavigate_ReturnValue) == 0x0000C9, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetHighlightableWidgets_Widgets_1) == 0x0000D0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetHighlightableWidgets_Widgets_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetHighlightableWidgets_Widgets_2) == 0x0000E0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetHighlightableWidgets_Widgets_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x0000F0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GamepadUINavigate_ReturnValue_2) == 0x0000F1, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GamepadUINavigate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetHighlightableWidgets_Widgets_3) == 0x0000F8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetHighlightableWidgets_Widgets_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GamepadUINavigate_ReturnValue_3) == 0x000108, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GamepadUINavigate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success) == 0x000109, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_1) == 0x00010A, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_2) == 0x00010B, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_3) == 0x00010C, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Navigate_To_Custom_Highlightable_Widgets_Success_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x000110, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_4) == 0x000120, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsValidLevel_ReturnValue) == 0x000130, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsValidLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetCurrentMapData_ReturnValue) == 0x000138, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetCurrentMapData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsCareer_ReturnValue) == 0x000198, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsCareer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Not_PreBool_ReturnValue_2) == 0x000199, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_MakeStruct_GymLoadingScreenOptions) == 0x0001A0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_MakeStruct_GymLoadingScreenOptions' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001F8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameInstance_ReturnValue) == 0x000208, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CustomEvent_Success_2) == 0x000210, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CustomEvent_Success_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CustomEvent_Details) == 0x000218, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_AsGym_Game_Instance) == 0x0002E0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_bSuccess_1) == 0x0002E8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsValidLevel_ReturnValue_1) == 0x0002E9, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsValidLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsCareerRace_ReturnValue) == 0x0002EA, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsCareerRace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsCareer_ReturnValue_1) == 0x0002EB, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsCareer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Not_PreBool_ReturnValue_3) == 0x0002EC, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsCareerRace_ReturnValue_1) == 0x0002ED, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsCareerRace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameMode_ReturnValue) == 0x0002F0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_AsGym_Base_Game_Mode) == 0x0002F8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_AsGym_Base_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_bSuccess_2) == 0x000300, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameInstance_ReturnValue_1) == 0x000308, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetRuleInstance_ReturnValue) == 0x000310, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetRuleInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_AsGym_Game_Instance_1) == 0x000318, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_AsGym_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_bSuccess_3) == 0x000320, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_AsGym_Career_Rules) == 0x000328, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_AsGym_Career_Rules' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_bSuccess_4) == 0x000330, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetCareerName_ReturnValue) == 0x000338, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetCareerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_Event_LevelInfo) == 0x000348, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_Event_LevelInfo' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetServerInfo_Server_Info) == 0x0003A8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetServerInfo_Server_Info' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_Event_Widget) == 0x000500, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_AsCanvas_Scoreboard_Widget) == 0x000508, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_AsCanvas_Scoreboard_Widget' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_bSuccess_5) == 0x000510, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsCareerRace_ReturnValue_2) == 0x000511, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsCareerRace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsValid_ReturnValue) == 0x000512, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CustomEvent_Success_1) == 0x000513, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CustomEvent_Success_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CustomEvent_Leaderboard) == 0x000518, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CustomEvent_Leaderboard' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_6) == 0x000528, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_7) == 0x000538, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000548, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_8) == 0x000550, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CustomEvent_IsPublished) == 0x000560, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CustomEvent_IsPublished' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CustomEvent_NewName) == 0x000568, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CustomEvent_NewName' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsValidLevel_ReturnValue_2) == 0x000580, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsValidLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_Event_LocalFilePath) == 0x000588, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_Event_LocalFilePath' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsValidLevel_ReturnValue_3) == 0x000598, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsValidLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetCurrentMapData_ReturnValue_1) == 0x0005A0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetCurrentMapData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_InputActionEvent_Key_3) == 0x000600, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_InputActionEvent_Key_4) == 0x000618, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000630, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000638, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_InputActionEvent_Key_1) == 0x000640, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsOpen_ReturnValue) == 0x000658, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_BooleanAND_ReturnValue) == 0x000659, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_InputActionEvent_Key_2) == 0x000660, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000678, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_Select_Default) == 0x00067C, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, Temp_byte_Variable_2) == 0x00067D, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsValidLevel_ReturnValue_4) == 0x00067E, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsValidLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_IsVisible_ReturnValue) == 0x00067F, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CustomEvent_ConfirmClicked) == 0x000680, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CustomEvent_ConfirmClicked' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_Select_Default_1) == 0x000688, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, Temp_byte_Variable_3) == 0x000690, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_AsUser_Widget) == 0x000698, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_DynamicCast_bSuccess_6) == 0x0006A0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, Temp_bool_Variable_1) == 0x0006A1, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CustomEvent_Success) == 0x0006A2, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_Select_Default_2) == 0x0006A3, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Conv_IntToString_ReturnValue) == 0x0006A8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x0006B8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0006D0, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0006E8, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000700, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget, K2Node_CreateDelegate_OutputDelegate_9) == 0x000718, "Member 'BP_PauseMenuWidget_C_ExecuteUbergraph_BP_PauseMenuWidget::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");

// Function BP_PauseMenuWidget.BP_PauseMenuWidget_C.GetCareerHighlightWidgets
// 0x0020 (0x0020 - 0x0000)
struct BP_PauseMenuWidget_C_GetCareerHighlightWidgets final
{
public:
	TArray<class UWidget*>                        Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_PauseMenuWidget_C_GetCareerHighlightWidgets) == 0x000008, "Wrong alignment on BP_PauseMenuWidget_C_GetCareerHighlightWidgets");
static_assert(sizeof(BP_PauseMenuWidget_C_GetCareerHighlightWidgets) == 0x000020, "Wrong size on BP_PauseMenuWidget_C_GetCareerHighlightWidgets");
static_assert(offsetof(BP_PauseMenuWidget_C_GetCareerHighlightWidgets, Array) == 0x000000, "Member 'BP_PauseMenuWidget_C_GetCareerHighlightWidgets::Array' has a wrong offset!");
static_assert(offsetof(BP_PauseMenuWidget_C_GetCareerHighlightWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_PauseMenuWidget_C_GetCareerHighlightWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_PauseMenuWidget.BP_PauseMenuWidget_C.GetHighlightableWidgets
// 0x0038 (0x0038 - 0x0000)
struct BP_PauseMenuWidget_C_GetHighlightableWidgets final
{
public:
	TArray<class UWidget*>                        Widgets;                                           // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetOnlineHighlighableWidgets_Widgets;     // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetCareerHighlightWidgets_Array;          // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsCareer_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PauseMenuWidget_C_GetHighlightableWidgets) == 0x000008, "Wrong alignment on BP_PauseMenuWidget_C_GetHighlightableWidgets");
static_assert(sizeof(BP_PauseMenuWidget_C_GetHighlightableWidgets) == 0x000038, "Wrong size on BP_PauseMenuWidget_C_GetHighlightableWidgets");
