#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayMenuWidget

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_BP_FeaturedServerListWidget_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'BP_PlayMenuWidget_C_BndEvt__BP_PlayMenuWidget_CanvasLobbyListWidget_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.CareerCompletedVisibility
// 0x0007 (0x0007 - 0x0000)
struct BP_PlayMenuWidget_C_CareerCompletedVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedLevel_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_CareerCompletedVisibility) == 0x000001, "Wrong alignment on BP_PlayMenuWidget_C_CareerCompletedVisibility");
static_assert(sizeof(BP_PlayMenuWidget_C_CareerCompletedVisibility) == 0x000007, "Wrong size on BP_PlayMenuWidget_C_CareerCompletedVisibility");
static_assert(offsetof(BP_PlayMenuWidget_C_CareerCompletedVisibility, ReturnValue) == 0x000000, "Member 'BP_PlayMenuWidget_C_CareerCompletedVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CareerCompletedVisibility, Temp_bool_Variable) == 0x000001, "Member 'BP_PlayMenuWidget_C_CareerCompletedVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CareerCompletedVisibility, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_PlayMenuWidget_C_CareerCompletedVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CareerCompletedVisibility, CallFunc_HasCompletedLevel_ReturnValue) == 0x000003, "Member 'BP_PlayMenuWidget_C_CareerCompletedVisibility::CallFunc_HasCompletedLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CareerCompletedVisibility, Temp_byte_Variable) == 0x000004, "Member 'BP_PlayMenuWidget_C_CareerCompletedVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CareerCompletedVisibility, Temp_byte_Variable_1) == 0x000005, "Member 'BP_PlayMenuWidget_C_CareerCompletedVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CareerCompletedVisibility, K2Node_Select_Default) == 0x000006, "Member 'BP_PlayMenuWidget_C_CareerCompletedVisibility::K2Node_Select_Default' has a wrong offset!");

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.CreateRandomTournament
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayMenuWidget_C_CreateRandomTournament final
{
public:
	bool                                          IsCreatingFeatured_0;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Length;                                            // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_CreateRandomTournament) == 0x000004, "Wrong alignment on BP_PlayMenuWidget_C_CreateRandomTournament");
static_assert(sizeof(BP_PlayMenuWidget_C_CreateRandomTournament) == 0x000008, "Wrong size on BP_PlayMenuWidget_C_CreateRandomTournament");
static_assert(offsetof(BP_PlayMenuWidget_C_CreateRandomTournament, IsCreatingFeatured_0) == 0x000000, "Member 'BP_PlayMenuWidget_C_CreateRandomTournament::IsCreatingFeatured_0' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CreateRandomTournament, Length) == 0x000004, "Member 'BP_PlayMenuWidget_C_CreateRandomTournament::Length' has a wrong offset!");

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.CustomEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayMenuWidget_C_CustomEvent final
{
public:
	TArray<struct FGymSessionSearchResult>        SessionResults;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Successful;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_CustomEvent) == 0x000008, "Wrong alignment on BP_PlayMenuWidget_C_CustomEvent");
static_assert(sizeof(BP_PlayMenuWidget_C_CustomEvent) == 0x000018, "Wrong size on BP_PlayMenuWidget_C_CustomEvent");
static_assert(offsetof(BP_PlayMenuWidget_C_CustomEvent, SessionResults) == 0x000000, "Member 'BP_PlayMenuWidget_C_CustomEvent::SessionResults' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CustomEvent, Successful) == 0x000010, "Member 'BP_PlayMenuWidget_C_CustomEvent::Successful' has a wrong offset!");

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.CustomEvent_0
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayMenuWidget_C_CustomEvent_0 final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_CustomEvent_0) == 0x000001, "Wrong alignment on BP_PlayMenuWidget_C_CustomEvent_0");
static_assert(sizeof(BP_PlayMenuWidget_C_CustomEvent_0) == 0x000001, "Wrong size on BP_PlayMenuWidget_C_CustomEvent_0");
static_assert(offsetof(BP_PlayMenuWidget_C_CustomEvent_0, Success) == 0x000000, "Member 'BP_PlayMenuWidget_C_CustomEvent_0::Success' has a wrong offset!");

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.CustomEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayMenuWidget_C_CustomEvent_2 final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlaylistId;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_CustomEvent_2) == 0x000008, "Wrong alignment on BP_PlayMenuWidget_C_CustomEvent_2");
static_assert(sizeof(BP_PlayMenuWidget_C_CustomEvent_2) == 0x000018, "Wrong size on BP_PlayMenuWidget_C_CustomEvent_2");
static_assert(offsetof(BP_PlayMenuWidget_C_CustomEvent_2, Success) == 0x000000, "Member 'BP_PlayMenuWidget_C_CustomEvent_2::Success' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_CustomEvent_2, PlaylistId) == 0x000008, "Member 'BP_PlayMenuWidget_C_CustomEvent_2::PlaylistId' has a wrong offset!");

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.Enable Buttons
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayMenuWidget_C_Enable_Buttons final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_Enable_Buttons) == 0x000001, "Wrong alignment on BP_PlayMenuWidget_C_Enable_Buttons");
static_assert(sizeof(BP_PlayMenuWidget_C_Enable_Buttons) == 0x000001, "Wrong size on BP_PlayMenuWidget_C_Enable_Buttons");
static_assert(offsetof(BP_PlayMenuWidget_C_Enable_Buttons, IsEnabled) == 0x000000, "Member 'BP_PlayMenuWidget_C_Enable_Buttons::IsEnabled' has a wrong offset!");

// Function BP_PlayMenuWidget.BP_PlayMenuWidget_C.ExecuteUbergraph_BP_PlayMenuWidget
// 0x05A8 (0x05A8 - 0x0000)
struct BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FGymSessionSearchResult>& SessionResults, bool Successful)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0028(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0040(0x0018)(HasGetValueTypeHash)
	TDelegate<void(bool Success, const class FString& PlaylistId)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0080(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_TryTravelToCurrentSession_ReturnValue;    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x00A0(0x0018)(HasGetValueTypeHash)
	class UGymSaveGameTutorial*                   CallFunc_GetSaveFile_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_9;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Connect_String;                 // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_8;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGymDailyPlaylist>              K2Node_CustomEvent_Playlists;                      // 0x0100(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_1;          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_7;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlaylistId_2;                   // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0178(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGymDailyPlaylist                      CallFunc_Array_Get_Item;                           // 0x0210(0x0028)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_3;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiMainMenuWidget*                  CallFunc_GetMainMenu_ReturnValue;                  // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller_1;      // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiMainMenuWidget*                  CallFunc_GetMainMenu_ReturnValue_1;                // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetHighlightableWidgets_Widgets;          // 0x0288(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility_1;         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_4;                     // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_6;                      // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_JoinUrl;                        // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_3;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_5;                     // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_4;            // 0x02C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x02E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_6;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_5;                      // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ConnectString;                  // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success, const class FString& ConnectString)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0318(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_4;                      // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlaylistId_1;                   // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0350(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0368(0x0050)(HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03C0(0x0010)(ReferenceParm)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_2;          // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_3;          // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDemo_ReturnValue;                       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x2];                                      // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_436[0x2];                                      // 0x0436(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x043D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x043E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_3;          // 0x043F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymGuiMainMenuWidget*                  K2Node_DynamicCast_AsGym_Gui_Main_Menu_Widget;     // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array_2;                          // 0x0450(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(bool Success, const class FString& JoinUrl)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0460(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_3;                      // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_2;                      // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0488(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0490(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGymSessionSearchResult>        K2Node_CustomEvent_SessionResults;                 // 0x0498(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_Successful;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x04C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0510(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0520(0x0018)()
	bool                                          K2Node_CustomEvent_Success_1;                      // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlaylistId;                     // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsCreatingFeatured;             // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Length;                         // 0x055C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_4;          // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A[0x6];                                      // 0x056A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGymSessionSearchFilters               K2Node_MakeStruct_GymSessionSearchFilters;         // 0x0580(0x0020)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x05A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget) == 0x000008, "Wrong alignment on BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget");
static_assert(sizeof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget) == 0x0005A8, "Wrong size on BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, EntryPoint) == 0x000000, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_InputActionEvent_Key_3) == 0x000028, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_InputActionEvent_Key_2) == 0x000040, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000078, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_InputActionEvent_Key_1) == 0x000080, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_TryTravelToCurrentSession_ReturnValue) == 0x000098, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_TryTravelToCurrentSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_InputActionEvent_Key) == 0x0000A0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetSaveFile_ReturnValue) == 0x0000B8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetSaveFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetGameInstance_ReturnValue) == 0x0000C8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_IsOpen_ReturnValue) == 0x0000D0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_AsGym_Game_Instance) == 0x0000D8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_Success_9) == 0x0000E1, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_Success_9' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_Connect_String) == 0x0000E8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_Connect_String' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_IsVisible_ReturnValue) == 0x0000F8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_Success_8) == 0x0000F9, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_Success_8' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_Playlists) == 0x000100, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_Playlists' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_IsOpen_ReturnValue_1) == 0x000114, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetGameInstance_ReturnValue_1) == 0x000118, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_AsGym_Game_Instance_1) == 0x000120, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_AsGym_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000130, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetPlayerName_ReturnValue) == 0x000138, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_Success_7) == 0x000148, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_Success_7' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_PlaylistId_2) == 0x000150, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_PlaylistId_2' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000160, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000178, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_IsOpen_ReturnValue_2) == 0x0001C8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_IsOpen_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_MakeArray_Array) == 0x0001D0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_Format_ReturnValue) == 0x0001E0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, Temp_int_Array_Index_Variable) == 0x0001F8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000200, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_Array_Get_Item) == 0x000210, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000238, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000240, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_IsOpen_ReturnValue_3) == 0x000248, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_IsOpen_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_AsGym_Player_Controller) == 0x000250, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_bSuccess_2) == 0x000258, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetMainMenu_ReturnValue) == 0x000260, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetPlayerController_ReturnValue_1) == 0x000268, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_AsGym_Player_Controller_1) == 0x000270, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_AsGym_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_bSuccess_3) == 0x000278, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetMainMenu_ReturnValue_1) == 0x000280, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetMainMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetHighlightableWidgets_Widgets) == 0x000288, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetHighlightableWidgets_Widgets' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_ComponentBoundEvent_InVisibility_1) == 0x000298, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_ComponentBoundEvent_InVisibility_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000299, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_IsOpen_ReturnValue_4) == 0x00029A, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_IsOpen_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_ComponentBoundEvent_InVisibility) == 0x00029B, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x00029C, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_Success_6) == 0x00029D, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_Success_6' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_JoinUrl) == 0x0002A0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_JoinUrl' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002B0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, Temp_bool_True_if_break_was_hit_Variable) == 0x0002C0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_IsOpen_ReturnValue_5) == 0x0002C1, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_IsOpen_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_Not_PreBool_ReturnValue) == 0x0002C2, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002C4, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0002D8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_InputActionEvent_Key_4) == 0x0002E0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_IsOpen_ReturnValue_6) == 0x0002F8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_IsOpen_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_Success_5) == 0x0002F9, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_Success_5' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_ConnectString) == 0x000300, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_ConnectString' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000310, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CreateDelegate_OutputDelegate_5) == 0x000318, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetPlayerName_ReturnValue_1) == 0x000328, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetPlayerName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_Success_4) == 0x000338, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_Success_4' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_CustomEvent_PlaylistId_1) == 0x000340, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_CustomEvent_PlaylistId_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000350, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x000368, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, CallFunc_GetGameInstance_ReturnValue_2) == 0x0003B8, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_MakeArray_Array_1) == 0x0003C0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget, K2Node_DynamicCast_AsGym_Game_Instance_2) == 0x0003D0, "Member 'BP_PlayMenuWidget_C_ExecuteUbergraph_BP_PlayMenuWidget::K2Node_DynamicCast_AsGym_Game_Instance_2' has a wrong offset!");
