#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReportWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ReportWidget.BP_ReportWidget_C
// 0x0090 (0x03D8 - 0x0348)
class UBP_ReportWidget_C final : public UGymGuiConfirmWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DeclinePushAnim;                                   // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DeclineHoverAnim;                                  // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AcceptPushAnim;                                    // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AcceptHoverAnim;                                   // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                AcceptButton;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AcceptText;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder_1;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DeclineButton;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DeclineText;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder_1;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Message;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              TextBox;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GymGuiMetaPopupHelper_C*           WBP_GymGuiMetaPopupHelper;                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsOpen_0;                                          // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                PreviousFocusedWidget;                             // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ConfirmWidget_AcceptButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_ConfirmWidget_AcceptButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_ConfirmWidget_AcceptButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_ConfirmWidget_DeclineButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_ConfirmWidget_DeclineButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_ConfirmWidget_DeclineButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void CustomEvent(bool Success);
	void ExecuteUbergraph_BP_ReportWidget(int32 EntryPoint);
	ESlateVisibility GetVisibility_0();
	void InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5(const struct FKey& Key);
	void Show(const class FString& MapId);
	bool ShowConfirm(const class FText& Message_0, const class FText& AcceptMessage, const class FText& DeclineMessage);

	bool IsConfirmOpen() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReportWidget_C">();
	}
	static class UBP_ReportWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ReportWidget_C>();
	}
};
static_assert(alignof(UBP_ReportWidget_C) == 0x000008, "Wrong alignment on UBP_ReportWidget_C");
static_assert(sizeof(UBP_ReportWidget_C) == 0x0003D8, "Wrong size on UBP_ReportWidget_C");
static_assert(offsetof(UBP_ReportWidget_C, UberGraphFrame) == 0x000348, "Member 'UBP_ReportWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, DeclinePushAnim) == 0x000350, "Member 'UBP_ReportWidget_C::DeclinePushAnim' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, DeclineHoverAnim) == 0x000358, "Member 'UBP_ReportWidget_C::DeclineHoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, AcceptPushAnim) == 0x000360, "Member 'UBP_ReportWidget_C::AcceptPushAnim' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, AcceptHoverAnim) == 0x000368, "Member 'UBP_ReportWidget_C::AcceptHoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, AcceptButton) == 0x000370, "Member 'UBP_ReportWidget_C::AcceptButton' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, AcceptText) == 0x000378, "Member 'UBP_ReportWidget_C::AcceptText' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, ContentBorder) == 0x000380, "Member 'UBP_ReportWidget_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, ContentBorder_1) == 0x000388, "Member 'UBP_ReportWidget_C::ContentBorder_1' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, DeclineButton) == 0x000390, "Member 'UBP_ReportWidget_C::DeclineButton' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, DeclineText) == 0x000398, "Member 'UBP_ReportWidget_C::DeclineText' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, HoverBorder) == 0x0003A0, "Member 'UBP_ReportWidget_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, HoverBorder_1) == 0x0003A8, "Member 'UBP_ReportWidget_C::HoverBorder_1' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, Message) == 0x0003B0, "Member 'UBP_ReportWidget_C::Message' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, TextBox) == 0x0003B8, "Member 'UBP_ReportWidget_C::TextBox' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, WBP_GymGuiMetaPopupHelper) == 0x0003C0, "Member 'UBP_ReportWidget_C::WBP_GymGuiMetaPopupHelper' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, IsOpen_0) == 0x0003C8, "Member 'UBP_ReportWidget_C::IsOpen_0' has a wrong offset!");
static_assert(offsetof(UBP_ReportWidget_C, PreviousFocusedWidget) == 0x0003D0, "Member 'UBP_ReportWidget_C::PreviousFocusedWidget' has a wrong offset!");

}

