#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RegionOptionFactory

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RegionOptionFactory.BP_RegionOptionFactory_C.RegionStringToText
// 0x0048 (0x0048 - 0x0000)
struct BP_RegionOptionFactory_C_RegionStringToText final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RegionOptionFactory_C_RegionStringToText) == 0x000008, "Wrong alignment on BP_RegionOptionFactory_C_RegionStringToText");
static_assert(sizeof(BP_RegionOptionFactory_C_RegionStringToText) == 0x000048, "Wrong size on BP_RegionOptionFactory_C_RegionStringToText");
static_assert(offsetof(BP_RegionOptionFactory_C_RegionStringToText, String) == 0x000000, "Member 'BP_RegionOptionFactory_C_RegionStringToText::String' has a wrong offset!");
static_assert(offsetof(BP_RegionOptionFactory_C_RegionStringToText, ReturnValue) == 0x000010, "Member 'BP_RegionOptionFactory_C_RegionStringToText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RegionOptionFactory_C_RegionStringToText, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_RegionOptionFactory_C_RegionStringToText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RegionOptionFactory_C_RegionStringToText, K2Node_SwitchString_CmpSuccess) == 0x000040, "Member 'BP_RegionOptionFactory_C_RegionStringToText::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

