#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ServerEntryWidget2

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ServerEntryWidget2.BP_ServerEntryWidget2_C
// 0x01A8 (0x0468 - 0x02C0)
class UBP_ServerEntryWidget2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ColumnDisplayName;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ColumnMapName;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ColumnPlayerCount;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_135;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            JoinButton;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MapIcon;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PingText;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymSessionSearchResult                Server;                                            // 0x0308(0x0148)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   NewVar;                                            // 0x0450(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__BP_ServerEntryWidget2_JoinButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void Construct();
	void CustomEvent(bool Success);
	void ExecuteUbergraph_BP_ServerEntryWidget2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ServerEntryWidget2_C">();
	}
	static class UBP_ServerEntryWidget2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ServerEntryWidget2_C>();
	}
};
static_assert(alignof(UBP_ServerEntryWidget2_C) == 0x000008, "Wrong alignment on UBP_ServerEntryWidget2_C");
static_assert(sizeof(UBP_ServerEntryWidget2_C) == 0x000468, "Wrong size on UBP_ServerEntryWidget2_C");
static_assert(offsetof(UBP_ServerEntryWidget2_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_ServerEntryWidget2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, Background) == 0x0002C8, "Member 'UBP_ServerEntryWidget2_C::Background' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, ColumnDisplayName) == 0x0002D0, "Member 'UBP_ServerEntryWidget2_C::ColumnDisplayName' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, ColumnMapName) == 0x0002D8, "Member 'UBP_ServerEntryWidget2_C::ColumnMapName' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, ColumnPlayerCount) == 0x0002E0, "Member 'UBP_ServerEntryWidget2_C::ColumnPlayerCount' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, Image_135) == 0x0002E8, "Member 'UBP_ServerEntryWidget2_C::Image_135' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, JoinButton) == 0x0002F0, "Member 'UBP_ServerEntryWidget2_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, MapIcon) == 0x0002F8, "Member 'UBP_ServerEntryWidget2_C::MapIcon' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, PingText) == 0x000300, "Member 'UBP_ServerEntryWidget2_C::PingText' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, Server) == 0x000308, "Member 'UBP_ServerEntryWidget2_C::Server' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget2_C, NewVar) == 0x000450, "Member 'UBP_ServerEntryWidget2_C::NewVar' has a wrong offset!");

}

