#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ServerListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ServerListWidget.BP_ServerListWidget_C
// 0x0070 (0x03A0 - 0x0330)
class UBP_ServerListWidget_C final : public UGymGuiMetaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 JoinLobbyIcon;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      PlaySpinner;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  RefreshButton;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ServerListBox;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ServerListPanel;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget*                                ExitPanel;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        JoinButtons;                                       // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnServerListWidgetsUpdated;                        // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWidget*                                FirstButton;                                       // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                LastButton;                                        // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ServerListWidget_RefreshButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BPOpen();
	void CustomEvent(bool Success);
	void EmptyList();
	void ExecuteUbergraph_BP_ServerListWidget(int32 EntryPoint);
	void OnFindSessionsCompleteEvent_Event(const TArray<struct FGymSessionSearchResult>& SessionResults, bool Successful);
	void OnServerListWidgetsUpdated__DelegateSignature();
	void Refresh();
	void UpdateList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ServerListWidget_C">();
	}
	static class UBP_ServerListWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ServerListWidget_C>();
	}
};
static_assert(alignof(UBP_ServerListWidget_C) == 0x000008, "Wrong alignment on UBP_ServerListWidget_C");
static_assert(sizeof(UBP_ServerListWidget_C) == 0x0003A0, "Wrong size on UBP_ServerListWidget_C");
static_assert(offsetof(UBP_ServerListWidget_C, UberGraphFrame) == 0x000330, "Member 'UBP_ServerListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, JoinLobbyIcon) == 0x000338, "Member 'UBP_ServerListWidget_C::JoinLobbyIcon' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, PlaySpinner) == 0x000340, "Member 'UBP_ServerListWidget_C::PlaySpinner' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, RefreshButton) == 0x000348, "Member 'UBP_ServerListWidget_C::RefreshButton' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, ScrollBox_0) == 0x000350, "Member 'UBP_ServerListWidget_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, ServerListBox) == 0x000358, "Member 'UBP_ServerListWidget_C::ServerListBox' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, ServerListPanel) == 0x000360, "Member 'UBP_ServerListWidget_C::ServerListPanel' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, ExitPanel) == 0x000368, "Member 'UBP_ServerListWidget_C::ExitPanel' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, JoinButtons) == 0x000370, "Member 'UBP_ServerListWidget_C::JoinButtons' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, OnServerListWidgetsUpdated) == 0x000380, "Member 'UBP_ServerListWidget_C::OnServerListWidgetsUpdated' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, FirstButton) == 0x000390, "Member 'UBP_ServerListWidget_C::FirstButton' has a wrong offset!");
static_assert(offsetof(UBP_ServerListWidget_C, LastButton) == 0x000398, "Member 'UBP_ServerListWidget_C::LastButton' has a wrong offset!");

}

