#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ServerEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ServerEntryWidget.BP_ServerEntryWidget_C
// 0x0190 (0x0450 - 0x02C0)
class UBP_ServerEntryWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ColumnDisplayName;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ColumnMapName;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ColumnPlayerCount;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            JoinButton;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MapIcon;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymServerInfo                         Server;                                            // 0x02F8(0x0158)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__BP_ServerEntryWidget_JoinButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_ServerEntryWidget(int32 EntryPoint);
	void OnJoinServerRequestComplete_Event(bool Success, const class FString& JoinUrl);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ServerEntryWidget_C">();
	}
	static class UBP_ServerEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ServerEntryWidget_C>();
	}
};
static_assert(alignof(UBP_ServerEntryWidget_C) == 0x000008, "Wrong alignment on UBP_ServerEntryWidget_C");
static_assert(sizeof(UBP_ServerEntryWidget_C) == 0x000450, "Wrong size on UBP_ServerEntryWidget_C");
static_assert(offsetof(UBP_ServerEntryWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_ServerEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget_C, Background) == 0x0002C8, "Member 'UBP_ServerEntryWidget_C::Background' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget_C, ColumnDisplayName) == 0x0002D0, "Member 'UBP_ServerEntryWidget_C::ColumnDisplayName' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget_C, ColumnMapName) == 0x0002D8, "Member 'UBP_ServerEntryWidget_C::ColumnMapName' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget_C, ColumnPlayerCount) == 0x0002E0, "Member 'UBP_ServerEntryWidget_C::ColumnPlayerCount' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget_C, JoinButton) == 0x0002E8, "Member 'UBP_ServerEntryWidget_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget_C, MapIcon) == 0x0002F0, "Member 'UBP_ServerEntryWidget_C::MapIcon' has a wrong offset!");
static_assert(offsetof(UBP_ServerEntryWidget_C, Server) == 0x0002F8, "Member 'UBP_ServerEntryWidget_C::Server' has a wrong offset!");

}

