#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeasonsMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SeasonsMenuWidget.BP_SeasonsMenuWidget_C
// 0x0178 (0x04A8 - 0x0330)
class UBP_SeasonsMenuWidget_C final : public UGymGuiMetaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       EndTimer;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_C*                       HeaderCommonText;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_C*                       HeaderCommonText_1;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_110;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageePreviewBig;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemName;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style2_C*                       LevelValue;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LVL_RequiredXPText;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LVL_RequiredXPValue;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LVL_RequiredXPValue_1;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PageCount;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PagesContainer;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RequirementsContainer;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RewardLevel;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RewardRequirements;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollLeft_Border;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ScrollLeft_Button;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollLeft_Image;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollRight_Border;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ScrollRight_Button;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollRight_Image;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               TagContainer;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Horizontal_C*       WBP_ChallengesButton;                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemTag_C*                         WBP_ItemTag;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemTag_C*                         WBP_ItemTag_1;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsPopupWidget_C*              WBP_RewardsPopupWidget;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeasonsRewardsCard_C*              WBP_SeasonsRewardsCard;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentPage;                                       // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               PreviewTexture;                                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NewVar;                                            // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             NewEventDispatcher;                                // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_RewardPageContainer_C*>     RewardPageContainers;                              // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWidget*                                PreviousHighlightedWidget;                         // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRewardCardIndex;                            // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RewardPageContainer_C*             CurrentRewardPageContainer;                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstTime;                                       // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrevPage;                                          // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                DelayedWidgetToHighlight;                          // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 LastHighlightedReward;                             // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HasSeasonData;                                     // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_SeasonsMenuWidget_ScrollLeft_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_SeasonsMenuWidget_ScrollLeft_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_SeasonsMenuWidget_ScrollLeft_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_SeasonsMenuWidget_ScrollRight_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_SeasonsMenuWidget_ScrollRight_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_SeasonsMenuWidget_ScrollRight_Button_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_SeasonsMenuWidget_WBP_ChallengesButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BPClose();
	void BPHighlightWidget(class UWidget* Widget);
	void BPOpen();
	void Construct();
	void CustomEvent(bool Success);
	void ExecuteUbergraph_BP_SeasonsMenuWidget(int32 EntryPoint);
	void FormatEndTime(const struct FDateTime& EndDate, class FText* Text);
	class FText Get_EndTimer_Text();
	ESlateVisibility Get_LVL_RequiredXPValue_1_Visibility();
	class FText Get_PageCount_Text();
	struct FSlateBrush GetBrush();
	void GetCurrentLevel(int32 CurrentXp, TArray<struct FGymSeasonReward>& Rewards, int32* Level, int32* XPToNext, int32* ProgressToNext);
	ESlateVisibility GetVisibility_0();
	ESlateVisibility GetVisibility_1();
	ESlateVisibility GetVisibility_2();
	ESlateVisibility GetVisibility_3();
	void HighlightDelayed();
	void Init_Current_Page_And_Selected_Card_Index();
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_5(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadSubmenuTabLeft_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadSubmenuTabRight_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_6(const struct FKey& Key);
	void NewEventDispatcher__DelegateSignature();
	void OnRewardPopupVisibilityChanged(ESlateVisibility InVisibility);
	void OnRewardSelected(const struct FGymSeasonReward& Reward);
	void UnclaimedRewards(bool Success, const struct FGymUnclaimedRewardResponse& Response);
	void UpdateHighlightableWidgets();
	void UpdateLeftRightButtonVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SeasonsMenuWidget_C">();
	}
	static class UBP_SeasonsMenuWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SeasonsMenuWidget_C>();
	}
};
static_assert(alignof(UBP_SeasonsMenuWidget_C) == 0x000008, "Wrong alignment on UBP_SeasonsMenuWidget_C");
static_assert(sizeof(UBP_SeasonsMenuWidget_C) == 0x0004A8, "Wrong size on UBP_SeasonsMenuWidget_C");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, UberGraphFrame) == 0x000330, "Member 'UBP_SeasonsMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, EndTimer) == 0x000338, "Member 'UBP_SeasonsMenuWidget_C::EndTimer' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, HeaderCommonText) == 0x000340, "Member 'UBP_SeasonsMenuWidget_C::HeaderCommonText' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, HeaderCommonText_1) == 0x000348, "Member 'UBP_SeasonsMenuWidget_C::HeaderCommonText_1' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, Image_110) == 0x000350, "Member 'UBP_SeasonsMenuWidget_C::Image_110' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ImageePreviewBig) == 0x000358, "Member 'UBP_SeasonsMenuWidget_C::ImageePreviewBig' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ItemName) == 0x000360, "Member 'UBP_SeasonsMenuWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, LevelValue) == 0x000368, "Member 'UBP_SeasonsMenuWidget_C::LevelValue' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, LVL_RequiredXPText) == 0x000370, "Member 'UBP_SeasonsMenuWidget_C::LVL_RequiredXPText' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, LVL_RequiredXPValue) == 0x000378, "Member 'UBP_SeasonsMenuWidget_C::LVL_RequiredXPValue' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, LVL_RequiredXPValue_1) == 0x000380, "Member 'UBP_SeasonsMenuWidget_C::LVL_RequiredXPValue_1' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, PageCount) == 0x000388, "Member 'UBP_SeasonsMenuWidget_C::PageCount' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, PagesContainer) == 0x000390, "Member 'UBP_SeasonsMenuWidget_C::PagesContainer' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ProgressBar) == 0x000398, "Member 'UBP_SeasonsMenuWidget_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, RequirementsContainer) == 0x0003A0, "Member 'UBP_SeasonsMenuWidget_C::RequirementsContainer' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, RewardLevel) == 0x0003A8, "Member 'UBP_SeasonsMenuWidget_C::RewardLevel' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, RewardRequirements) == 0x0003B0, "Member 'UBP_SeasonsMenuWidget_C::RewardRequirements' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ScrollLeft_Border) == 0x0003B8, "Member 'UBP_SeasonsMenuWidget_C::ScrollLeft_Border' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ScrollLeft_Button) == 0x0003C0, "Member 'UBP_SeasonsMenuWidget_C::ScrollLeft_Button' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ScrollLeft_Image) == 0x0003C8, "Member 'UBP_SeasonsMenuWidget_C::ScrollLeft_Image' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ScrollRight_Border) == 0x0003D0, "Member 'UBP_SeasonsMenuWidget_C::ScrollRight_Border' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ScrollRight_Button) == 0x0003D8, "Member 'UBP_SeasonsMenuWidget_C::ScrollRight_Button' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, ScrollRight_Image) == 0x0003E0, "Member 'UBP_SeasonsMenuWidget_C::ScrollRight_Image' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, TagContainer) == 0x0003E8, "Member 'UBP_SeasonsMenuWidget_C::TagContainer' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, VerticalBox_0) == 0x0003F0, "Member 'UBP_SeasonsMenuWidget_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, WBP_ChallengesButton) == 0x0003F8, "Member 'UBP_SeasonsMenuWidget_C::WBP_ChallengesButton' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, WBP_ItemTag) == 0x000400, "Member 'UBP_SeasonsMenuWidget_C::WBP_ItemTag' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, WBP_ItemTag_1) == 0x000408, "Member 'UBP_SeasonsMenuWidget_C::WBP_ItemTag_1' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, WBP_RewardsPopupWidget) == 0x000410, "Member 'UBP_SeasonsMenuWidget_C::WBP_RewardsPopupWidget' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, WBP_SeasonsRewardsCard) == 0x000418, "Member 'UBP_SeasonsMenuWidget_C::WBP_SeasonsRewardsCard' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, CurrentPage) == 0x000420, "Member 'UBP_SeasonsMenuWidget_C::CurrentPage' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, PreviewTexture) == 0x000428, "Member 'UBP_SeasonsMenuWidget_C::PreviewTexture' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, HighlightableWidgets) == 0x000430, "Member 'UBP_SeasonsMenuWidget_C::HighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, NewVar) == 0x000440, "Member 'UBP_SeasonsMenuWidget_C::NewVar' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, NewEventDispatcher) == 0x000448, "Member 'UBP_SeasonsMenuWidget_C::NewEventDispatcher' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, RewardPageContainers) == 0x000458, "Member 'UBP_SeasonsMenuWidget_C::RewardPageContainers' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, PreviousHighlightedWidget) == 0x000468, "Member 'UBP_SeasonsMenuWidget_C::PreviousHighlightedWidget' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, CurrentRewardCardIndex) == 0x000470, "Member 'UBP_SeasonsMenuWidget_C::CurrentRewardCardIndex' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, CurrentRewardPageContainer) == 0x000478, "Member 'UBP_SeasonsMenuWidget_C::CurrentRewardPageContainer' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, IsFirstTime) == 0x000480, "Member 'UBP_SeasonsMenuWidget_C::IsFirstTime' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, PrevPage) == 0x000484, "Member 'UBP_SeasonsMenuWidget_C::PrevPage' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, DelayedWidgetToHighlight) == 0x000488, "Member 'UBP_SeasonsMenuWidget_C::DelayedWidgetToHighlight' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, LastHighlightedReward) == 0x000490, "Member 'UBP_SeasonsMenuWidget_C::LastHighlightedReward' has a wrong offset!");
static_assert(offsetof(UBP_SeasonsMenuWidget_C, HasSeasonData) == 0x0004A0, "Member 'UBP_SeasonsMenuWidget_C::HasSeasonData' has a wrong offset!");

}

