#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplashWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_SplashWidget.BP_SplashWidget_C.PlaybackPrecent
// 0x0010 (0x0010 - 0x0000)
struct BP_SplashWidget_C_PlaybackPrecent final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackPercent;                                   // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplashWidget_C_PlaybackPrecent) == 0x000008, "Wrong alignment on BP_SplashWidget_C_PlaybackPrecent");
static_assert(sizeof(BP_SplashWidget_C_PlaybackPrecent) == 0x000010, "Wrong size on BP_SplashWidget_C_PlaybackPrecent");
static_assert(offsetof(BP_SplashWidget_C_PlaybackPrecent, PlayingSoundWave) == 0x000000, "Member 'BP_SplashWidget_C_PlaybackPrecent::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_PlaybackPrecent, PlaybackPercent) == 0x000008, "Member 'BP_SplashWidget_C_PlaybackPrecent::PlaybackPercent' has a wrong offset!");

// Function BP_SplashWidget.BP_SplashWidget_C.OnMouseButtonUp
// 0x0228 (0x0228 - 0x0000)
struct BP_SplashWidget_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
};
static_assert(alignof(BP_SplashWidget_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on BP_SplashWidget_C_OnMouseButtonUp");
static_assert(sizeof(BP_SplashWidget_C_OnMouseButtonUp) == 0x000228, "Wrong size on BP_SplashWidget_C_OnMouseButtonUp");
static_assert(offsetof(BP_SplashWidget_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'BP_SplashWidget_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'BP_SplashWidget_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_OnMouseButtonUp, ReturnValue) == 0x0000B0, "Member 'BP_SplashWidget_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_OnMouseButtonUp, CallFunc_IsVisible_ReturnValue) == 0x000168, "Member 'BP_SplashWidget_C_OnMouseButtonUp::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'BP_SplashWidget_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function BP_SplashWidget.BP_SplashWidget_C.OnKeyDown
// 0x01F0 (0x01F0 - 0x0000)
struct BP_SplashWidget_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0130(0x00B8)()
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplashWidget_C_OnKeyDown) == 0x000008, "Wrong alignment on BP_SplashWidget_C_OnKeyDown");
static_assert(sizeof(BP_SplashWidget_C_OnKeyDown) == 0x0001F0, "Wrong size on BP_SplashWidget_C_OnKeyDown");
static_assert(offsetof(BP_SplashWidget_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'BP_SplashWidget_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'BP_SplashWidget_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'BP_SplashWidget_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000130, "Member 'BP_SplashWidget_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_OnKeyDown, CallFunc_IsVisible_ReturnValue) == 0x0001E8, "Member 'BP_SplashWidget_C_OnKeyDown::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function BP_SplashWidget.BP_SplashWidget_C.ExecuteUbergraph_BP_SplashWidget
// 0x00A8 (0x00A8 - 0x0000)
struct BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class USoundWave*                       K2Node_CustomEvent_PlayingSoundWave;               // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlaybackPercent;                // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GymGameInstance_C*                  K2Node_DynamicCast_AsBP_Gym_Game_Instance;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSound2D_StartTime_ImplicitCast;      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget) == 0x000008, "Wrong alignment on BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget");
static_assert(sizeof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget) == 0x0000A8, "Wrong size on BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, EntryPoint) == 0x000000, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_Play_ReturnValue) == 0x000020, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_OpenSource_ReturnValue) == 0x000030, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_OpenSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_PlayAnimation_ReturnValue_4) == 0x000038, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_PlayAnimation_ReturnValue_5) == 0x000040, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, K2Node_CustomEvent_PlayingSoundWave) == 0x000058, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::K2Node_CustomEvent_PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, K2Node_CustomEvent_PlaybackPercent) == 0x000060, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::K2Node_CustomEvent_PlaybackPercent' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_GetGameInstance_ReturnValue) == 0x000068, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, K2Node_DynamicCast_AsBP_Gym_Game_Instance) == 0x000070, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::K2Node_DynamicCast_AsBP_Gym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_SpawnSound2D_ReturnValue) == 0x000088, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000090, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget, CallFunc_SpawnSound2D_StartTime_ImplicitCast) == 0x0000A0, "Member 'BP_SplashWidget_C_ExecuteUbergraph_BP_SplashWidget::CallFunc_SpawnSound2D_StartTime_ImplicitCast' has a wrong offset!");

}

