#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ServerEntryWidget2

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ServerEntryWidget2.BP_ServerEntryWidget2_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_ServerEntryWidget2_C_CustomEvent final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ServerEntryWidget2_C_CustomEvent) == 0x000001, "Wrong alignment on BP_ServerEntryWidget2_C_CustomEvent");
static_assert(sizeof(BP_ServerEntryWidget2_C_CustomEvent) == 0x000001, "Wrong size on BP_ServerEntryWidget2_C_CustomEvent");
static_assert(offsetof(BP_ServerEntryWidget2_C_CustomEvent, Success) == 0x000000, "Member 'BP_ServerEntryWidget2_C_CustomEvent::Success' has a wrong offset!");

// Function BP_ServerEntryWidget2.BP_ServerEntryWidget2_C.ExecuteUbergraph_BP_ServerEntryWidget2
// 0x01A0 (0x01A0 - 0x0000)
struct BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryTravelToCurrentSession_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymLoadingScreenOptions               K2Node_MakeStruct_GymLoadingScreenOptions;         // 0x0058(0x0058)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0150(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0168(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0180(0x0018)()
	bool                                          K2Node_CustomEvent_Success;                        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2) == 0x000008, "Wrong alignment on BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2");
static_assert(sizeof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2) == 0x0001A0, "Wrong size on BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, EntryPoint) == 0x000000, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_TryTravelToCurrentSession_ReturnValue) == 0x000010, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_TryTravelToCurrentSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, Temp_bool_Variable) == 0x000024, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, Temp_text_Variable) == 0x000028, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000048, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, K2Node_MakeStruct_GymLoadingScreenOptions) == 0x000058, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::K2Node_MakeStruct_GymLoadingScreenOptions' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000B0, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B8, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, K2Node_MakeStruct_FormatArgumentData) == 0x0000D0, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, K2Node_MakeArray_Array) == 0x000120, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000130, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_Format_ReturnValue) == 0x000138, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_Conv_StringToText_ReturnValue) == 0x000150, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000168, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, K2Node_Select_Default) == 0x000180, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2, K2Node_CustomEvent_Success) == 0x000198, "Member 'BP_ServerEntryWidget2_C_ExecuteUbergraph_BP_ServerEntryWidget2::K2Node_CustomEvent_Success' has a wrong offset!");

}

