#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_XPsingleline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_XPsingleline.BP_XPsingleline_C
// 0x0040 (0x0300 - 0x02C0)
class UBP_XPsingleline_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Count;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       XPAmount;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       XPcategory;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymPlayerXPRow                        Data;                                              // 0x02E0(0x0020)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_BP_XPsingleline(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_XPsingleline_C">();
	}
	static class UBP_XPsingleline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_XPsingleline_C>();
	}
};
static_assert(alignof(UBP_XPsingleline_C) == 0x000008, "Wrong alignment on UBP_XPsingleline_C");
static_assert(sizeof(UBP_XPsingleline_C) == 0x000300, "Wrong size on UBP_XPsingleline_C");
static_assert(offsetof(UBP_XPsingleline_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_XPsingleline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_XPsingleline_C, Count) == 0x0002C8, "Member 'UBP_XPsingleline_C::Count' has a wrong offset!");
static_assert(offsetof(UBP_XPsingleline_C, XPAmount) == 0x0002D0, "Member 'UBP_XPsingleline_C::XPAmount' has a wrong offset!");
static_assert(offsetof(UBP_XPsingleline_C, XPcategory) == 0x0002D8, "Member 'UBP_XPsingleline_C::XPcategory' has a wrong offset!");
static_assert(offsetof(UBP_XPsingleline_C, Data) == 0x0002E0, "Member 'UBP_XPsingleline_C::Data' has a wrong offset!");

}

