#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_XPexpanded

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_XPexpanded.BP_XPexpanded_C.ExecuteUbergraph_BP_XPexpanded
// 0x0100 (0x0100 - 0x0000)
struct BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDemo_ReturnValue;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Multipliersingleline_C*             CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_XPsingleline_C*                     CallFunc_SpawnObject_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGymPlayerScoreboard                   K2Node_CustomEvent_Scoreboard;                     // 0x0030(0x0048)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0080(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymPlayerXPMultiplierRow              CallFunc_Array_Get_Item;                           // 0x00A0(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymPlayerXPRow                        CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded) == 0x000008, "Wrong alignment on BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded");
static_assert(sizeof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded) == 0x000100, "Wrong size on BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, EntryPoint) == 0x000000, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_IsDemo_ReturnValue) == 0x000004, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_IsDemo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, Temp_bool_Variable) == 0x000005, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, Temp_byte_Variable) == 0x000010, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, Temp_byte_Variable_1) == 0x000011, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, K2Node_Select_Default) == 0x000018, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_SpawnObject_ReturnValue_1) == 0x000028, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, K2Node_CustomEvent_Scoreboard) == 0x000030, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::K2Node_CustomEvent_Scoreboard' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Conv_IntToText_ReturnValue) == 0x000080, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000EC, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_AddChild_ReturnValue) == 0x0000F0, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded, CallFunc_AddChild_ReturnValue_1) == 0x0000F8, "Member 'BP_XPexpanded_C_ExecuteUbergraph_BP_XPexpanded::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function BP_XPexpanded.BP_XPexpanded_C.SetData
// 0x0048 (0x0048 - 0x0000)
struct BP_XPexpanded_C_SetData final
{
public:
	struct FGymPlayerScoreboard                   Scoreboard;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_XPexpanded_C_SetData) == 0x000008, "Wrong alignment on BP_XPexpanded_C_SetData");
static_assert(sizeof(BP_XPexpanded_C_SetData) == 0x000048, "Wrong size on BP_XPexpanded_C_SetData");
static_assert(offsetof(BP_XPexpanded_C_SetData, Scoreboard) == 0x000000, "Member 'BP_XPexpanded_C_SetData::Scoreboard' has a wrong offset!");

}

