#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWC_Title

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPWC_Title.BPWC_Title_C
// 0x0028 (0x02E8 - 0x02C0)
class UBPWC_Title_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_title;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x02D0(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BPWC_Title(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPWC_Title_C">();
	}
	static class UBPWC_Title_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPWC_Title_C>();
	}
};
static_assert(alignof(UBPWC_Title_C) == 0x000008, "Wrong alignment on UBPWC_Title_C");
static_assert(sizeof(UBPWC_Title_C) == 0x0002E8, "Wrong size on UBPWC_Title_C");
static_assert(offsetof(UBPWC_Title_C, UberGraphFrame) == 0x0002C0, "Member 'UBPWC_Title_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPWC_Title_C, Txt_title) == 0x0002C8, "Member 'UBPWC_Title_C::Txt_title' has a wrong offset!");
static_assert(offsetof(UBPWC_Title_C, Title) == 0x0002D0, "Member 'UBPWC_Title_C::Title' has a wrong offset!");

}

