#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWC_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPWC_List.BPWC_List_C
// 0x0038 (0x02F8 - 0x02C0)
class UBPWC_List_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        Combo_items;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ContentSize;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_label;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x02E0(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BPWC_List(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPWC_List_C">();
	}
	static class UBPWC_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPWC_List_C>();
	}
};
static_assert(alignof(UBPWC_List_C) == 0x000008, "Wrong alignment on UBPWC_List_C");
static_assert(sizeof(UBPWC_List_C) == 0x0002F8, "Wrong size on UBPWC_List_C");
static_assert(offsetof(UBPWC_List_C, UberGraphFrame) == 0x0002C0, "Member 'UBPWC_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPWC_List_C, Combo_items) == 0x0002C8, "Member 'UBPWC_List_C::Combo_items' has a wrong offset!");
static_assert(offsetof(UBPWC_List_C, ContentSize) == 0x0002D0, "Member 'UBPWC_List_C::ContentSize' has a wrong offset!");
static_assert(offsetof(UBPWC_List_C, Txt_label) == 0x0002D8, "Member 'UBPWC_List_C::Txt_label' has a wrong offset!");
static_assert(offsetof(UBPWC_List_C, Label) == 0x0002E0, "Member 'UBPWC_List_C::Label' has a wrong offset!");

}

