#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWC_ValueReadOnly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPWC_ValueReadOnly.BPWC_ValueReadOnly_C
// 0x0030 (0x02F0 - 0x02C0)
class UBPWC_ValueReadOnly_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_label;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_value;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x02D8(0x0018)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_BPWC_ValueReadOnly(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetDisabled();
	void SetValue(const class FText& NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPWC_ValueReadOnly_C">();
	}
	static class UBPWC_ValueReadOnly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPWC_ValueReadOnly_C>();
	}
};
static_assert(alignof(UBPWC_ValueReadOnly_C) == 0x000008, "Wrong alignment on UBPWC_ValueReadOnly_C");
static_assert(sizeof(UBPWC_ValueReadOnly_C) == 0x0002F0, "Wrong size on UBPWC_ValueReadOnly_C");
static_assert(offsetof(UBPWC_ValueReadOnly_C, UberGraphFrame) == 0x0002C0, "Member 'UBPWC_ValueReadOnly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPWC_ValueReadOnly_C, Txt_label) == 0x0002C8, "Member 'UBPWC_ValueReadOnly_C::Txt_label' has a wrong offset!");
static_assert(offsetof(UBPWC_ValueReadOnly_C, Txt_value) == 0x0002D0, "Member 'UBPWC_ValueReadOnly_C::Txt_value' has a wrong offset!");
static_assert(offsetof(UBPWC_ValueReadOnly_C, Label) == 0x0002D8, "Member 'UBPWC_ValueReadOnly_C::Label' has a wrong offset!");

}

