#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWC_Slider

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPWC_Slider.BPWC_Slider_C
// 0x0048 (0x0308 - 0x02C0)
class UBPWC_Slider_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USlider*                                Sld_value;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_label;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_value;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x02E0(0x0018)(Edit, BlueprintVisible)
	struct FVector2D                              Range;                                             // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BPWC_Slider_sld_value_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void Construct();
	void ExecuteUbergraph_BPWC_Slider(int32 EntryPoint);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetDisabled(bool IsDisabled);
	void SetValue(double NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPWC_Slider_C">();
	}
	static class UBPWC_Slider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPWC_Slider_C>();
	}
};
static_assert(alignof(UBPWC_Slider_C) == 0x000008, "Wrong alignment on UBPWC_Slider_C");
static_assert(sizeof(UBPWC_Slider_C) == 0x000308, "Wrong size on UBPWC_Slider_C");
static_assert(offsetof(UBPWC_Slider_C, UberGraphFrame) == 0x0002C0, "Member 'UBPWC_Slider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPWC_Slider_C, Sld_value) == 0x0002C8, "Member 'UBPWC_Slider_C::Sld_value' has a wrong offset!");
static_assert(offsetof(UBPWC_Slider_C, Txt_label) == 0x0002D0, "Member 'UBPWC_Slider_C::Txt_label' has a wrong offset!");
static_assert(offsetof(UBPWC_Slider_C, Txt_value) == 0x0002D8, "Member 'UBPWC_Slider_C::Txt_value' has a wrong offset!");
static_assert(offsetof(UBPWC_Slider_C, Label) == 0x0002E0, "Member 'UBPWC_Slider_C::Label' has a wrong offset!");
static_assert(offsetof(UBPWC_Slider_C, Range) == 0x0002F8, "Member 'UBPWC_Slider_C::Range' has a wrong offset!");

}

