#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasLocalizationToggleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasLocalizationToggleWidget.CanvasLocalizationToggleWidget_C
// 0x0068 (0x0398 - 0x0330)
class UCanvasLocalizationToggleWidget_C final : public UGymGuiMetaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CultureSelectionButton_C*          ChineseSimplifiedButton;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          ChineseTraditionalButton;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          EnglishButton;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          FinnishButton;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          FrenchButton;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          GermanButton;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          ItalianButton;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          JapaneseButton;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          PortugeseButton;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          SpanishButton;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_0;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CultureSelectionButton_C*          SelectedButton;                                    // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CanvasLocalizationToggleWidget_ChineseSimplifiedButton_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_ChineseTraditionalButton_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_EnglishButton_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_FinnishButton_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_FrenchButton_K2Node_ComponentBoundEvent_21_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_GermanButton_K2Node_ComponentBoundEvent_22_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_ItalianButton_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_JapaneseButton_K2Node_ComponentBoundEvent_25_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_PortugeseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasLocalizationToggleWidget_SpanishButton_K2Node_ComponentBoundEvent_24_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_CanvasLocalizationToggleWidget(int32 EntryPoint);
	void UpdateSelectedButton(class UWBP_CultureSelectionButton_C* NewSelectedButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasLocalizationToggleWidget_C">();
	}
	static class UCanvasLocalizationToggleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasLocalizationToggleWidget_C>();
	}
};
static_assert(alignof(UCanvasLocalizationToggleWidget_C) == 0x000008, "Wrong alignment on UCanvasLocalizationToggleWidget_C");
static_assert(sizeof(UCanvasLocalizationToggleWidget_C) == 0x000398, "Wrong size on UCanvasLocalizationToggleWidget_C");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, UberGraphFrame) == 0x000330, "Member 'UCanvasLocalizationToggleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, ChineseSimplifiedButton) == 0x000338, "Member 'UCanvasLocalizationToggleWidget_C::ChineseSimplifiedButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, ChineseTraditionalButton) == 0x000340, "Member 'UCanvasLocalizationToggleWidget_C::ChineseTraditionalButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, EnglishButton) == 0x000348, "Member 'UCanvasLocalizationToggleWidget_C::EnglishButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, FinnishButton) == 0x000350, "Member 'UCanvasLocalizationToggleWidget_C::FinnishButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, FrenchButton) == 0x000358, "Member 'UCanvasLocalizationToggleWidget_C::FrenchButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, GermanButton) == 0x000360, "Member 'UCanvasLocalizationToggleWidget_C::GermanButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, ItalianButton) == 0x000368, "Member 'UCanvasLocalizationToggleWidget_C::ItalianButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, JapaneseButton) == 0x000370, "Member 'UCanvasLocalizationToggleWidget_C::JapaneseButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, PortugeseButton) == 0x000378, "Member 'UCanvasLocalizationToggleWidget_C::PortugeseButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, SpanishButton) == 0x000380, "Member 'UCanvasLocalizationToggleWidget_C::SpanishButton' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, WrapBox_0) == 0x000388, "Member 'UCanvasLocalizationToggleWidget_C::WrapBox_0' has a wrong offset!");
static_assert(offsetof(UCanvasLocalizationToggleWidget_C, SelectedButton) == 0x000390, "Member 'UCanvasLocalizationToggleWidget_C::SelectedButton' has a wrong offset!");

}

