#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasBackgroundBlurWidget

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasBackgroundBlurWidget.CanvasBackgroundBlurWidget_C
// 0x0018 (0x0378 - 0x0360)
class UCanvasBackgroundBlurWidget_C final : public UGymGuiBackgroundWidget
{
public:
	class UImage*                                 GrainFilter_8;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GrainFilter_17;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GrainFilter_30;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasBackgroundBlurWidget_C">();
	}
	static class UCanvasBackgroundBlurWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasBackgroundBlurWidget_C>();
	}
};
static_assert(alignof(UCanvasBackgroundBlurWidget_C) == 0x000008, "Wrong alignment on UCanvasBackgroundBlurWidget_C");
static_assert(sizeof(UCanvasBackgroundBlurWidget_C) == 0x000378, "Wrong size on UCanvasBackgroundBlurWidget_C");
static_assert(offsetof(UCanvasBackgroundBlurWidget_C, GrainFilter_8) == 0x000360, "Member 'UCanvasBackgroundBlurWidget_C::GrainFilter_8' has a wrong offset!");
static_assert(offsetof(UCanvasBackgroundBlurWidget_C, GrainFilter_17) == 0x000368, "Member 'UCanvasBackgroundBlurWidget_C::GrainFilter_17' has a wrong offset!");
static_assert(offsetof(UCanvasBackgroundBlurWidget_C, GrainFilter_30) == 0x000370, "Member 'UCanvasBackgroundBlurWidget_C::GrainFilter_30' has a wrong offset!");

}

