#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasSettingsWidgetBlueprint

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function CanvasSettingsWidgetBlueprint.CanvasSettingsWidgetBlueprint_C.BPSetScrollBoxAutoScroll
// 0x0001 (0x0001 - 0x0000)
struct CanvasSettingsWidgetBlueprint_C_BPSetScrollBoxAutoScroll final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasSettingsWidgetBlueprint_C_BPSetScrollBoxAutoScroll) == 0x000001, "Wrong alignment on CanvasSettingsWidgetBlueprint_C_BPSetScrollBoxAutoScroll");
static_assert(sizeof(CanvasSettingsWidgetBlueprint_C_BPSetScrollBoxAutoScroll) == 0x000001, "Wrong size on CanvasSettingsWidgetBlueprint_C_BPSetScrollBoxAutoScroll");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_BPSetScrollBoxAutoScroll, Value) == 0x000000, "Member 'CanvasSettingsWidgetBlueprint_C_BPSetScrollBoxAutoScroll::Value' has a wrong offset!");

// Function CanvasSettingsWidgetBlueprint.CanvasSettingsWidgetBlueprint_C.ExecuteUbergraph_CanvasSettingsWidgetBlueprint
// 0x0050 (0x0050 - 0x0000)
struct CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Value;                                // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint) == 0x000008, "Wrong alignment on CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint");
static_assert(sizeof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint) == 0x000050, "Wrong size on CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, EntryPoint) == 0x000000, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, K2Node_Event_Value) == 0x000004, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, K2Node_CustomEvent_bNewInputType) == 0x000028, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000030, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, CallFunc_GetCurrentInputType_ReturnValue) == 0x000049, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint, K2Node_SwitchEnum_CmpSuccess_1) == 0x00004A, "Member 'CanvasSettingsWidgetBlueprint_C_ExecuteUbergraph_CanvasSettingsWidgetBlueprint::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function CanvasSettingsWidgetBlueprint.CanvasSettingsWidgetBlueprint_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct CanvasSettingsWidgetBlueprint_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasSettingsWidgetBlueprint_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on CanvasSettingsWidgetBlueprint_C_OnInputMethodChanged");
static_assert(sizeof(CanvasSettingsWidgetBlueprint_C_OnInputMethodChanged) == 0x000001, "Wrong size on CanvasSettingsWidgetBlueprint_C_OnInputMethodChanged");
static_assert(offsetof(CanvasSettingsWidgetBlueprint_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'CanvasSettingsWidgetBlueprint_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

}

