#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasBuildInfoWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function CanvasBuildInfoWidget.CanvasBuildInfoWidget_C.GetText
// 0x0048 (0x0048 - 0x0000)
struct CanvasBuildInfoWidget_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetServerVersion_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(CanvasBuildInfoWidget_C_GetText) == 0x000008, "Wrong alignment on CanvasBuildInfoWidget_C_GetText");
static_assert(sizeof(CanvasBuildInfoWidget_C_GetText) == 0x000048, "Wrong size on CanvasBuildInfoWidget_C_GetText");
static_assert(offsetof(CanvasBuildInfoWidget_C_GetText, ReturnValue) == 0x000000, "Member 'CanvasBuildInfoWidget_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasBuildInfoWidget_C_GetText, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'CanvasBuildInfoWidget_C_GetText::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasBuildInfoWidget_C_GetText, CallFunc_GetServerVersion_ReturnValue) == 0x000020, "Member 'CanvasBuildInfoWidget_C_GetText::CallFunc_GetServerVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasBuildInfoWidget_C_GetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'CanvasBuildInfoWidget_C_GetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

