#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasSettingsWidgetBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasSettingsWidgetBlueprint.CanvasSettingsWidgetBlueprint_C
// 0x0060 (0x03C8 - 0x0368)
class UCanvasSettingsWidgetBlueprint_C final : public UGymGuiSettingsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PushAnim;                                          // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        BackButtonSwitcher;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputActionUI;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingsUI_C*                          SettingsUI;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Spinner;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_1;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__CanvasSettingsWidgetBlueprint_BackButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CanvasSettingsWidgetBlueprint_BackButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BPClose();
	void BPFocusToDefaultWidget();
	void BPOpen();
	void BPOpenNextCategory();
	void BPOpenPrevCategory();
	void BPSetScrollBoxAutoScroll(const bool Value);
	void Destruct();
	void ExecuteUbergraph_CanvasSettingsWidgetBlueprint(int32 EntryPoint);
	void OnInitialized();
	void OnInputMethodChanged(ECommonInputType bNewInputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasSettingsWidgetBlueprint_C">();
	}
	static class UCanvasSettingsWidgetBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasSettingsWidgetBlueprint_C>();
	}
};
static_assert(alignof(UCanvasSettingsWidgetBlueprint_C) == 0x000008, "Wrong alignment on UCanvasSettingsWidgetBlueprint_C");
static_assert(sizeof(UCanvasSettingsWidgetBlueprint_C) == 0x0003C8, "Wrong size on UCanvasSettingsWidgetBlueprint_C");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, UberGraphFrame) == 0x000368, "Member 'UCanvasSettingsWidgetBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, PushAnim) == 0x000370, "Member 'UCanvasSettingsWidgetBlueprint_C::PushAnim' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, HoverAnim) == 0x000378, "Member 'UCanvasSettingsWidgetBlueprint_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, BackButtonSwitcher) == 0x000380, "Member 'UCanvasSettingsWidgetBlueprint_C::BackButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, Background) == 0x000388, "Member 'UCanvasSettingsWidgetBlueprint_C::Background' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, ContentBorder) == 0x000390, "Member 'UCanvasSettingsWidgetBlueprint_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, HoverBorder) == 0x000398, "Member 'UCanvasSettingsWidgetBlueprint_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, InputActionUI) == 0x0003A0, "Member 'UCanvasSettingsWidgetBlueprint_C::InputActionUI' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, SettingsUI) == 0x0003A8, "Member 'UCanvasSettingsWidgetBlueprint_C::SettingsUI' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, Spinner) == 0x0003B0, "Member 'UCanvasSettingsWidgetBlueprint_C::Spinner' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, Text) == 0x0003B8, "Member 'UCanvasSettingsWidgetBlueprint_C::Text' has a wrong offset!");
static_assert(offsetof(UCanvasSettingsWidgetBlueprint_C, Text_1) == 0x0003C0, "Member 'UCanvasSettingsWidgetBlueprint_C::Text_1' has a wrong offset!");

}

