#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasRaceEndScoreboardWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.ExecuteUbergraph_CanvasRaceEndScoreboardWidget
// 0x0178 (0x0178 - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool ConfirmClicked)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymSessionUtils*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayMode_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0040(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0058(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2; // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x008C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_RestartButton_Enable_ReturnValue;     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_ConfirmClicked;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymLoadingScreenOptions               K2Node_MakeStruct_GymLoadingScreenOptions;         // 0x00E8(0x0058)()
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0140(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget) == 0x000008, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget) == 0x000178, "Wrong size on CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, EntryPoint) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_IsPlayMode_ReturnValue) == 0x000038, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_IsPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_InputActionEvent_Key) == 0x000040, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_InputActionEvent_Key_1) == 0x000058, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x000070, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1) == 0x000071, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2) == 0x000072, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_GamepadUINavigate_ReturnValue) == 0x000073, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x000074, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_DynamicCast_AsGym_Player_Controller) == 0x000080, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_Event_MyGeometry) == 0x00008C, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_Event_InDeltaTime) == 0x0000C4, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_Get_RestartButton_Enable_ReturnValue) == 0x0000C8, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_Get_RestartButton_Enable_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_MakeArray_Array) == 0x0000D0, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_CustomEvent_ConfirmClicked) == 0x0000E0, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_CustomEvent_ConfirmClicked' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_MakeStruct_GymLoadingScreenOptions) == 0x0000E8, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_MakeStruct_GymLoadingScreenOptions' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_InputActionEvent_Key_2) == 0x000140, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_CustomEvent_Success) == 0x000158, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, CallFunc_GetGameInstance_ReturnValue) == 0x000160, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000168, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'CanvasRaceEndScoreboardWidget_C_ExecuteUbergraph_CanvasRaceEndScoreboardWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.Get_RestartButton_Enable
// 0x0020 (0x0020 - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartMatchInPlayMode_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable) == 0x000008, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable) == 0x000020, "Wrong size on CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable, ReturnValue) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable::ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable, K2Node_DynamicCast_AsGym_Player_Controller) == 0x000010, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable, CallFunc_CanStartMatchInPlayMode_ReturnValue) == 0x000019, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Enable::CallFunc_CanStartMatchInPlayMode_ReturnValue' has a wrong offset!");

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.Get_RestartButton_Visible
// 0x0020 (0x0020 - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerState*                        K2Node_DynamicCast_AsGym_Player_State;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwner_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible) == 0x000008, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible) == 0x000020, "Wrong size on CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, ReturnValue) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, Temp_bool_Variable) == 0x000001, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, Temp_byte_Variable) == 0x000002, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, Temp_byte_Variable_1) == 0x000003, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, K2Node_DynamicCast_AsGym_Player_State) == 0x000010, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::K2Node_DynamicCast_AsGym_Player_State' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, CallFunc_IsOwner_ReturnValue) == 0x000019, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::CallFunc_IsOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible, K2Node_Select_Default) == 0x00001A, "Member 'CanvasRaceEndScoreboardWidget_C_Get_RestartButton_Visible::K2Node_Select_Default' has a wrong offset!");

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2
// 0x0018 (0x0018 - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2) == 0x000008, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2) == 0x000018, "Wrong size on CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2, Key) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2::Key' has a wrong offset!");

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.LeaveMainMenu
// 0x0001 (0x0001 - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_LeaveMainMenu final
{
public:
	bool                                          ConfirmClicked;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_LeaveMainMenu) == 0x000001, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_LeaveMainMenu");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_LeaveMainMenu) == 0x000001, "Wrong size on CanvasRaceEndScoreboardWidget_C_LeaveMainMenu");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_LeaveMainMenu, ConfirmClicked) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_LeaveMainMenu::ConfirmClicked' has a wrong offset!");

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.OnEndSessionCompleteEvent
// 0x0001 (0x0001 - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_OnEndSessionCompleteEvent final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_OnEndSessionCompleteEvent) == 0x000001, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_OnEndSessionCompleteEvent");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_OnEndSessionCompleteEvent) == 0x000001, "Wrong size on CanvasRaceEndScoreboardWidget_C_OnEndSessionCompleteEvent");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_OnEndSessionCompleteEvent, Success) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_OnEndSessionCompleteEvent::Success' has a wrong offset!");

// Function CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct CanvasRaceEndScoreboardWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasRaceEndScoreboardWidget_C_Tick) == 0x000004, "Wrong alignment on CanvasRaceEndScoreboardWidget_C_Tick");
static_assert(sizeof(CanvasRaceEndScoreboardWidget_C_Tick) == 0x00003C, "Wrong size on CanvasRaceEndScoreboardWidget_C_Tick");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Tick, MyGeometry) == 0x000000, "Member 'CanvasRaceEndScoreboardWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CanvasRaceEndScoreboardWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'CanvasRaceEndScoreboardWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

