#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasChooseColorWidget

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasChooseColorWidget.CanvasChooseColorWidget_C
// 0x0080 (0x03B8 - 0x0338)
class UCanvasChooseColorWidget_C final : public UGymGuiGlobalMetaWidget
{
public:
	class UButton*                                Button_12;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_13;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_14;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GrainFilter_40;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_62;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_63;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_65;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_66;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_67;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_70;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_71;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_158;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasChooseColorWidget_C">();
	}
	static class UCanvasChooseColorWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasChooseColorWidget_C>();
	}
};
static_assert(alignof(UCanvasChooseColorWidget_C) == 0x000008, "Wrong alignment on UCanvasChooseColorWidget_C");
static_assert(sizeof(UCanvasChooseColorWidget_C) == 0x0003B8, "Wrong size on UCanvasChooseColorWidget_C");
static_assert(offsetof(UCanvasChooseColorWidget_C, Button_12) == 0x000338, "Member 'UCanvasChooseColorWidget_C::Button_12' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Button_13) == 0x000340, "Member 'UCanvasChooseColorWidget_C::Button_13' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Button_14) == 0x000348, "Member 'UCanvasChooseColorWidget_C::Button_14' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, GrainFilter_40) == 0x000350, "Member 'UCanvasChooseColorWidget_C::GrainFilter_40' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_59) == 0x000358, "Member 'UCanvasChooseColorWidget_C::Image_59' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_61) == 0x000360, "Member 'UCanvasChooseColorWidget_C::Image_61' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_62) == 0x000368, "Member 'UCanvasChooseColorWidget_C::Image_62' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_63) == 0x000370, "Member 'UCanvasChooseColorWidget_C::Image_63' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_64) == 0x000378, "Member 'UCanvasChooseColorWidget_C::Image_64' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_65) == 0x000380, "Member 'UCanvasChooseColorWidget_C::Image_65' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_66) == 0x000388, "Member 'UCanvasChooseColorWidget_C::Image_66' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_67) == 0x000390, "Member 'UCanvasChooseColorWidget_C::Image_67' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_68) == 0x000398, "Member 'UCanvasChooseColorWidget_C::Image_68' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_70) == 0x0003A0, "Member 'UCanvasChooseColorWidget_C::Image_70' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_71) == 0x0003A8, "Member 'UCanvasChooseColorWidget_C::Image_71' has a wrong offset!");
static_assert(offsetof(UCanvasChooseColorWidget_C, Image_158) == 0x0003B0, "Member 'UCanvasChooseColorWidget_C::Image_158' has a wrong offset!");

}

