#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasChooseLevelWidget

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasChooseLevelWidget.CanvasChooseLevelWidget_C
// 0x0040 (0x0448 - 0x0408)
class UCanvasChooseLevelWidget_C final : public UGymGuiChooseLevelWidget
{
public:
	class UImage*                                 DotBackground;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DotBackground_1;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DotBackground_2;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DotBackground_3;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder_1;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder_2;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder_3;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasChooseLevelWidget_C">();
	}
	static class UCanvasChooseLevelWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasChooseLevelWidget_C>();
	}
};
static_assert(alignof(UCanvasChooseLevelWidget_C) == 0x000008, "Wrong alignment on UCanvasChooseLevelWidget_C");
static_assert(sizeof(UCanvasChooseLevelWidget_C) == 0x000448, "Wrong size on UCanvasChooseLevelWidget_C");
static_assert(offsetof(UCanvasChooseLevelWidget_C, DotBackground) == 0x000408, "Member 'UCanvasChooseLevelWidget_C::DotBackground' has a wrong offset!");
static_assert(offsetof(UCanvasChooseLevelWidget_C, DotBackground_1) == 0x000410, "Member 'UCanvasChooseLevelWidget_C::DotBackground_1' has a wrong offset!");
static_assert(offsetof(UCanvasChooseLevelWidget_C, DotBackground_2) == 0x000418, "Member 'UCanvasChooseLevelWidget_C::DotBackground_2' has a wrong offset!");
static_assert(offsetof(UCanvasChooseLevelWidget_C, DotBackground_3) == 0x000420, "Member 'UCanvasChooseLevelWidget_C::DotBackground_3' has a wrong offset!");
static_assert(offsetof(UCanvasChooseLevelWidget_C, HoverBorder) == 0x000428, "Member 'UCanvasChooseLevelWidget_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UCanvasChooseLevelWidget_C, HoverBorder_1) == 0x000430, "Member 'UCanvasChooseLevelWidget_C::HoverBorder_1' has a wrong offset!");
static_assert(offsetof(UCanvasChooseLevelWidget_C, HoverBorder_2) == 0x000438, "Member 'UCanvasChooseLevelWidget_C::HoverBorder_2' has a wrong offset!");
static_assert(offsetof(UCanvasChooseLevelWidget_C, HoverBorder_3) == 0x000440, "Member 'UCanvasChooseLevelWidget_C::HoverBorder_3' has a wrong offset!");

}

