#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasRaceEndScoreboardWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasRaceEndScoreboardWidget.CanvasRaceEndScoreboardWidget_C
// 0x0078 (0x03D0 - 0x0358)
class UCanvasRaceEndScoreboardWidget_C final : public UGymGuiREScoreboardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasLeaveToMenuOverlayWidget_C*      CanvasLeaveToMenuOverlayWidget;                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GrainFilter_41;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_38;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeaderboardIcon;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  MainMenuButton;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlayMode;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  RestartButton;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Sandbox;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ScoreOverlay;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         RestartTime;                                       // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RestartTriggerTime;                                // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CanvasRaceEndScoreboardWidget_MainMenuButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasRaceEndScoreboardWidget_Restart_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BPOpen();
	void Construct();
	void ExecuteUbergraph_CanvasRaceEndScoreboardWidget(int32 EntryPoint);
	bool Get_RestartButton_Enable();
	ESlateVisibility Get_RestartButton_Visible();
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0(const struct FKey& Key);
	void LeaveMainMenu(bool ConfirmClicked);
	void OnEndSessionCompleteEvent(bool Success);
	void OnInitialized();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasRaceEndScoreboardWidget_C">();
	}
	static class UCanvasRaceEndScoreboardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasRaceEndScoreboardWidget_C>();
	}
};
static_assert(alignof(UCanvasRaceEndScoreboardWidget_C) == 0x000008, "Wrong alignment on UCanvasRaceEndScoreboardWidget_C");
static_assert(sizeof(UCanvasRaceEndScoreboardWidget_C) == 0x0003D0, "Wrong size on UCanvasRaceEndScoreboardWidget_C");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, UberGraphFrame) == 0x000358, "Member 'UCanvasRaceEndScoreboardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, CanvasLeaveToMenuOverlayWidget) == 0x000360, "Member 'UCanvasRaceEndScoreboardWidget_C::CanvasLeaveToMenuOverlayWidget' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, GrainFilter_41) == 0x000368, "Member 'UCanvasRaceEndScoreboardWidget_C::GrainFilter_41' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, Image_38) == 0x000370, "Member 'UCanvasRaceEndScoreboardWidget_C::Image_38' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, LeaderboardIcon) == 0x000378, "Member 'UCanvasRaceEndScoreboardWidget_C::LeaderboardIcon' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, MainMenuButton) == 0x000380, "Member 'UCanvasRaceEndScoreboardWidget_C::MainMenuButton' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, PlayMode) == 0x000388, "Member 'UCanvasRaceEndScoreboardWidget_C::PlayMode' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, RestartButton) == 0x000390, "Member 'UCanvasRaceEndScoreboardWidget_C::RestartButton' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, Sandbox) == 0x000398, "Member 'UCanvasRaceEndScoreboardWidget_C::Sandbox' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, ScoreOverlay) == 0x0003A0, "Member 'UCanvasRaceEndScoreboardWidget_C::ScoreOverlay' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, WidgetSwitcher_0) == 0x0003A8, "Member 'UCanvasRaceEndScoreboardWidget_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, HighlightableWidgets) == 0x0003B0, "Member 'UCanvasRaceEndScoreboardWidget_C::HighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, RestartTime) == 0x0003C0, "Member 'UCanvasRaceEndScoreboardWidget_C::RestartTime' has a wrong offset!");
static_assert(offsetof(UCanvasRaceEndScoreboardWidget_C, RestartTriggerTime) == 0x0003C8, "Member 'UCanvasRaceEndScoreboardWidget_C::RestartTriggerTime' has a wrong offset!");

}

