#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasPlayPartyWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasPlayPartyWidget.CanvasPlayPartyWidget_C
// 0x0068 (0x0328 - 0x02C0)
class UCanvasPlayPartyWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverInvite;                                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPlayerBadgeWidget_C*             CanvasPlayerBadgeWidget;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPlayerBadgeWidget_C*             CanvasPlayerBadgeWidget_1;                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPlayerBadgeWidget_C*             CanvasPlayerBadgeWidget_2;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPlayerBadgeWidget_C*             CanvasPlayerBadgeWidget_3;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorderInvite;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HoverSwitcherInvite;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InviteButton;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InviteButtonBorder;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyIcon;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCanvasPlayerBadgeWidget_C*>     PlayerNames;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__CanvasPlayPartyWidget_InviteButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasPlayPartyWidget_InviteButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CanvasPlayPartyWidget_InviteButton_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_CanvasPlayPartyWidget(int32 EntryPoint);
	void GetHighlightableWidgets(TArray<class UWidget*>* Widgets);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasPlayPartyWidget_C">();
	}
	static class UCanvasPlayPartyWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasPlayPartyWidget_C>();
	}
};
static_assert(alignof(UCanvasPlayPartyWidget_C) == 0x000008, "Wrong alignment on UCanvasPlayPartyWidget_C");
static_assert(sizeof(UCanvasPlayPartyWidget_C) == 0x000328, "Wrong size on UCanvasPlayPartyWidget_C");
static_assert(offsetof(UCanvasPlayPartyWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UCanvasPlayPartyWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, HoverInvite) == 0x0002C8, "Member 'UCanvasPlayPartyWidget_C::HoverInvite' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, CanvasPlayerBadgeWidget) == 0x0002D0, "Member 'UCanvasPlayPartyWidget_C::CanvasPlayerBadgeWidget' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, CanvasPlayerBadgeWidget_1) == 0x0002D8, "Member 'UCanvasPlayPartyWidget_C::CanvasPlayerBadgeWidget_1' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, CanvasPlayerBadgeWidget_2) == 0x0002E0, "Member 'UCanvasPlayPartyWidget_C::CanvasPlayerBadgeWidget_2' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, CanvasPlayerBadgeWidget_3) == 0x0002E8, "Member 'UCanvasPlayPartyWidget_C::CanvasPlayerBadgeWidget_3' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, HoverBorderInvite) == 0x0002F0, "Member 'UCanvasPlayPartyWidget_C::HoverBorderInvite' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, HoverSwitcherInvite) == 0x0002F8, "Member 'UCanvasPlayPartyWidget_C::HoverSwitcherInvite' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, InviteButton) == 0x000300, "Member 'UCanvasPlayPartyWidget_C::InviteButton' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, InviteButtonBorder) == 0x000308, "Member 'UCanvasPlayPartyWidget_C::InviteButtonBorder' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, PartyIcon) == 0x000310, "Member 'UCanvasPlayPartyWidget_C::PartyIcon' has a wrong offset!");
static_assert(offsetof(UCanvasPlayPartyWidget_C, PlayerNames) == 0x000318, "Member 'UCanvasPlayPartyWidget_C::PlayerNames' has a wrong offset!");

}

