#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasLobbyListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasLobbyListWidget.CanvasLobbyListWidget_C
// 0x0048 (0x03B8 - 0x0370)
class UCanvasLobbyListWidget_C final : public UGymGuiCanvasLobbyListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_LobbyKeyJoin_C*                     BP_LobbyKeyJoin;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ServerListWidget_C*                 BP_ServerListWidget;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GrainFilter_41;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            JoinButton;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TransparentBackground;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWidget*                                PreviousJoinButton;                                // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CanvasLobbyListWidget_JoinButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BPClose();
	void BPOpen();
	void ExecuteUbergraph_CanvasLobbyListWidget(int32 EntryPoint);
	void InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5(const struct FKey& Key);
	void IsPrevJoinButtonValid(bool* Valid);
	void ServerListUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasLobbyListWidget_C">();
	}
	static class UCanvasLobbyListWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasLobbyListWidget_C>();
	}
};
static_assert(alignof(UCanvasLobbyListWidget_C) == 0x000008, "Wrong alignment on UCanvasLobbyListWidget_C");
static_assert(sizeof(UCanvasLobbyListWidget_C) == 0x0003B8, "Wrong size on UCanvasLobbyListWidget_C");
static_assert(offsetof(UCanvasLobbyListWidget_C, UberGraphFrame) == 0x000370, "Member 'UCanvasLobbyListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasLobbyListWidget_C, BP_LobbyKeyJoin) == 0x000378, "Member 'UCanvasLobbyListWidget_C::BP_LobbyKeyJoin' has a wrong offset!");
static_assert(offsetof(UCanvasLobbyListWidget_C, BP_ServerListWidget) == 0x000380, "Member 'UCanvasLobbyListWidget_C::BP_ServerListWidget' has a wrong offset!");
static_assert(offsetof(UCanvasLobbyListWidget_C, GrainFilter_41) == 0x000388, "Member 'UCanvasLobbyListWidget_C::GrainFilter_41' has a wrong offset!");
static_assert(offsetof(UCanvasLobbyListWidget_C, JoinButton) == 0x000390, "Member 'UCanvasLobbyListWidget_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UCanvasLobbyListWidget_C, TransparentBackground) == 0x000398, "Member 'UCanvasLobbyListWidget_C::TransparentBackground' has a wrong offset!");
static_assert(offsetof(UCanvasLobbyListWidget_C, HighlightableWidgets) == 0x0003A0, "Member 'UCanvasLobbyListWidget_C::HighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UCanvasLobbyListWidget_C, PreviousJoinButton) == 0x0003B0, "Member 'UCanvasLobbyListWidget_C::PreviousJoinButton' has a wrong offset!");

}

