#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasChallengeOverlayWidget

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasChallengeOverlayWidget.CanvasChallengeOverlayWidget_C
// 0x0020 (0x0350 - 0x0330)
class UCanvasChallengeOverlayWidget_C final : public UGymGuiMetaWidget
{
public:
	class UVerticalBox*                           ChallengesBox;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_187;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_314;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasChallengeOverlayWidget_C">();
	}
	static class UCanvasChallengeOverlayWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasChallengeOverlayWidget_C>();
	}
};
static_assert(alignof(UCanvasChallengeOverlayWidget_C) == 0x000008, "Wrong alignment on UCanvasChallengeOverlayWidget_C");
static_assert(sizeof(UCanvasChallengeOverlayWidget_C) == 0x000350, "Wrong size on UCanvasChallengeOverlayWidget_C");
static_assert(offsetof(UCanvasChallengeOverlayWidget_C, ChallengesBox) == 0x000330, "Member 'UCanvasChallengeOverlayWidget_C::ChallengesBox' has a wrong offset!");
static_assert(offsetof(UCanvasChallengeOverlayWidget_C, Image_5) == 0x000338, "Member 'UCanvasChallengeOverlayWidget_C::Image_5' has a wrong offset!");
static_assert(offsetof(UCanvasChallengeOverlayWidget_C, Image_187) == 0x000340, "Member 'UCanvasChallengeOverlayWidget_C::Image_187' has a wrong offset!");
static_assert(offsetof(UCanvasChallengeOverlayWidget_C, Image_314) == 0x000348, "Member 'UCanvasChallengeOverlayWidget_C::Image_314' has a wrong offset!");

}

