#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasLeaveToMenuOverlayWidget

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CanvasLeaveToMenuOverlayWidget.CanvasLeaveToMenuOverlayWidget_C.ClickedButton__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CanvasLeaveToMenuOverlayWidget_C_ClickedButton__DelegateSignature final
{
public:
	bool                                          ConfirmClicked;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasLeaveToMenuOverlayWidget_C_ClickedButton__DelegateSignature) == 0x000001, "Wrong alignment on CanvasLeaveToMenuOverlayWidget_C_ClickedButton__DelegateSignature");
static_assert(sizeof(CanvasLeaveToMenuOverlayWidget_C_ClickedButton__DelegateSignature) == 0x000001, "Wrong size on CanvasLeaveToMenuOverlayWidget_C_ClickedButton__DelegateSignature");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_ClickedButton__DelegateSignature, ConfirmClicked) == 0x000000, "Member 'CanvasLeaveToMenuOverlayWidget_C_ClickedButton__DelegateSignature::ConfirmClicked' has a wrong offset!");

// Function CanvasLeaveToMenuOverlayWidget.CanvasLeaveToMenuOverlayWidget_C.ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget
// 0x0050 (0x0050 - 0x0000)
struct CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0018(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget) == 0x000008, "Wrong alignment on CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget");
static_assert(sizeof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget) == 0x000050, "Wrong size on CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget, EntryPoint) == 0x000000, "Member 'CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget, K2Node_InputActionEvent_Key) == 0x000018, "Member 'CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget, CallFunc_IsVisible_ReturnValue) == 0x000030, "Member 'CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget, K2Node_CustomEvent_InVisibility) == 0x000031, "Member 'CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget, K2Node_MakeArray_Array) == 0x000038, "Member 'CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'CanvasLeaveToMenuOverlayWidget_C_ExecuteUbergraph_CanvasLeaveToMenuOverlayWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function CanvasLeaveToMenuOverlayWidget.CanvasLeaveToMenuOverlayWidget_C.InpActEvt_Exit_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct CanvasLeaveToMenuOverlayWidget_C_InpActEvt_Exit_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CanvasLeaveToMenuOverlayWidget_C_InpActEvt_Exit_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on CanvasLeaveToMenuOverlayWidget_C_InpActEvt_Exit_K2Node_InputActionEvent_0");
static_assert(sizeof(CanvasLeaveToMenuOverlayWidget_C_InpActEvt_Exit_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on CanvasLeaveToMenuOverlayWidget_C_InpActEvt_Exit_K2Node_InputActionEvent_0");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_InpActEvt_Exit_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'CanvasLeaveToMenuOverlayWidget_C_InpActEvt_Exit_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function CanvasLeaveToMenuOverlayWidget.CanvasLeaveToMenuOverlayWidget_C.OnOverlayVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct CanvasLeaveToMenuOverlayWidget_C_OnOverlayVisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasLeaveToMenuOverlayWidget_C_OnOverlayVisibilityChanged) == 0x000001, "Wrong alignment on CanvasLeaveToMenuOverlayWidget_C_OnOverlayVisibilityChanged");
static_assert(sizeof(CanvasLeaveToMenuOverlayWidget_C_OnOverlayVisibilityChanged) == 0x000001, "Wrong size on CanvasLeaveToMenuOverlayWidget_C_OnOverlayVisibilityChanged");
static_assert(offsetof(CanvasLeaveToMenuOverlayWidget_C_OnOverlayVisibilityChanged, InVisibility) == 0x000000, "Member 'CanvasLeaveToMenuOverlayWidget_C_OnOverlayVisibilityChanged::InVisibility' has a wrong offset!");

}

