#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasPartyOverlayWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasPartyOverlayWidget.CanvasPartyOverlayWidget_C
// 0x0060 (0x0320 - 0x02C0)
class UCanvasPartyOverlayWidget_C final : public UGymGuiCanvasPartyOverlayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_PlaymenuButton_C*                  BackButton;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ButtonList;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  CancelQuitButton;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  ConfirmQuitButton;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HamburgerBackgroundButton;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Message;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Message_1;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  QuitButton;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           QuitConfirmPopup;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningIcon;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GymGuiMetaPopupHelper_C*           WBP_GymGuiMetaPopupHelper;                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__CanvasPartyOverlayWidget_BackButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__CanvasPartyOverlayWidget_CancelQuitButton_K2Node_ComponentBoundEvent_27_OnClicked__DelegateSignature();
	void BndEvt__CanvasPartyOverlayWidget_ConfirmQuitButton_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature();
	void BndEvt__CanvasPartyOverlayWidget_QuitButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_CanvasPartyOverlayWidget(int32 EntryPoint);
	void InpActEvt_Exit_K2Node_InputActionEvent_0(const struct FKey& Key);
	void OnOverlayVisibilityChanged(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasPartyOverlayWidget_C">();
	}
	static class UCanvasPartyOverlayWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasPartyOverlayWidget_C>();
	}
};
static_assert(alignof(UCanvasPartyOverlayWidget_C) == 0x000008, "Wrong alignment on UCanvasPartyOverlayWidget_C");
static_assert(sizeof(UCanvasPartyOverlayWidget_C) == 0x000320, "Wrong size on UCanvasPartyOverlayWidget_C");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UCanvasPartyOverlayWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, BackButton) == 0x0002C8, "Member 'UCanvasPartyOverlayWidget_C::BackButton' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, ButtonList) == 0x0002D0, "Member 'UCanvasPartyOverlayWidget_C::ButtonList' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, CancelQuitButton) == 0x0002D8, "Member 'UCanvasPartyOverlayWidget_C::CancelQuitButton' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, ConfirmQuitButton) == 0x0002E0, "Member 'UCanvasPartyOverlayWidget_C::ConfirmQuitButton' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, HamburgerBackgroundButton) == 0x0002E8, "Member 'UCanvasPartyOverlayWidget_C::HamburgerBackgroundButton' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, Message) == 0x0002F0, "Member 'UCanvasPartyOverlayWidget_C::Message' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, Message_1) == 0x0002F8, "Member 'UCanvasPartyOverlayWidget_C::Message_1' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, QuitButton) == 0x000300, "Member 'UCanvasPartyOverlayWidget_C::QuitButton' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, QuitConfirmPopup) == 0x000308, "Member 'UCanvasPartyOverlayWidget_C::QuitConfirmPopup' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, WarningIcon) == 0x000310, "Member 'UCanvasPartyOverlayWidget_C::WarningIcon' has a wrong offset!");
static_assert(offsetof(UCanvasPartyOverlayWidget_C, WBP_GymGuiMetaPopupHelper) == 0x000318, "Member 'UCanvasPartyOverlayWidget_C::WBP_GymGuiMetaPopupHelper' has a wrong offset!");

}

