#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasTOSOverlayWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasTOSOverlayWidget.CanvasTOSOverlayWidget_C
// 0x0088 (0x03B8 - 0x0330)
class UCanvasTOSOverlayWidget_C final : public UGymGuiMetaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_PlaymenuButton_C*                  AcceptButton;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  DeclineButton;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HamburgerBackgroundButton;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_77;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Message_1;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Message_2;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   TOSBlock;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TOSConfirmPopup;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnTOSAccepted;                                     // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        ScrollValue;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScrollSpeed;                                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              LastTickInput;                                     // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnTOSAccepted_Event(bool Success);
	void OnTOSAccepted__DelegateSignature();
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_6(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3(const struct FKey& Key);
	void ExecuteUbergraph_CanvasTOSOverlayWidget(int32 EntryPoint);
	void Construct();
	void BndEvt__CanvasTOSOverlayWidget_CancelQuitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__CanvasPartyOverlayWidget_ConfirmQuitButton_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasTOSOverlayWidget_C">();
	}
	static class UCanvasTOSOverlayWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasTOSOverlayWidget_C>();
	}
};
static_assert(alignof(UCanvasTOSOverlayWidget_C) == 0x000008, "Wrong alignment on UCanvasTOSOverlayWidget_C");
static_assert(sizeof(UCanvasTOSOverlayWidget_C) == 0x0003B8, "Wrong size on UCanvasTOSOverlayWidget_C");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, UberGraphFrame) == 0x000330, "Member 'UCanvasTOSOverlayWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, AcceptButton) == 0x000338, "Member 'UCanvasTOSOverlayWidget_C::AcceptButton' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, DeclineButton) == 0x000340, "Member 'UCanvasTOSOverlayWidget_C::DeclineButton' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, HamburgerBackgroundButton) == 0x000348, "Member 'UCanvasTOSOverlayWidget_C::HamburgerBackgroundButton' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, Image_77) == 0x000350, "Member 'UCanvasTOSOverlayWidget_C::Image_77' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, Message_1) == 0x000358, "Member 'UCanvasTOSOverlayWidget_C::Message_1' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, Message_2) == 0x000360, "Member 'UCanvasTOSOverlayWidget_C::Message_2' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, ScrollBox) == 0x000368, "Member 'UCanvasTOSOverlayWidget_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, TOSBlock) == 0x000370, "Member 'UCanvasTOSOverlayWidget_C::TOSBlock' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, TOSConfirmPopup) == 0x000378, "Member 'UCanvasTOSOverlayWidget_C::TOSConfirmPopup' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, OnTOSAccepted) == 0x000380, "Member 'UCanvasTOSOverlayWidget_C::OnTOSAccepted' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, HighlightableWidgets) == 0x000390, "Member 'UCanvasTOSOverlayWidget_C::HighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, ScrollValue) == 0x0003A0, "Member 'UCanvasTOSOverlayWidget_C::ScrollValue' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, ScrollSpeed) == 0x0003A8, "Member 'UCanvasTOSOverlayWidget_C::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UCanvasTOSOverlayWidget_C, LastTickInput) == 0x0003B0, "Member 'UCanvasTOSOverlayWidget_C::LastTickInput' has a wrong offset!");

}

