#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasLocalizationToggleWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function CanvasLocalizationToggleWidget.CanvasLocalizationToggleWidget_C.ExecuteUbergraph_CanvasLocalizationToggleWidget
// 0x0030 (0x0030 - 0x0000)
struct CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_2;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_3;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_4;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_5;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_6;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_7;          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_8;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue_9;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_1; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_2; // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_3; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_4; // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_5; // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_6; // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_7; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_8; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLanguageAndLocale_ReturnValue_9; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget) == 0x000008, "Wrong alignment on CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget");
static_assert(sizeof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget) == 0x000030, "Wrong size on CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, EntryPoint) == 0x000000, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue) == 0x000004, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue) == 0x000005, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_GetCurrentCulture_ReturnValue) == 0x000008, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, K2Node_SwitchString_CmpSuccess) == 0x000018, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_1) == 0x000019, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_2) == 0x00001A, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_3) == 0x00001B, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_4) == 0x00001C, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_5) == 0x00001D, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_6) == 0x00001E, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_7) == 0x00001F, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_8) == 0x000020, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentCulture_ReturnValue_9) == 0x000021, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentCulture_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_1) == 0x000022, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_2) == 0x000023, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_3) == 0x000024, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_4) == 0x000025, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_5) == 0x000026, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_6) == 0x000027, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_7) == 0x000028, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_8) == 0x000029, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget, CallFunc_SetCurrentLanguageAndLocale_ReturnValue_9) == 0x00002A, "Member 'CanvasLocalizationToggleWidget_C_ExecuteUbergraph_CanvasLocalizationToggleWidget::CallFunc_SetCurrentLanguageAndLocale_ReturnValue_9' has a wrong offset!");

// Function CanvasLocalizationToggleWidget.CanvasLocalizationToggleWidget_C.UpdateSelectedButton
// 0x0010 (0x0010 - 0x0000)
struct CanvasLocalizationToggleWidget_C_UpdateSelectedButton final
{
public:
	class UWBP_CultureSelectionButton_C*          NewSelectedButton;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasLocalizationToggleWidget_C_UpdateSelectedButton) == 0x000008, "Wrong alignment on CanvasLocalizationToggleWidget_C_UpdateSelectedButton");
static_assert(sizeof(CanvasLocalizationToggleWidget_C_UpdateSelectedButton) == 0x000010, "Wrong size on CanvasLocalizationToggleWidget_C_UpdateSelectedButton");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_UpdateSelectedButton, NewSelectedButton) == 0x000000, "Member 'CanvasLocalizationToggleWidget_C_UpdateSelectedButton::NewSelectedButton' has a wrong offset!");
static_assert(offsetof(CanvasLocalizationToggleWidget_C_UpdateSelectedButton, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'CanvasLocalizationToggleWidget_C_UpdateSelectedButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

