#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasMasterMenuWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function CanvasMasterMenuWidget.CanvasMasterMenuWidget_C.CreateTabButton
// 0x0030 (0x0030 - 0x0000)
struct CanvasMasterMenuWidget_C_CreateTabButton final
{
public:
	class FText                                   ButtonTitle;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         TabIndex;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiMainMenuWidget*                  MainPanel;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasMasterMenuWidget_C_CreateTabButton) == 0x000008, "Wrong alignment on CanvasMasterMenuWidget_C_CreateTabButton");
static_assert(sizeof(CanvasMasterMenuWidget_C_CreateTabButton) == 0x000030, "Wrong size on CanvasMasterMenuWidget_C_CreateTabButton");
static_assert(offsetof(CanvasMasterMenuWidget_C_CreateTabButton, ButtonTitle) == 0x000000, "Member 'CanvasMasterMenuWidget_C_CreateTabButton::ButtonTitle' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_CreateTabButton, TabIndex) == 0x000018, "Member 'CanvasMasterMenuWidget_C_CreateTabButton::TabIndex' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_CreateTabButton, MainPanel) == 0x000020, "Member 'CanvasMasterMenuWidget_C_CreateTabButton::MainPanel' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_CreateTabButton, Hidden) == 0x000028, "Member 'CanvasMasterMenuWidget_C_CreateTabButton::Hidden' has a wrong offset!");

// Function CanvasMasterMenuWidget.CanvasMasterMenuWidget_C.ExecuteUbergraph_CanvasMasterMenuWidget
// 0x00A8 (0x00A8 - 0x0000)
struct CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	class UMasterMenuTabButtonBP_C*               CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_ButtonTitle;                          // 0x0038(0x0018)(ConstParm)
	int32                                         K2Node_Event_TabIndex;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGuiMainMenuWidget*                  K2Node_Event_MainPanel;                            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Hidden;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientAdmin_ReturnValue;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget) == 0x000008, "Wrong alignment on CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget");
static_assert(sizeof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget) == 0x0000A8, "Wrong size on CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, EntryPoint) == 0x000000, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x000004, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, Temp_byte_Variable) == 0x000005, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, K2Node_InputActionEvent_Key) == 0x000008, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, Temp_int_Variable) == 0x000028, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, K2Node_Event_ButtonTitle) == 0x000038, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::K2Node_Event_ButtonTitle' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, K2Node_Event_TabIndex) == 0x000050, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::K2Node_Event_TabIndex' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, K2Node_Event_MainPanel) == 0x000058, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::K2Node_Event_MainPanel' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, K2Node_Event_Hidden) == 0x000060, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::K2Node_Event_Hidden' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, Temp_byte_Variable_1) == 0x000068, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, Temp_bool_Variable) == 0x000069, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, K2Node_Select_Default) == 0x00006A, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000080, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000088, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget, CallFunc_IsClientAdmin_ReturnValue) == 0x0000A0, "Member 'CanvasMasterMenuWidget_C_ExecuteUbergraph_CanvasMasterMenuWidget::CallFunc_IsClientAdmin_ReturnValue' has a wrong offset!");

// Function CanvasMasterMenuWidget.CanvasMasterMenuWidget_C.Get_CreateSessionNameTextBox_Text_0
// 0x0048 (0x0048 - 0x0000)
struct CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0) == 0x000008, "Wrong alignment on CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0");
static_assert(sizeof(CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0) == 0x000048, "Wrong size on CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0, ReturnValue) == 0x000000, "Member 'CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0, CallFunc_GetPlayerName_ReturnValue) == 0x000020, "Member 'CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'CanvasMasterMenuWidget_C_Get_CreateSessionNameTextBox_Text_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function CanvasMasterMenuWidget.CanvasMasterMenuWidget_C.Get_SupermovesLogo_Brush
// 0x00D0 (0x00D0 - 0x0000)
struct CanvasMasterMenuWidget_C_Get_SupermovesLogo_Brush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_Brush) == 0x000010, "Wrong alignment on CanvasMasterMenuWidget_C_Get_SupermovesLogo_Brush");
static_assert(sizeof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_Brush) == 0x0000D0, "Wrong size on CanvasMasterMenuWidget_C_Get_SupermovesLogo_Brush");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_Brush, ReturnValue) == 0x000000, "Member 'CanvasMasterMenuWidget_C_Get_SupermovesLogo_Brush::ReturnValue' has a wrong offset!");

// Function CanvasMasterMenuWidget.CanvasMasterMenuWidget_C.Get_SupermovesLogo_ColorAndOpacity
// 0x0030 (0x0030 - 0x0000)
struct CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientAdmin_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity) == 0x000008, "Wrong alignment on CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity");
static_assert(sizeof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity) == 0x000030, "Wrong size on CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity, ReturnValue) == 0x000000, "Member 'CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity::ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity, CallFunc_IsClientAdmin_ReturnValue) == 0x000018, "Member 'CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity::CallFunc_IsClientAdmin_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity, CallFunc_SelectColor_ReturnValue) == 0x00001C, "Member 'CanvasMasterMenuWidget_C_Get_SupermovesLogo_ColorAndOpacity::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function CanvasMasterMenuWidget.CanvasMasterMenuWidget_C.InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct CanvasMasterMenuWidget_C_InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CanvasMasterMenuWidget_C_InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on CanvasMasterMenuWidget_C_InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0");
static_assert(sizeof(CanvasMasterMenuWidget_C_InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on CanvasMasterMenuWidget_C_InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0");
static_assert(offsetof(CanvasMasterMenuWidget_C_InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'CanvasMasterMenuWidget_C_InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function CanvasMasterMenuWidget.CanvasMasterMenuWidget_C.OnMouseButtonDown_0
// 0x0168 (0x0168 - 0x0000)
struct CanvasMasterMenuWidget_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(CanvasMasterMenuWidget_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on CanvasMasterMenuWidget_C_OnMouseButtonDown_0");
static_assert(sizeof(CanvasMasterMenuWidget_C_OnMouseButtonDown_0) == 0x000168, "Wrong size on CanvasMasterMenuWidget_C_OnMouseButtonDown_0");
static_assert(offsetof(CanvasMasterMenuWidget_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'CanvasMasterMenuWidget_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'CanvasMasterMenuWidget_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(CanvasMasterMenuWidget_C_OnMouseButtonDown_0, ReturnValue) == 0x0000B0, "Member 'CanvasMasterMenuWidget_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");

}

