#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasPlayerBadgeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasPlayerBadgeWidget.CanvasPlayerBadgeWidget_C
// 0x0080 (0x0340 - 0x02C0)
class UCanvasPlayerBadgeWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AvatarLeader;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AvatarPlayer;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        AvatarSwitcher;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HoverSwitcher;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlayerBadgeButton;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName_Text;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymPlayerPartyInfo                    Info;                                              // 0x0308(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__CanvasPlayerBadgeWidget_PlayerBadgeButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasPlayerBadgeWidget_PlayerBadgeButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CanvasPlayerBadgeWidget_PlayerBadgeButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_CanvasPlayerBadgeWidget(int32 EntryPoint);
	void SetDetails(const struct FGymPlayerPartyInfo& Info_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasPlayerBadgeWidget_C">();
	}
	static class UCanvasPlayerBadgeWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasPlayerBadgeWidget_C>();
	}
};
static_assert(alignof(UCanvasPlayerBadgeWidget_C) == 0x000008, "Wrong alignment on UCanvasPlayerBadgeWidget_C");
static_assert(sizeof(UCanvasPlayerBadgeWidget_C) == 0x000340, "Wrong size on UCanvasPlayerBadgeWidget_C");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UCanvasPlayerBadgeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, Hover) == 0x0002C8, "Member 'UCanvasPlayerBadgeWidget_C::Hover' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, AvatarLeader) == 0x0002D0, "Member 'UCanvasPlayerBadgeWidget_C::AvatarLeader' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, AvatarPlayer) == 0x0002D8, "Member 'UCanvasPlayerBadgeWidget_C::AvatarPlayer' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, AvatarSwitcher) == 0x0002E0, "Member 'UCanvasPlayerBadgeWidget_C::AvatarSwitcher' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, HoverBorder) == 0x0002E8, "Member 'UCanvasPlayerBadgeWidget_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, HoverSwitcher) == 0x0002F0, "Member 'UCanvasPlayerBadgeWidget_C::HoverSwitcher' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, PlayerBadgeButton) == 0x0002F8, "Member 'UCanvasPlayerBadgeWidget_C::PlayerBadgeButton' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, PlayerName_Text) == 0x000300, "Member 'UCanvasPlayerBadgeWidget_C::PlayerName_Text' has a wrong offset!");
static_assert(offsetof(UCanvasPlayerBadgeWidget_C, Info) == 0x000308, "Member 'UCanvasPlayerBadgeWidget_C::Info' has a wrong offset!");

}

