#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasMasterMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CanvasMasterMenuWidget.CanvasMasterMenuWidget_C
// 0x00A0 (0x0408 - 0x0368)
class UCanvasMasterMenuWidget_C final : public UGymGuiMasterMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverSettings;                                     // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverHamburger;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasBuildInfoWidget_C*               CanvasBuildInfoWidget;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPartyOverlayWidget_C*            CanvasPartyOverlayWidget;                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CogIcon;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_205;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_284;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       CreateSessionNameTextBox;                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasOptionsMenuWidget_C*             DebugOptionsMenu;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HamburgIcon;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_351;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputPrompt_Close;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputPrompt_Settings;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoginButton;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SecretAdminButton;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SupermovesLogo;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TopButtonBox;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AdminMenu_C*                       WBP_AdminMenu;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         AdminClicked;                                      // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CanvasMasterMenuWidget_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasMasterMenuWidget_CogButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CanvasMasterMenuWidget_CogButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CanvasMasterMenuWidget_DebugOptionsMenubutton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CanvasMasterMenuWidget_HamburgerButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CanvasMasterMenuWidget_HamburgerButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void CreateTabButton(const class FText& ButtonTitle, int32 TabIndex, class UGymGuiMainMenuWidget* MainPanel, bool Hidden);
	void ExecuteUbergraph_CanvasMasterMenuWidget(int32 EntryPoint);
	class FText Get_CreateSessionNameTextBox_Text_0();
	struct FSlateBrush Get_SupermovesLogo_Brush();
	struct FLinearColor Get_SupermovesLogo_ColorAndOpacity();
	void InpActEvt_UIGamepadSpecialRight_K2Node_InputActionEvent_0(const struct FKey& Key);
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CanvasMasterMenuWidget_C">();
	}
	static class UCanvasMasterMenuWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasMasterMenuWidget_C>();
	}
};
static_assert(alignof(UCanvasMasterMenuWidget_C) == 0x000008, "Wrong alignment on UCanvasMasterMenuWidget_C");
static_assert(sizeof(UCanvasMasterMenuWidget_C) == 0x000408, "Wrong size on UCanvasMasterMenuWidget_C");
static_assert(offsetof(UCanvasMasterMenuWidget_C, UberGraphFrame) == 0x000368, "Member 'UCanvasMasterMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, HoverSettings) == 0x000370, "Member 'UCanvasMasterMenuWidget_C::HoverSettings' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, HoverHamburger) == 0x000378, "Member 'UCanvasMasterMenuWidget_C::HoverHamburger' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, CanvasBuildInfoWidget) == 0x000380, "Member 'UCanvasMasterMenuWidget_C::CanvasBuildInfoWidget' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, CanvasPartyOverlayWidget) == 0x000388, "Member 'UCanvasMasterMenuWidget_C::CanvasPartyOverlayWidget' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, CogIcon) == 0x000390, "Member 'UCanvasMasterMenuWidget_C::CogIcon' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, CommonActionWidget_205) == 0x000398, "Member 'UCanvasMasterMenuWidget_C::CommonActionWidget_205' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, CommonActionWidget_284) == 0x0003A0, "Member 'UCanvasMasterMenuWidget_C::CommonActionWidget_284' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, CreateSessionNameTextBox) == 0x0003A8, "Member 'UCanvasMasterMenuWidget_C::CreateSessionNameTextBox' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, DebugOptionsMenu) == 0x0003B0, "Member 'UCanvasMasterMenuWidget_C::DebugOptionsMenu' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, HamburgIcon) == 0x0003B8, "Member 'UCanvasMasterMenuWidget_C::HamburgIcon' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, Image_351) == 0x0003C0, "Member 'UCanvasMasterMenuWidget_C::Image_351' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, InputPrompt_Close) == 0x0003C8, "Member 'UCanvasMasterMenuWidget_C::InputPrompt_Close' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, InputPrompt_Settings) == 0x0003D0, "Member 'UCanvasMasterMenuWidget_C::InputPrompt_Settings' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, LoginButton) == 0x0003D8, "Member 'UCanvasMasterMenuWidget_C::LoginButton' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, SecretAdminButton) == 0x0003E0, "Member 'UCanvasMasterMenuWidget_C::SecretAdminButton' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, SupermovesLogo) == 0x0003E8, "Member 'UCanvasMasterMenuWidget_C::SupermovesLogo' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, TopButtonBox) == 0x0003F0, "Member 'UCanvasMasterMenuWidget_C::TopButtonBox' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, WBP_AdminMenu) == 0x0003F8, "Member 'UCanvasMasterMenuWidget_C::WBP_AdminMenu' has a wrong offset!");
static_assert(offsetof(UCanvasMasterMenuWidget_C, AdminClicked) == 0x000400, "Member 'UCanvasMasterMenuWidget_C::AdminClicked' has a wrong offset!");

}

