#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CanvasPlayerBadgeScoreboardWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CanvasPlayerBadgeScoreboardWidget.CanvasPlayerBadgeScoreboardWidget_C.EditorRightsChanged
// 0x0008 (0x0008 - 0x0000)
struct CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged final
{
public:
	bool                                          RightS;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged) == 0x000004, "Wrong alignment on CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged");
static_assert(sizeof(CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged) == 0x000008, "Wrong size on CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged, RightS) == 0x000000, "Member 'CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged::RightS' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'CanvasPlayerBadgeScoreboardWidget_C_EditorRightsChanged::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function CanvasPlayerBadgeScoreboardWidget.CanvasPlayerBadgeScoreboardWidget_C.ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget
// 0x0048 (0x0048 - 0x0000)
struct CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bAllowed)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEditAllowed_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerState*                        K2Node_DynamicCast_AsGym_Player_State;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerState*                        K2Node_DynamicCast_AsGym_Player_State_1;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget) == 0x000008, "Wrong alignment on CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget");
static_assert(sizeof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget) == 0x000048, "Wrong size on CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, EntryPoint) == 0x000000, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, CallFunc_GetEditAllowed_ReturnValue) == 0x000020, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::CallFunc_GetEditAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, K2Node_DynamicCast_AsGym_Player_State) == 0x000028, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::K2Node_DynamicCast_AsGym_Player_State' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, K2Node_DynamicCast_AsGym_Player_State_1) == 0x000038, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::K2Node_DynamicCast_AsGym_Player_State_1' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'CanvasPlayerBadgeScoreboardWidget_C_ExecuteUbergraph_CanvasPlayerBadgeScoreboardWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function CanvasPlayerBadgeScoreboardWidget.CanvasPlayerBadgeScoreboardWidget_C.SetInfo
// 0x00A8 (0x00A8 - 0x0000)
struct CanvasPlayerBadgeScoreboardWidget_C_SetInfo final
{
public:
	class AGymPlayerState*                        Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEditAllowed_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bAllowed)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerId_ReturnValue;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerState*                        K2Node_DynamicCast_AsGym_Player_State;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerId_ReturnValue_1;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwner_ReturnValue;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwner_ReturnValue_1;                    // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo) == 0x000008, "Wrong alignment on CanvasPlayerBadgeScoreboardWidget_C_SetInfo");
static_assert(sizeof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo) == 0x0000A8, "Wrong size on CanvasPlayerBadgeScoreboardWidget_C_SetInfo");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, Player_0) == 0x000000, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::Player_0' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, Temp_byte_Variable) == 0x000008, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_GetEditAllowed_ReturnValue) == 0x000009, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_GetEditAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_GetPlayerName_ReturnValue) == 0x000010, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, Temp_bool_Variable) == 0x000020, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, Temp_byte_Variable_1) == 0x000040, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, Temp_byte_Variable_2) == 0x000041, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, Temp_byte_Variable_3) == 0x000054, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_GetPlayerId_ReturnValue) == 0x000058, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, Temp_bool_Variable_1) == 0x00005C, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_Not_PreBool_ReturnValue) == 0x00005D, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000068, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_Not_PreBool_ReturnValue_1) == 0x000081, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, K2Node_DynamicCast_AsGym_Player_State) == 0x000088, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::K2Node_DynamicCast_AsGym_Player_State' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_GetPlayerId_ReturnValue_1) == 0x000094, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_GetPlayerId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000098, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000099, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_IsOwner_ReturnValue) == 0x00009A, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_IsOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_IsOwner_ReturnValue_1) == 0x00009B, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_IsOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_BooleanOR_ReturnValue) == 0x00009C, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_BooleanAND_ReturnValue) == 0x00009D, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_BooleanAND_ReturnValue_1) == 0x00009E, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_BooleanAND_ReturnValue_2) == 0x00009F, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, K2Node_Select_Default) == 0x0000A0, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, CallFunc_BooleanAND_ReturnValue_3) == 0x0000A1, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CanvasPlayerBadgeScoreboardWidget_C_SetInfo, K2Node_Select_Default_1) == 0x0000A2, "Member 'CanvasPlayerBadgeScoreboardWidget_C_SetInfo::K2Node_Select_Default_1' has a wrong offset!");

}

