#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CareerContentData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct CareerContentData.CareerContentData
// 0x0050 (0x0050 - 0x0000)
struct FCareerContentData final
{
public:
	TArray<class FString>                         Races_6_5B5DBDAA46F124F68DDE0D80FE491FEB;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FString                                 GoalMap_9_E57683DC4C7664970B21EDB461F72DDB;        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         RequiredPoints_14_4688B2A24AC42E697A75198FD46B98F1; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName_17_6A4775534A4AB7CF84033083FD8F4F0F;   // 0x0028(0x0018)(Edit, BlueprintVisible)
	class FString                                 LastLocationId_20_E912905A4D6902A05CE3958BF62F8A16; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FCareerContentData) == 0x000008, "Wrong alignment on FCareerContentData");
static_assert(sizeof(FCareerContentData) == 0x000050, "Wrong size on FCareerContentData");
static_assert(offsetof(FCareerContentData, Races_6_5B5DBDAA46F124F68DDE0D80FE491FEB) == 0x000000, "Member 'FCareerContentData::Races_6_5B5DBDAA46F124F68DDE0D80FE491FEB' has a wrong offset!");
static_assert(offsetof(FCareerContentData, GoalMap_9_E57683DC4C7664970B21EDB461F72DDB) == 0x000010, "Member 'FCareerContentData::GoalMap_9_E57683DC4C7664970B21EDB461F72DDB' has a wrong offset!");
static_assert(offsetof(FCareerContentData, RequiredPoints_14_4688B2A24AC42E697A75198FD46B98F1) == 0x000020, "Member 'FCareerContentData::RequiredPoints_14_4688B2A24AC42E697A75198FD46B98F1' has a wrong offset!");
static_assert(offsetof(FCareerContentData, DisplayName_17_6A4775534A4AB7CF84033083FD8F4F0F) == 0x000028, "Member 'FCareerContentData::DisplayName_17_6A4775534A4AB7CF84033083FD8F4F0F' has a wrong offset!");
static_assert(offsetof(FCareerContentData, LastLocationId_20_E912905A4D6902A05CE3958BF62F8A16) == 0x000040, "Member 'FCareerContentData::LastLocationId_20_E912905A4D6902A05CE3958BF62F8A16' has a wrong offset!");

}

