#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckpointCounter_WBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CheckpointCounter_WBP.CheckpointCounter_WBP_C
// 0x0030 (0x02F0 - 0x02C0)
class UCheckpointCounter_WBP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CounterText;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentCheckpoint;                                 // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGymRuleParticipantState                      LastTickState;                                     // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymGameState*                          GameState;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   Controller;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGymGuiRuleStateWidget*                 RuleStateParent;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CheckpointCounter_WBP(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetCounterText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CheckpointCounter_WBP_C">();
	}
	static class UCheckpointCounter_WBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheckpointCounter_WBP_C>();
	}
};
static_assert(alignof(UCheckpointCounter_WBP_C) == 0x000008, "Wrong alignment on UCheckpointCounter_WBP_C");
static_assert(sizeof(UCheckpointCounter_WBP_C) == 0x0002F0, "Wrong size on UCheckpointCounter_WBP_C");
static_assert(offsetof(UCheckpointCounter_WBP_C, UberGraphFrame) == 0x0002C0, "Member 'UCheckpointCounter_WBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCheckpointCounter_WBP_C, CounterText) == 0x0002C8, "Member 'UCheckpointCounter_WBP_C::CounterText' has a wrong offset!");
static_assert(offsetof(UCheckpointCounter_WBP_C, CurrentCheckpoint) == 0x0002D0, "Member 'UCheckpointCounter_WBP_C::CurrentCheckpoint' has a wrong offset!");
static_assert(offsetof(UCheckpointCounter_WBP_C, LastTickState) == 0x0002D4, "Member 'UCheckpointCounter_WBP_C::LastTickState' has a wrong offset!");
static_assert(offsetof(UCheckpointCounter_WBP_C, GameState) == 0x0002D8, "Member 'UCheckpointCounter_WBP_C::GameState' has a wrong offset!");
static_assert(offsetof(UCheckpointCounter_WBP_C, Controller) == 0x0002E0, "Member 'UCheckpointCounter_WBP_C::Controller' has a wrong offset!");
static_assert(offsetof(UCheckpointCounter_WBP_C, RuleStateParent) == 0x0002E8, "Member 'UCheckpointCounter_WBP_C::RuleStateParent' has a wrong offset!");

}

