#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CircularBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AbstractWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CircularBar.CircularBar_C
// 0x0020 (0x0370 - 0x0350)
class UCircularBar_C final : public UAbstractWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CircularBar_C;                      // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 RealBar;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Width;                                             // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Smoothness;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CircularBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CircularBar_C">();
	}
	static class UCircularBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCircularBar_C>();
	}
};
static_assert(alignof(UCircularBar_C) == 0x000008, "Wrong alignment on UCircularBar_C");
static_assert(sizeof(UCircularBar_C) == 0x000370, "Wrong size on UCircularBar_C");
static_assert(offsetof(UCircularBar_C, UberGraphFrame_CircularBar_C) == 0x000350, "Member 'UCircularBar_C::UberGraphFrame_CircularBar_C' has a wrong offset!");
static_assert(offsetof(UCircularBar_C, RealBar) == 0x000358, "Member 'UCircularBar_C::RealBar' has a wrong offset!");
static_assert(offsetof(UCircularBar_C, Width) == 0x000360, "Member 'UCircularBar_C::Width' has a wrong offset!");
static_assert(offsetof(UCircularBar_C, Smoothness) == 0x000368, "Member 'UCircularBar_C::Smoothness' has a wrong offset!");

}

