#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CircularBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CircularBar.CircularBar_C.ExecuteUbergraph_CircularBar
// 0x0058 (0x0058 - 0x0000)
struct CircularBar_C_ExecuteUbergraph_CircularBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircularBar_C_ExecuteUbergraph_CircularBar) == 0x000008, "Wrong alignment on CircularBar_C_ExecuteUbergraph_CircularBar");
static_assert(sizeof(CircularBar_C_ExecuteUbergraph_CircularBar) == 0x000058, "Wrong size on CircularBar_C_ExecuteUbergraph_CircularBar");
static_assert(offsetof(CircularBar_C_ExecuteUbergraph_CircularBar, EntryPoint) == 0x000000, "Member 'CircularBar_C_ExecuteUbergraph_CircularBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(CircularBar_C_ExecuteUbergraph_CircularBar, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CircularBar_C_ExecuteUbergraph_CircularBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CircularBar_C_ExecuteUbergraph_CircularBar, K2Node_Event_MyGeometry) == 0x000008, "Member 'CircularBar_C_ExecuteUbergraph_CircularBar::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CircularBar_C_ExecuteUbergraph_CircularBar, K2Node_Event_InDeltaTime) == 0x000040, "Member 'CircularBar_C_ExecuteUbergraph_CircularBar::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(CircularBar_C_ExecuteUbergraph_CircularBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'CircularBar_C_ExecuteUbergraph_CircularBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CircularBar_C_ExecuteUbergraph_CircularBar, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000050, "Member 'CircularBar_C_ExecuteUbergraph_CircularBar::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CircularBar_C_ExecuteUbergraph_CircularBar, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000054, "Member 'CircularBar_C_ExecuteUbergraph_CircularBar::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function CircularBar.CircularBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CircularBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircularBar_C_PreConstruct) == 0x000001, "Wrong alignment on CircularBar_C_PreConstruct");
static_assert(sizeof(CircularBar_C_PreConstruct) == 0x000001, "Wrong size on CircularBar_C_PreConstruct");
static_assert(offsetof(CircularBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CircularBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CircularBar.CircularBar_C.Tick
// 0x003C (0x003C - 0x0000)
struct CircularBar_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircularBar_C_Tick) == 0x000004, "Wrong alignment on CircularBar_C_Tick");
static_assert(sizeof(CircularBar_C_Tick) == 0x00003C, "Wrong size on CircularBar_C_Tick");
static_assert(offsetof(CircularBar_C_Tick, MyGeometry) == 0x000000, "Member 'CircularBar_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CircularBar_C_Tick, InDeltaTime) == 0x000038, "Member 'CircularBar_C_Tick::InDeltaTime' has a wrong offset!");

// Function CircularBar.CircularBar_C.UpdateStyle
// 0x0008 (0x0008 - 0x0000)
struct CircularBar_C_UpdateStyle final
{
public:
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircularBar_C_UpdateStyle) == 0x000004, "Wrong alignment on CircularBar_C_UpdateStyle");
static_assert(sizeof(CircularBar_C_UpdateStyle) == 0x000008, "Wrong size on CircularBar_C_UpdateStyle");
static_assert(offsetof(CircularBar_C_UpdateStyle, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000000, "Member 'CircularBar_C_UpdateStyle::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CircularBar_C_UpdateStyle, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000004, "Member 'CircularBar_C_UpdateStyle::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

}

