#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClientEntryMap

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function ClientEntryMap.ClientEntryMap_C.SteamTicketReceived
// 0x0018 (0x0018 - 0x0000)
struct ClientEntryMap_C_SteamTicketReceived final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Ticket;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ClientEntryMap_C_SteamTicketReceived) == 0x000008, "Wrong alignment on ClientEntryMap_C_SteamTicketReceived");
static_assert(sizeof(ClientEntryMap_C_SteamTicketReceived) == 0x000018, "Wrong size on ClientEntryMap_C_SteamTicketReceived");
static_assert(offsetof(ClientEntryMap_C_SteamTicketReceived, Success) == 0x000000, "Member 'ClientEntryMap_C_SteamTicketReceived::Success' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_SteamTicketReceived, Ticket) == 0x000008, "Member 'ClientEntryMap_C_SteamTicketReceived::Ticket' has a wrong offset!");

// Function ClientEntryMap.ClientEntryMap_C.OnLoginComplete
// 0x0001 (0x0001 - 0x0000)
struct ClientEntryMap_C_OnLoginComplete final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClientEntryMap_C_OnLoginComplete) == 0x000001, "Wrong alignment on ClientEntryMap_C_OnLoginComplete");
static_assert(sizeof(ClientEntryMap_C_OnLoginComplete) == 0x000001, "Wrong size on ClientEntryMap_C_OnLoginComplete");
static_assert(offsetof(ClientEntryMap_C_OnLoginComplete, Success) == 0x000000, "Member 'ClientEntryMap_C_OnLoginComplete::Success' has a wrong offset!");

// Function ClientEntryMap.ClientEntryMap_C.ExecuteUbergraph_ClientEntryMap
// 0x0180 (0x0180 - 0x0000)
struct ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Ticket;                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymSteamSessionTicketRequest*          CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSteamName_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSteamName_ReturnValue_1;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success_1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SplashWidget_C*                     CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasTOSOverlayWidget_C*              CallFunc_Create_ReturnValue_1;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymSaveGameTutorial*                   CallFunc_GetSaveFile_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_1;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedLevel_ReturnValue;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_NoCloudOverlay_C*                  CallFunc_Create_ReturnValue_2;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasClientAcceptedTos_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientLoggedIn_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success, const class FString& Ticket)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDemo_ReturnValue;                       // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap) == 0x000008, "Wrong alignment on ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap");
static_assert(sizeof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap) == 0x000180, "Wrong size on ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, EntryPoint) == 0x000000, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_CustomEvent_Success) == 0x000004, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_CustomEvent_Ticket) == 0x000008, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_CustomEvent_Ticket' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000028, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetCurrentInputType_ReturnValue) == 0x000030, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetSteamName_ReturnValue) == 0x000038, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetSteamName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetSteamName_ReturnValue_1) == 0x000048, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetSteamName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetPlayerController_ReturnValue_1) == 0x000058, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_CustomEvent_Success_1) == 0x000060, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_CustomEvent_Success_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetGameInstance_ReturnValue) == 0x000068, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000070, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_Create_ReturnValue) == 0x000080, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetPlayerController_ReturnValue_2) == 0x000088, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_IsDedicatedServer_ReturnValue) == 0x000090, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetPlayerController_ReturnValue_3) == 0x000098, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_Create_ReturnValue_1) == 0x0000B0, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetPlayerController_ReturnValue_4) == 0x0000B8, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000C0, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetSaveFile_ReturnValue) == 0x0000C8, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetSaveFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_DynamicCast_AsGym_Game_Instance_1) == 0x0000D0, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_DynamicCast_AsGym_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_HasCompletedLevel_ReturnValue) == 0x0000D9, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_HasCompletedLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000DC, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_Create_ReturnValue_2) == 0x0000F0, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F8, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetPlayerController_ReturnValue_5) == 0x000108, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000110, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_HasClientAcceptedTos_ReturnValue) == 0x000118, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_HasClientAcceptedTos_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000120, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_CreateDelegate_OutputDelegate_3) == 0x000128, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000138, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000140, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_IsClientLoggedIn_ReturnValue) == 0x000148, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_IsClientLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetPlayerController_ReturnValue_6) == 0x000150, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000158, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1) == 0x000160, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x000168, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_SwitchEnum_CmpSuccess_1) == 0x000169, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, K2Node_CreateDelegate_OutputDelegate_4) == 0x00016C, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_IsDemo_ReturnValue) == 0x00017C, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_IsDemo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap, CallFunc_IsValid_ReturnValue) == 0x00017D, "Member 'ClientEntryMap_C_ExecuteUbergraph_ClientEntryMap::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

