#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultRadioSelectSetting

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DefaultRadioSelectSetting.DefaultRadioSelectSetting_C.OnFocusReceived
// 0x0278 (0x0278 - 0x0000)
struct DefaultRadioSelectSetting_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0120(0x00B8)()
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URadioButton*>                   CallFunc_GetRadioButtonWidgets_ReturnValue;        // 0x01E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URadioButton*                           CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x0208(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	class URadioButton*                           CallFunc_Array_Get_Item_1;                         // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToPreviousFocusedWidget_ReturnValue; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_BestWidgetDist_ImplicitCast;    // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DefaultRadioSelectSetting_C_OnFocusReceived) == 0x000008, "Wrong alignment on DefaultRadioSelectSetting_C_OnFocusReceived");
static_assert(sizeof(DefaultRadioSelectSetting_C_OnFocusReceived) == 0x000278, "Wrong size on DefaultRadioSelectSetting_C_OnFocusReceived");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, Temp_int_Array_Index_Variable) == 0x0000F8, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, Temp_bool_True_if_break_was_hit_Variable) == 0x0000FC, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Not_PreBool_ReturnValue) == 0x0000FD, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, Temp_int_Loop_Counter_Variable) == 0x000100, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000108, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, Temp_int_Array_Index_Variable_1) == 0x00010C, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Not_PreBool_ReturnValue_1) == 0x000110, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_GetOwningPlayer_ReturnValue) == 0x000118, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000120, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, K2Node_DynamicCast_AsGym_Player_Controller) == 0x0001D8, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_IsValid_ReturnValue) == 0x0001E1, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_IsValid_ReturnValue_1) == 0x0001E2, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, Temp_int_Loop_Counter_Variable_1) == 0x0001E4, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_GetRadioButtonWidgets_ReturnValue) == 0x0001E8, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_GetRadioButtonWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001F8, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Array_Get_Item) == 0x000200, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_GetTickSpaceGeometry_ReturnValue) == 0x000208, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_GetTickSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Array_Get_Item_1) == 0x000240, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_GetDistanceToPreviousFocusedWidget_ReturnValue) == 0x000248, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_GetDistanceToPreviousFocusedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00024C, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Array_Length_ReturnValue_1) == 0x000254, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Less_IntInt_ReturnValue) == 0x000258, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Less_IntInt_ReturnValue_1) == 0x000259, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_BooleanAND_ReturnValue) == 0x00025A, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_BooleanAND_ReturnValue_1) == 0x00025B, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Array_LastIndex_ReturnValue) == 0x00025C, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000260, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, K2Node_VariableSet_BestWidgetDist_ImplicitCast) == 0x000268, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::K2Node_VariableSet_BestWidgetDist_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DefaultRadioSelectSetting_C_OnFocusReceived, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000270, "Member 'DefaultRadioSelectSetting_C_OnFocusReceived::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

