#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplaySettingsPage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SettingPage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameplaySettingsPage.GameplaySettingsPage_C
// 0x0048 (0x0328 - 0x02E0)
class UGameplaySettingsPage_C final : public USettingPage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDefaultRadioSelectSetting_C*           Zero1_PerspectiveSetting;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasLocalizationToggleWidget_C*      CanvasLocalizationToggleWidget;                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GameplaySettings;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_VAR;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_ControllerFeedback;                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_Perspective_DEFAULTFOCUS;               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_ShowTips;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRowHeader_C*                    SettingRowHeader_UI_Settings;                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_GameplaySettingsPage(int32 EntryPoint);
	class UWidget* NavigateToLocaleSelection(EUINavigation Navigation_0);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameplaySettingsPage_C">();
	}
	static class UGameplaySettingsPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplaySettingsPage_C>();
	}
};
static_assert(alignof(UGameplaySettingsPage_C) == 0x000008, "Wrong alignment on UGameplaySettingsPage_C");
static_assert(sizeof(UGameplaySettingsPage_C) == 0x000328, "Wrong size on UGameplaySettingsPage_C");
static_assert(offsetof(UGameplaySettingsPage_C, UberGraphFrame) == 0x0002E0, "Member 'UGameplaySettingsPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGameplaySettingsPage_C, Zero1_PerspectiveSetting) == 0x0002E8, "Member 'UGameplaySettingsPage_C::Zero1_PerspectiveSetting' has a wrong offset!");
static_assert(offsetof(UGameplaySettingsPage_C, CanvasLocalizationToggleWidget) == 0x0002F0, "Member 'UGameplaySettingsPage_C::CanvasLocalizationToggleWidget' has a wrong offset!");
static_assert(offsetof(UGameplaySettingsPage_C, GameplaySettings) == 0x0002F8, "Member 'UGameplaySettingsPage_C::GameplaySettings' has a wrong offset!");
static_assert(offsetof(UGameplaySettingsPage_C, ScrollBox_VAR) == 0x000300, "Member 'UGameplaySettingsPage_C::ScrollBox_VAR' has a wrong offset!");
static_assert(offsetof(UGameplaySettingsPage_C, SettingRow_ControllerFeedback) == 0x000308, "Member 'UGameplaySettingsPage_C::SettingRow_ControllerFeedback' has a wrong offset!");
static_assert(offsetof(UGameplaySettingsPage_C, SettingRow_Perspective_DEFAULTFOCUS) == 0x000310, "Member 'UGameplaySettingsPage_C::SettingRow_Perspective_DEFAULTFOCUS' has a wrong offset!");
static_assert(offsetof(UGameplaySettingsPage_C, SettingRow_ShowTips) == 0x000318, "Member 'UGameplaySettingsPage_C::SettingRow_ShowTips' has a wrong offset!");
static_assert(offsetof(UGameplaySettingsPage_C, SettingRowHeader_UI_Settings) == 0x000320, "Member 'UGameplaySettingsPage_C::SettingRowHeader_UI_Settings' has a wrong offset!");

}

