#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplaySettingsPage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GameplaySettingsPage.GameplaySettingsPage_C.ExecuteUbergraph_GameplaySettingsPage
// 0x0040 (0x0040 - 0x0000)
struct GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USettingRow_C*                          K2Node_DynamicCast_AsSetting_Row;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage) == 0x000008, "Wrong alignment on GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage");
static_assert(sizeof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage) == 0x000040, "Wrong size on GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, EntryPoint) == 0x000000, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, Temp_int_Array_Index_Variable) == 0x000018, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, CallFunc_Array_Get_Item) == 0x000020, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, K2Node_DynamicCast_AsSetting_Row) == 0x000028, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::K2Node_DynamicCast_AsSetting_Row' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'GameplaySettingsPage_C_ExecuteUbergraph_GameplaySettingsPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function GameplaySettingsPage.GameplaySettingsPage_C.NavigateToLocaleSelection
// 0x0010 (0x0010 - 0x0000)
struct GameplaySettingsPage_C_NavigateToLocaleSelection final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameplaySettingsPage_C_NavigateToLocaleSelection) == 0x000008, "Wrong alignment on GameplaySettingsPage_C_NavigateToLocaleSelection");
static_assert(sizeof(GameplaySettingsPage_C_NavigateToLocaleSelection) == 0x000010, "Wrong size on GameplaySettingsPage_C_NavigateToLocaleSelection");
static_assert(offsetof(GameplaySettingsPage_C_NavigateToLocaleSelection, Navigation_0) == 0x000000, "Member 'GameplaySettingsPage_C_NavigateToLocaleSelection::Navigation_0' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_NavigateToLocaleSelection, ReturnValue) == 0x000008, "Member 'GameplaySettingsPage_C_NavigateToLocaleSelection::ReturnValue' has a wrong offset!");

// Function GameplaySettingsPage.GameplaySettingsPage_C.OnPreviewKeyDown
// 0x0360 (0x0360 - 0x0000)
struct GameplaySettingsPage_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          RowChanged;                                        // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastLocalPosX;                                     // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue; // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0158(0x00B8)()
	class UWidget*                                CallFunc_GetCurrentFocusedWidget_ReturnValue;      // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0218(0x00B8)()
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x02D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CultureSelectionButton_C*          K2Node_DynamicCast_AsWBP_Culture_Selection_Button; // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB[0x1];                                      // 0x02FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x02FC(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameplaySettingsPage_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on GameplaySettingsPage_C_OnPreviewKeyDown");
static_assert(sizeof(GameplaySettingsPage_C_OnPreviewKeyDown) == 0x000360, "Wrong size on GameplaySettingsPage_C_OnPreviewKeyDown");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, ReturnValue) == 0x000078, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, RowChanged) == 0x000130, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::RowChanged' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, LastLocalPosX) == 0x000138, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::LastLocalPosX' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue) == 0x000140, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, Temp_int_Array_Index_Variable) == 0x000144, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_MakeLiteralByte_ReturnValue) == 0x000148, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000149, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, Temp_int_Loop_Counter_Variable) == 0x00014C, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000158, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_GetCurrentFocusedWidget_ReturnValue) == 0x000210, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_GetCurrentFocusedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000218, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_GetAllChildren_ReturnValue) == 0x0002D0, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_Array_Get_Item) == 0x0002E0, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_Array_Length_ReturnValue) == 0x0002E8, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, K2Node_DynamicCast_AsWBP_Culture_Selection_Button) == 0x0002F0, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::K2Node_DynamicCast_AsWBP_Culture_Selection_Button' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_Less_IntInt_ReturnValue) == 0x0002F9, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002FA, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_GetCachedGeometry_ReturnValue) == 0x0002FC, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_GetLocalTopLeft_ReturnValue) == 0x000338, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_GetLocalTopLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_BreakVector2D_X) == 0x000348, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_BreakVector2D_Y) == 0x000350, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000358, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplaySettingsPage_C_OnPreviewKeyDown, CallFunc_BooleanOR_ReturnValue) == 0x000359, "Member 'GameplaySettingsPage_C_OnPreviewKeyDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

