#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymAudio_PlayerMovementBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GymAudio_PlayerMovementBP.GymAudio_PlayerMovementBP_C.ExecuteUbergraph_GymAudio_PlayerMovementBP
// 0x0108 (0x0108 - 0x0000)
struct GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0020(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP) == 0x000008, "Wrong alignment on GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP");
static_assert(sizeof(GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP) == 0x000108, "Wrong size on GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP");
static_assert(offsetof(GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP, EntryPoint) == 0x000000, "Member 'GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000020, "Member 'GymAudio_PlayerMovementBP_C_ExecuteUbergraph_GymAudio_PlayerMovementBP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function GymAudio_PlayerMovementBP.GymAudio_PlayerMovementBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GymAudio_PlayerMovementBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymAudio_PlayerMovementBP_C_ReceiveTick) == 0x000004, "Wrong alignment on GymAudio_PlayerMovementBP_C_ReceiveTick");
static_assert(sizeof(GymAudio_PlayerMovementBP_C_ReceiveTick) == 0x000004, "Wrong size on GymAudio_PlayerMovementBP_C_ReceiveTick");
static_assert(offsetof(GymAudio_PlayerMovementBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GymAudio_PlayerMovementBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

