#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMCharacterEditorWidget_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C
// 0x0068 (0x0558 - 0x04F0)
class UGYMCharacterEditorWidget_BP_C final : public UGymCharacterCustomizationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               AssetSelectionSlot;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Customize_C*                        BP_Customize;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_C*                       Header_Style1;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  ResetCharacterButton;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         LastSelectedIndex;                                 // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        TempHighlightableWidgets;                          // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UScrollBox*                             ItemsScrollBox;                                    // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__GYMCharacterEditorWidget_BP_WBP_PlaymenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BPOpen();
	void BuildSlots();
	void CloseAssetMenu();
	void Construct();
	void ExecuteUbergraph_GYMCharacterEditorWidget_BP(int32 EntryPoint);
	void InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5(const struct FKey& Key);
	void OnAssetListUpdated();
	void OpenAssetMenu(class FName Slot_0);
	void OpenColorPicker();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GYMCharacterEditorWidget_BP_C">();
	}
	static class UGYMCharacterEditorWidget_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGYMCharacterEditorWidget_BP_C>();
	}
};
static_assert(alignof(UGYMCharacterEditorWidget_BP_C) == 0x000008, "Wrong alignment on UGYMCharacterEditorWidget_BP_C");
static_assert(sizeof(UGYMCharacterEditorWidget_BP_C) == 0x000558, "Wrong size on UGYMCharacterEditorWidget_BP_C");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, UberGraphFrame) == 0x0004F0, "Member 'UGYMCharacterEditorWidget_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, AssetSelectionSlot) == 0x0004F8, "Member 'UGYMCharacterEditorWidget_BP_C::AssetSelectionSlot' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, BP_Customize) == 0x000500, "Member 'UGYMCharacterEditorWidget_BP_C::BP_Customize' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, Header_Style1) == 0x000508, "Member 'UGYMCharacterEditorWidget_BP_C::Header_Style1' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, ResetCharacterButton) == 0x000510, "Member 'UGYMCharacterEditorWidget_BP_C::ResetCharacterButton' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, WrapBox) == 0x000518, "Member 'UGYMCharacterEditorWidget_BP_C::WrapBox' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, SlotIndex) == 0x000520, "Member 'UGYMCharacterEditorWidget_BP_C::SlotIndex' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, HighlightableWidgets) == 0x000528, "Member 'UGYMCharacterEditorWidget_BP_C::HighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, LastSelectedIndex) == 0x000538, "Member 'UGYMCharacterEditorWidget_BP_C::LastSelectedIndex' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, TempHighlightableWidgets) == 0x000540, "Member 'UGYMCharacterEditorWidget_BP_C::TempHighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UGYMCharacterEditorWidget_BP_C, ItemsScrollBox) == 0x000550, "Member 'UGYMCharacterEditorWidget_BP_C::ItemsScrollBox' has a wrong offset!");

}

