#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMCustomizationOptionWidgetBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GYMCustomizationOptionWidgetBP.GYMCustomizationOptionWidgetBP_C
// 0x0090 (0x0350 - 0x02C0)
class UGYMCustomizationOptionWidgetBP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonTexture;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CardBackground_1;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGYMCharacterEditorWidget_BP_C*         EditorGui;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FGymCharacterCustomizationGUIOption    Data;                                              // 0x0300(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__GYMCustomizationOptionWidgetBP_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__GYMCustomizationOptionWidgetBP_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GYMCustomizationOptionWidgetBP_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_GYMCustomizationOptionWidgetBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GYMCustomizationOptionWidgetBP_C">();
	}
	static class UGYMCustomizationOptionWidgetBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGYMCustomizationOptionWidgetBP_C>();
	}
};
static_assert(alignof(UGYMCustomizationOptionWidgetBP_C) == 0x000008, "Wrong alignment on UGYMCustomizationOptionWidgetBP_C");
static_assert(sizeof(UGYMCustomizationOptionWidgetBP_C) == 0x000350, "Wrong size on UGYMCustomizationOptionWidgetBP_C");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, UberGraphFrame) == 0x0002C0, "Member 'UGYMCustomizationOptionWidgetBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, Hover) == 0x0002C8, "Member 'UGYMCustomizationOptionWidgetBP_C::Hover' has a wrong offset!");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, Button) == 0x0002D0, "Member 'UGYMCustomizationOptionWidgetBP_C::Button' has a wrong offset!");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, ButtonTexture) == 0x0002D8, "Member 'UGYMCustomizationOptionWidgetBP_C::ButtonTexture' has a wrong offset!");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, CardBackground_1) == 0x0002E0, "Member 'UGYMCustomizationOptionWidgetBP_C::CardBackground_1' has a wrong offset!");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, Thumbnail) == 0x0002E8, "Member 'UGYMCustomizationOptionWidgetBP_C::Thumbnail' has a wrong offset!");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, Title) == 0x0002F0, "Member 'UGYMCustomizationOptionWidgetBP_C::Title' has a wrong offset!");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, EditorGui) == 0x0002F8, "Member 'UGYMCustomizationOptionWidgetBP_C::EditorGui' has a wrong offset!");
static_assert(offsetof(UGYMCustomizationOptionWidgetBP_C, Data) == 0x000300, "Member 'UGYMCustomizationOptionWidgetBP_C::Data' has a wrong offset!");

}

