#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMCustomizationOptionWidgetBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function GYMCustomizationOptionWidgetBP.GYMCustomizationOptionWidgetBP_C.ExecuteUbergraph_GYMCustomizationOptionWidgetBP
// 0x0048 (0x0048 - 0x0000)
struct GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP) == 0x000008, "Wrong alignment on GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP");
static_assert(sizeof(GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP) == 0x000048, "Wrong size on GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP");
static_assert(offsetof(GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP, EntryPoint) == 0x000000, "Member 'GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP, CallFunc_Conv_TextToString_ReturnValue) == 0x000010, "Member 'GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'GYMCustomizationOptionWidgetBP_C_ExecuteUbergraph_GYMCustomizationOptionWidgetBP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

