#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMCharacterCustomizationAssetSelectionBP

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function GYMCharacterCustomizationAssetSelectionBP.GYMCharacterCustomizationAssetSelectionBP_C.ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP
// 0x0098 (0x0098 - 0x0000)
struct GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymCharacterCustomizationGUIOption    CallFunc_Array_Get_Item;                           // 0x0018(0x0050)()
	class UGYMCustomizationOptionWidgetBP_C*      CallFunc_SpawnObject_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP) == 0x000008, "Wrong alignment on GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP");
static_assert(sizeof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP) == 0x000098, "Wrong size on GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, EntryPoint) == 0x000000, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, Temp_int_Variable) == 0x000010, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Array_Get_Item) == 0x000018, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_SpawnObject_ReturnValue) == 0x000068, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Greater_IntInt_ReturnValue) == 0x00007C, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Divide_IntInt_ReturnValue) == 0x000080, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_Percent_IntInt_ReturnValue) == 0x000088, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000090, "Member 'GYMCharacterCustomizationAssetSelectionBP_C_ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

}

