#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMCharacter_Blueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.CheckForAutoroll
// 0x0010 (0x0010 - 0x0000)
struct GYMCharacter_Blueprint_C_CheckForAutoroll final
{
public:
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacter_Blueprint_C_CheckForAutoroll) == 0x000008, "Wrong alignment on GYMCharacter_Blueprint_C_CheckForAutoroll");
static_assert(sizeof(GYMCharacter_Blueprint_C_CheckForAutoroll) == 0x000010, "Wrong size on GYMCharacter_Blueprint_C_CheckForAutoroll");
static_assert(offsetof(GYMCharacter_Blueprint_C_CheckForAutoroll, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x000000, "Member 'GYMCharacter_Blueprint_C_CheckForAutoroll::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_CheckForAutoroll, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'GYMCharacter_Blueprint_C_CheckForAutoroll::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_CheckForAutoroll, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000005, "Member 'GYMCharacter_Blueprint_C_CheckForAutoroll::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_CheckForAutoroll, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'GYMCharacter_Blueprint_C_CheckForAutoroll::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_CheckForAutoroll, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000008, "Member 'GYMCharacter_Blueprint_C_CheckForAutoroll::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.Enable Master Pose
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacter_Blueprint_C_Enable_Master_Pose final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacter_Blueprint_C_Enable_Master_Pose) == 0x000008, "Wrong alignment on GYMCharacter_Blueprint_C_Enable_Master_Pose");
static_assert(sizeof(GYMCharacter_Blueprint_C_Enable_Master_Pose) == 0x000018, "Wrong size on GYMCharacter_Blueprint_C_Enable_Master_Pose");
static_assert(offsetof(GYMCharacter_Blueprint_C_Enable_Master_Pose, SkeletalMeshComponent) == 0x000000, "Member 'GYMCharacter_Blueprint_C_Enable_Master_Pose::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_Enable_Master_Pose, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000008, "Member 'GYMCharacter_Blueprint_C_Enable_Master_Pose::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_Enable_Master_Pose, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GYMCharacter_Blueprint_C_Enable_Master_Pose::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_Enable_Master_Pose, CallFunc_IsValidClass_ReturnValue) == 0x000011, "Member 'GYMCharacter_Blueprint_C_Enable_Master_Pose::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_Enable_Master_Pose, CallFunc_IsValidClass_ReturnValue_1) == 0x000012, "Member 'GYMCharacter_Blueprint_C_Enable_Master_Pose::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_Enable_Master_Pose, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'GYMCharacter_Blueprint_C_Enable_Master_Pose::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.ExecuteUbergraph_GYMCharacter_Blueprint
// 0x0170 (0x0170 - 0x0000)
struct GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_Customize_C*                        CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputDebugKeyEvent_Key;                     // 0x0038(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_InputDebugKeyEvent_ActionValue;             // 0x0050(0x0020)(NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0078(0x0018)(HasGetValueTypeHash)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller_1;      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x00B8(0x0018)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00E0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADebugCustomCamera_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Category)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint) == 0x000010, "Wrong alignment on GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint");
static_assert(sizeof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint) == 0x000170, "Wrong size on GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, EntryPoint) == 0x000000, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, Temp_bool_Variable) == 0x000004, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, Temp_bool_Variable_1) == 0x000006, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_Not_PreBool_ReturnValue_1) == 0x000007, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_Conv_VectorToString_ReturnValue) == 0x000010, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x000020, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_Create_ReturnValue) == 0x000030, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_InputDebugKeyEvent_Key) == 0x000038, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_InputDebugKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_InputDebugKeyEvent_ActionValue) == 0x000050, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_InputDebugKeyEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_InputKeyEvent_Key) == 0x000078, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_DynamicCast_AsGym_Player_Controller) == 0x000090, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A0, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_DynamicCast_AsGym_Player_Controller_1) == 0x0000A8, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_DynamicCast_AsGym_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_InputKeyEvent_Key_1) == 0x0000B8, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000D0, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000D8, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_GetTransform_ReturnValue) == 0x0000E0, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000140, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_FinishSpawningActor_ReturnValue) == 0x000148, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, K2Node_CreateDelegate_OutputDelegate) == 0x000150, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint, CallFunc_GetPlayerController_ReturnValue_4) == 0x000160, "Member 'GYMCharacter_Blueprint_C_ExecuteUbergraph_GYMCharacter_Blueprint::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.InitializeComponents
// 0x0010 (0x0010 - 0x0000)
struct GYMCharacter_Blueprint_C_InitializeComponents final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacter_Blueprint_C_InitializeComponents) == 0x000008, "Wrong alignment on GYMCharacter_Blueprint_C_InitializeComponents");
static_assert(sizeof(GYMCharacter_Blueprint_C_InitializeComponents) == 0x000010, "Wrong size on GYMCharacter_Blueprint_C_InitializeComponents");
static_assert(offsetof(GYMCharacter_Blueprint_C_InitializeComponents, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GYMCharacter_Blueprint_C_InitializeComponents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_InitializeComponents, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'GYMCharacter_Blueprint_C_InitializeComponents::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.InpActEvt_K_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacter_Blueprint_C_InpActEvt_K_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacter_Blueprint_C_InpActEvt_K_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on GYMCharacter_Blueprint_C_InpActEvt_K_K2Node_InputKeyEvent_0");
static_assert(sizeof(GYMCharacter_Blueprint_C_InpActEvt_K_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on GYMCharacter_Blueprint_C_InpActEvt_K_K2Node_InputKeyEvent_0");
static_assert(offsetof(GYMCharacter_Blueprint_C_InpActEvt_K_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'GYMCharacter_Blueprint_C_InpActEvt_K_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.InpActEvt_L_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacter_Blueprint_C_InpActEvt_L_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacter_Blueprint_C_InpActEvt_L_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on GYMCharacter_Blueprint_C_InpActEvt_L_K2Node_InputKeyEvent_1");
static_assert(sizeof(GYMCharacter_Blueprint_C_InpActEvt_L_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on GYMCharacter_Blueprint_C_InpActEvt_L_K2Node_InputKeyEvent_1");
static_assert(offsetof(GYMCharacter_Blueprint_C_InpActEvt_L_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'GYMCharacter_Blueprint_C_InpActEvt_L_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.InpActEvt_Zero_K2Node_InputDebugKeyEvent_0
// 0x0038 (0x0038 - 0x0000)
struct GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue                      ActionValue;                                       // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0) == 0x000008, "Wrong alignment on GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0");
static_assert(sizeof(GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0) == 0x000038, "Wrong size on GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0");
static_assert(offsetof(GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0, Key) == 0x000000, "Member 'GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0::Key' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0, ActionValue) == 0x000018, "Member 'GYMCharacter_Blueprint_C_InpActEvt_Zero_K2Node_InputDebugKeyEvent_0::ActionValue' has a wrong offset!");

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.ResetAchievement
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacter_Blueprint_C_ResetAchievement final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacter_Blueprint_C_ResetAchievement) == 0x000008, "Wrong alignment on GYMCharacter_Blueprint_C_ResetAchievement");
static_assert(sizeof(GYMCharacter_Blueprint_C_ResetAchievement) == 0x000018, "Wrong size on GYMCharacter_Blueprint_C_ResetAchievement");
static_assert(offsetof(GYMCharacter_Blueprint_C_ResetAchievement, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'GYMCharacter_Blueprint_C_ResetAchievement::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ResetAchievement, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000008, "Member 'GYMCharacter_Blueprint_C_ResetAchievement::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_ResetAchievement, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GYMCharacter_Blueprint_C_ResetAchievement::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GYMCharacter_Blueprint.GYMCharacter_Blueprint_C.RetargetSetup
// 0x0004 (0x0004 - 0x0000)
struct GYMCharacter_Blueprint_C_RetargetSetup final
{
public:
	EAnimationMode                                CallFunc_GetAnimationMode_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacter_Blueprint_C_RetargetSetup) == 0x000001, "Wrong alignment on GYMCharacter_Blueprint_C_RetargetSetup");
static_assert(sizeof(GYMCharacter_Blueprint_C_RetargetSetup) == 0x000004, "Wrong size on GYMCharacter_Blueprint_C_RetargetSetup");
static_assert(offsetof(GYMCharacter_Blueprint_C_RetargetSetup, CallFunc_GetAnimationMode_ReturnValue) == 0x000000, "Member 'GYMCharacter_Blueprint_C_RetargetSetup::CallFunc_GetAnimationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_RetargetSetup, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000001, "Member 'GYMCharacter_Blueprint_C_RetargetSetup::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_RetargetSetup, CallFunc_IsValidClass_ReturnValue) == 0x000002, "Member 'GYMCharacter_Blueprint_C_RetargetSetup::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacter_Blueprint_C_RetargetSetup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'GYMCharacter_Blueprint_C_RetargetSetup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

