#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMCharacterEditorWidget_BP

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.BuildSlots
// 0x00A8 (0x00A8 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_BuildSlots final
{
public:
	class UGYMCustomizationSlotWidgetBP_C*        CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                CallFunc_GetButton_OutButton;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGymCharacterCustomizationGUIOption> CallFunc_GetSlots_ReturnValue;                     // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymCharacterCustomizationGUIOption    CallFunc_Array_Get_Item_1;                         // 0x0050(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_BuildSlots) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_BuildSlots");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_BuildSlots) == 0x0000A8, "Wrong size on GYMCharacterEditorWidget_BP_C_BuildSlots");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_GetButton_OutButton) == 0x000010, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_GetButton_OutButton' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_Array_Get_Item) == 0x000020, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_Array_Add_ReturnValue_1) == 0x00002C, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_GetSlots_ReturnValue) == 0x000038, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_GetSlots_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_BuildSlots, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'GYMCharacterEditorWidget_BP_C_BuildSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.CloseAssetMenu
// 0x0020 (0x0020 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_CloseAssetMenu final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_CloseAssetMenu");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu) == 0x000020, "Wrong size on GYMCharacterEditorWidget_BP_C_CloseAssetMenu");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_CloseAssetMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GYMCharacterEditorWidget_BP_C_CloseAssetMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GYMCharacterEditorWidget_BP_C_CloseAssetMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu, CallFunc_Array_Get_Item) == 0x000010, "Member 'GYMCharacterEditorWidget_BP_C_CloseAssetMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'GYMCharacterEditorWidget_BP_C_CloseAssetMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu, CallFunc_Array_RemoveItem_ReturnValue) == 0x00001C, "Member 'GYMCharacterEditorWidget_BP_C_CloseAssetMenu::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_CloseAssetMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'GYMCharacterEditorWidget_BP_C_CloseAssetMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.ExecuteUbergraph_GYMCharacterEditorWidget_BP
// 0x0138 (0x0138 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0050(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0068(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0080(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0098(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_3;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_2;                     // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_3;                     // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_4;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x00D8(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_5;                     // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x0108(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP) == 0x000138, "Wrong size on GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, EntryPoint) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, K2Node_Event_MyGeometry) == 0x000004, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsVisible_ReturnValue) == 0x000040, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, K2Node_InputActionEvent_Key_1) == 0x000050, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, K2Node_InputActionEvent_Key_2) == 0x000068, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, K2Node_InputActionEvent_Key_3) == 0x000080, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, K2Node_InputActionEvent_Key_4) == 0x000098, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsOpen_ReturnValue) == 0x0000B0, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GamepadUINavigate_ReturnValue) == 0x0000B1, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x0000B2, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GamepadUINavigate_ReturnValue_2) == 0x0000B3, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GamepadUINavigate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GamepadUINavigate_ReturnValue_3) == 0x0000B4, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GamepadUINavigate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsOpen_ReturnValue_1) == 0x0000B5, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsOpen_ReturnValue_2) == 0x0000B6, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsOpen_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsOpen_ReturnValue_3) == 0x0000B7, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsOpen_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsOpen_ReturnValue_4) == 0x0000B8, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsOpen_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000C8, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000D0, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, K2Node_InputActionEvent_Key) == 0x0000D8, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000F0, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GetPlayerController_ReturnValue) == 0x0000F8, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_Conv_IntToByte_ReturnValue) == 0x000100, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000101, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsOpen_ReturnValue_5) == 0x000102, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsOpen_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_BooleanAND_ReturnValue) == 0x000103, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, K2Node_InputActionEvent_Key_5) == 0x000108, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::K2Node_InputActionEvent_Key_5' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000128, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_Array_Contains_ReturnValue) == 0x000130, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x000131, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_BooleanAND_ReturnValue_1) == 0x000132, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP, CallFunc_BooleanAND_ReturnValue_2) == 0x000133, "Member 'GYMCharacterEditorWidget_BP_C_ExecuteUbergraph_GYMCharacterEditorWidget_BP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadCancel_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4) == 0x000018, "Wrong size on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4, Key) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_4::Key' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2) == 0x000018, "Wrong size on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2, Key) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_2::Key' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3) == 0x000018, "Wrong size on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3, Key) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_3::Key' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5
// 0x0018 (0x0018 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5) == 0x000018, "Wrong size on GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5, Key) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_5::Key' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.OpenAssetMenu
// 0x0088 (0x0088 - 0x0000)
struct GYMCharacterEditorWidget_BP_C_OpenAssetMenu final
{
public:
	class FName                                   Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGYMCharacterCustomizationAssetSelectionBP_C* CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGYMCustomizationOptionWidgetBP_C*      K2Node_DynamicCast_AsGYMCustomization_Option_Widget_BP; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu) == 0x000008, "Wrong alignment on GYMCharacterEditorWidget_BP_C_OpenAssetMenu");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu) == 0x000088, "Wrong size on GYMCharacterEditorWidget_BP_C_OpenAssetMenu");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, Slot_0) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::Slot_0' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, K2Node_DynamicCast_AsOverlay_Slot) == 0x000028, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::K2Node_DynamicCast_AsOverlay_Slot' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_GetAllChildren_ReturnValue) == 0x000038, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Array_LastIndex_ReturnValue_1) == 0x000048, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Array_Get_Item) == 0x000050, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, K2Node_DynamicCast_AsGYMCustomization_Option_Widget_BP) == 0x000060, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::K2Node_DynamicCast_AsGYMCustomization_Option_Widget_BP' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Array_Add_ReturnValue_1) == 0x00007C, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_OpenAssetMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'GYMCharacterEditorWidget_BP_C_OpenAssetMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GYMCharacterEditorWidget_BP.GYMCharacterEditorWidget_BP_C.Tick
// 0x003C (0x003C - 0x0000)
struct GYMCharacterEditorWidget_BP_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCharacterEditorWidget_BP_C_Tick) == 0x000004, "Wrong alignment on GYMCharacterEditorWidget_BP_C_Tick");
static_assert(sizeof(GYMCharacterEditorWidget_BP_C_Tick) == 0x00003C, "Wrong size on GYMCharacterEditorWidget_BP_C_Tick");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_Tick, MyGeometry) == 0x000000, "Member 'GYMCharacterEditorWidget_BP_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(GYMCharacterEditorWidget_BP_C_Tick, InDeltaTime) == 0x000038, "Member 'GYMCharacterEditorWidget_BP_C_Tick::InDeltaTime' has a wrong offset!");

}

