#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMCharacterCustomizationAssetSelectionBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GYMCharacterCustomizationAssetSelectionBP.GYMCharacterCustomizationAssetSelectionBP_C
// 0x0038 (0x02F8 - 0x02C0)
class UGYMCharacterCustomizationAssetSelectionBP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      Grid;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FGymCharacterCustomizationGUIOption> Options;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UGYMCharacterEditorWidget_BP_C*         EditorGui;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         GridIndex;                                         // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_GYMCharacterCustomizationAssetSelectionBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GYMCharacterCustomizationAssetSelectionBP_C">();
	}
	static class UGYMCharacterCustomizationAssetSelectionBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGYMCharacterCustomizationAssetSelectionBP_C>();
	}
};
static_assert(alignof(UGYMCharacterCustomizationAssetSelectionBP_C) == 0x000008, "Wrong alignment on UGYMCharacterCustomizationAssetSelectionBP_C");
static_assert(sizeof(UGYMCharacterCustomizationAssetSelectionBP_C) == 0x0002F8, "Wrong size on UGYMCharacterCustomizationAssetSelectionBP_C");
static_assert(offsetof(UGYMCharacterCustomizationAssetSelectionBP_C, UberGraphFrame) == 0x0002C0, "Member 'UGYMCharacterCustomizationAssetSelectionBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGYMCharacterCustomizationAssetSelectionBP_C, Grid) == 0x0002C8, "Member 'UGYMCharacterCustomizationAssetSelectionBP_C::Grid' has a wrong offset!");
static_assert(offsetof(UGYMCharacterCustomizationAssetSelectionBP_C, ScrollBox) == 0x0002D0, "Member 'UGYMCharacterCustomizationAssetSelectionBP_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UGYMCharacterCustomizationAssetSelectionBP_C, Options) == 0x0002D8, "Member 'UGYMCharacterCustomizationAssetSelectionBP_C::Options' has a wrong offset!");
static_assert(offsetof(UGYMCharacterCustomizationAssetSelectionBP_C, EditorGui) == 0x0002E8, "Member 'UGYMCharacterCustomizationAssetSelectionBP_C::EditorGui' has a wrong offset!");
static_assert(offsetof(UGYMCharacterCustomizationAssetSelectionBP_C, GridIndex) == 0x0002F0, "Member 'UGYMCharacterCustomizationAssetSelectionBP_C::GridIndex' has a wrong offset!");

}

