#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMCustomizationSlotWidgetBP

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GYMCustomizationSlotWidgetBP.GYMCustomizationSlotWidgetBP_C.ExecuteUbergraph_GYMCustomizationSlotWidgetBP
// 0x0004 (0x0004 - 0x0000)
struct GYMCustomizationSlotWidgetBP_C_ExecuteUbergraph_GYMCustomizationSlotWidgetBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCustomizationSlotWidgetBP_C_ExecuteUbergraph_GYMCustomizationSlotWidgetBP) == 0x000004, "Wrong alignment on GYMCustomizationSlotWidgetBP_C_ExecuteUbergraph_GYMCustomizationSlotWidgetBP");
static_assert(sizeof(GYMCustomizationSlotWidgetBP_C_ExecuteUbergraph_GYMCustomizationSlotWidgetBP) == 0x000004, "Wrong size on GYMCustomizationSlotWidgetBP_C_ExecuteUbergraph_GYMCustomizationSlotWidgetBP");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_ExecuteUbergraph_GYMCustomizationSlotWidgetBP, EntryPoint) == 0x000000, "Member 'GYMCustomizationSlotWidgetBP_C_ExecuteUbergraph_GYMCustomizationSlotWidgetBP::EntryPoint' has a wrong offset!");

// Function GYMCustomizationSlotWidgetBP.GYMCustomizationSlotWidgetBP_C.Get_NotEquipped_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0) == 0x000001, "Wrong alignment on GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0");
static_assert(sizeof(GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0) == 0x000002, "Wrong size on GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0, ReturnValue) == 0x000000, "Member 'GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0, CallFunc_Contains_ReturnValue) == 0x000001, "Member 'GYMCustomizationSlotWidgetBP_C_Get_NotEquipped_Visibility_0::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function GYMCustomizationSlotWidgetBP.GYMCustomizationSlotWidgetBP_C.Get_Thumb_Brush_0
// 0x01B0 (0x01B0 - 0x0000)
struct GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromMaterial_ReturnValue;        // 0x00E0(0x00D0)()
};
static_assert(alignof(GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0) == 0x000010, "Wrong alignment on GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0");
static_assert(sizeof(GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0) == 0x0001B0, "Wrong size on GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0, ReturnValue) == 0x000000, "Member 'GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0, CallFunc_MakeBrushFromMaterial_ReturnValue) == 0x0000E0, "Member 'GYMCustomizationSlotWidgetBP_C_Get_Thumb_Brush_0::CallFunc_MakeBrushFromMaterial_ReturnValue' has a wrong offset!");

// Function GYMCustomizationSlotWidgetBP.GYMCustomizationSlotWidgetBP_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct GYMCustomizationSlotWidgetBP_C_GetButton final
{
public:
	class UButton*                                OutButton;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCustomizationSlotWidgetBP_C_GetButton) == 0x000008, "Wrong alignment on GYMCustomizationSlotWidgetBP_C_GetButton");
static_assert(sizeof(GYMCustomizationSlotWidgetBP_C_GetButton) == 0x000008, "Wrong size on GYMCustomizationSlotWidgetBP_C_GetButton");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_GetButton, OutButton) == 0x000000, "Member 'GYMCustomizationSlotWidgetBP_C_GetButton::OutButton' has a wrong offset!");

// Function GYMCustomizationSlotWidgetBP.GYMCustomizationSlotWidgetBP_C.PlayHoverAnimation
// 0x0010 (0x0010 - 0x0000)
struct GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation final
{
public:
	bool                                          Reverse;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation) == 0x000008, "Wrong alignment on GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation");
static_assert(sizeof(GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation) == 0x000010, "Wrong size on GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation, Reverse) == 0x000000, "Member 'GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation::Reverse' has a wrong offset!");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation, Temp_bool_Variable) == 0x000001, "Member 'GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation, Temp_byte_Variable) == 0x000002, "Member 'GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation, Temp_byte_Variable_1) == 0x000003, "Member 'GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation, K2Node_Select_Default) == 0x000004, "Member 'GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'GYMCustomizationSlotWidgetBP_C_PlayHoverAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

