#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMGAME

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Enum GYMGAME.EMapVisibility
// NumValues: 0x0004
enum class EMapVisibility : uint8
{
	Unpublished                              = 0,
	Published                                = 1,
	Hidden                                   = 2,
	EMapVisibility_MAX                       = 3,
};

// Enum GYMGAME.EVoteState
// NumValues: 0x0005
enum class EVoteState : uint8
{
	None                                     = 0,
	Voting                                   = 1,
	Passed                                   = 2,
	Failed                                   = 3,
	EVoteState_MAX                           = 4,
};

// Enum GYMGAME.EGymPlaylistType
// NumValues: 0x0004
enum class EGymPlaylistType : uint8
{
	Playlist                                 = 0,
	Tournament                               = 1,
	Royale                                   = 2,
	EGymPlaylistType_MAX                     = 3,
};

// Enum GYMGAME.EGymPropertyType
// NumValues: 0x0007
enum class EGymPropertyType : uint8
{
	FloatVal                                 = 0,
	IntegerVal                               = 1,
	BooleanVal                               = 2,
	TextVal                                  = 3,
	SelectionVal                             = 4,
	VariantVal                               = 5,
	EGymPropertyType_MAX                     = 6,
};

// Enum GYMGAME.EGymAssetType
// NumValues: 0x0006
enum class EGymAssetType : uint8
{
	Other                                    = 0,
	Box                                      = 1,
	Wall                                     = 2,
	Pillar                                   = 3,
	Floor                                    = 4,
	EGymAssetType_MAX                        = 5,
};

// Enum GYMGAME.EGymAssetSurfaceFlag
// NumValues: 0x0003
enum class EGymAssetSurfaceFlag : uint8
{
	None                                     = 0,
	WallRunBlackListed                       = 1,
	EGymAssetSurfaceFlag_MAX                 = 2,
};

// Enum GYMGAME.ETubeType
// NumValues: 0x0007
enum class ETubeType : uint8
{
	Basic                                    = 0,
	DeadEnd                                  = 1,
	SmallCorner                              = 2,
	BigCorner                                = 3,
	T_Crossing                               = 4,
	X_Crossing                               = 5,
	ETubeType_MAX                            = 6,
};

// Enum GYMGAME.EGymAssetSnapType
// NumValues: 0x0006
enum class EGymAssetSnapType : uint8
{
	None                                     = 0,
	Box                                      = 1,
	Wall                                     = 2,
	Tube                                     = 3,
	Surface                                  = 4,
	EGymAssetSnapType_MAX                    = 5,
};

// Enum GYMGAME.EGymMapLoadStatus
// NumValues: 0x0005
enum class EGymMapLoadStatus : uint8
{
	NotInited                                = 0,
	WaitingToLoad                            = 1,
	WaitingToCreate                          = 2,
	Done                                     = 3,
	EGymMapLoadStatus_MAX                    = 4,
};

// Enum GYMGAME.EGymWallDirection
// NumValues: 0x0008
enum class EGymWallDirection : uint8
{
	Invalid                                  = 0,
	N                                        = 1,
	S                                        = 2,
	W                                        = 3,
	E                                        = 4,
	Floor                                    = 5,
	Ceiling                                  = 6,
	EGymWallDirection_MAX                    = 7,
};

// Enum GYMGAME.EGymRuleParticipantState
// NumValues: 0x0009
enum class EGymRuleParticipantState : uint8
{
	None                                     = 0,
	Joined                                   = 1,
	Preparing                                = 2,
	Prepared                                 = 3,
	Running                                  = 4,
	Finished                                 = 5,
	Failed                                   = 6,
	Spectating                               = 7,
	EGymRuleParticipantState_MAX             = 8,
};

// Enum GYMGAME.EPreflowState
// NumValues: 0x0005
enum class EPreflowState : uint8
{
	None                                     = 0,
	Preflow                                  = 1,
	Prerace                                  = 2,
	Postflow                                 = 3,
	EPreflowState_MAX                        = 4,
};

// Enum GYMGAME.EUINavDirection
// NumValues: 0x0005
enum class EUINavDirection : uint8
{
	Up                                       = 0,
	Down                                     = 1,
	Left                                     = 2,
	Right                                    = 3,
	EUINavDirection_MAX                      = 4,
};

// Enum GYMGAME.EUIHoverRequirement
// NumValues: 0x0004
enum class EUIHoverRequirement : uint8
{
	None                                     = 0,
	Never                                    = 1,
	Gamepad                                  = 2,
	EUIHoverRequirement_MAX                  = 3,
};

// Enum GYMGAME.EGymAchievement
// NumValues: 0x001A
enum class EGymAchievement : uint8
{
	Tutorial                                 = 0,
	Career1                                  = 1,
	Career2                                  = 2,
	Career3                                  = 3,
	Career4                                  = 4,
	Career5                                  = 5,
	Career6                                  = 6,
	Career7                                  = 7,
	CareerFirstPlace                         = 8,
	CareerComplete                           = 9,
	CareerSecretTapes                        = 10,
	CareerPrestige                           = 11,
	Acrobatic                                = 12,
	Ballpit                                  = 13,
	MakeaEditor                              = 14,
	Trampoline                               = 15,
	WorldTour                                = 16,
	Loot                                     = 17,
	Daredevil                                = 18,
	Cardio                                   = 19,
	Customize                                = 20,
	Combo                                    = 21,
	Wet                                      = 22,
	Bombtag                                  = 23,
	Royale                                   = 24,
	EGymAchievement_MAX                      = 25,
};

// Enum GYMGAME.EAudioGameMode
// NumValues: 0x0008
enum class EAudioGameMode : uint8
{
	Mode_Empty                               = 0,
	Mode_BombTag                             = 1,
	Mode_Circuit                             = 2,
	Mode_ObstacleCourse                      = 3,
	Mode_Loot                                = 4,
	Mode_Sprint                              = 5,
	Mode_RisingTide                          = 6,
	Mode_MAX                                 = 7,
};

// Enum GYMGAME.EAudioMatchState
// NumValues: 0x0008
enum class EAudioMatchState : uint8
{
	None                                     = 0,
	Joined                                   = 1,
	Preparing                                = 2,
	Prepared                                 = 3,
	Running                                  = 4,
	Finished                                 = 5,
	Failed                                   = 6,
	EAudioMatchState_MAX                     = 7,
};

// Enum GYMGAME.ECheckpointObjectiveType
// NumValues: 0x0003
enum class ECheckpointObjectiveType : uint8
{
	FromExisting                             = 0,
	FromSpawnPoints                          = 1,
	ECheckpointObjectiveType_MAX             = 2,
};

// Enum GYMGAME.EServerVisibilityOption
// NumValues: 0x0004
enum class EServerVisibilityOption : uint8
{
	Private                                  = 0,
	Public                                   = 1,
	Hub                                      = 2,
	EServerVisibilityOption_MAX              = 3,
};

// Enum GYMGAME.EMapVoteType
// NumValues: 0x0006
enum class EMapVoteType : uint8
{
	None                                     = 0,
	Upvote                                   = 1,
	Downvote                                 = 2,
	Favourite                                = 4,
	Feature                                  = 8,
	EMapVoteType_MAX                         = 9,
};

// Enum GYMGAME.ECollectibleObjectiveType
// NumValues: 0x0003
enum class ECollectibleObjectiveType : uint8
{
	FromSpawnPoints                          = 0,
	FromExisting                             = 1,
	ECollectibleObjectiveType_MAX            = 2,
};

// Enum GYMGAME.EAudioLevelKitOption
// NumValues: 0x000A
enum class EAudioLevelKitOption : uint32
{
	None                                     = 0,
	All                                      = 1,
	Gym                                      = 2,
	Warehouse                                = 3,
	Rooftops                                 = 4,
	FlatLands                                = 5,
	Ocean                                    = 6,
	Stadium                                  = 7,
	Streets                                  = 8,
	EAudioLevelKitOption_MAX                 = 9,
};

// Enum GYMGAME.EGymColorMaskChannel
// NumValues: 0x0005
enum class EGymColorMaskChannel : uint8
{
	Red                                      = 0,
	Green                                    = 1,
	Blue                                     = 2,
	Alpha                                    = 3,
	EGymColorMaskChannel_MAX                 = 4,
};

// Enum GYMGAME.EGymCustomMovementMode
// NumValues: 0x0012
enum class EGymCustomMovementMode : uint8
{
	CMove_None                               = 0,
	CMove_Running                            = 1,
	CMove_Vaulting                           = 2,
	CMove_Rolling                            = 3,
	CMove_Sliding                            = 4,
	CMove_WallRunningSide                    = 5,
	CMove_Grinding                           = 6,
	CMove_WireWalking                        = 7,
	CMove_Fly                                = 8,
	CMove_Trampoline                         = 9,
	CMove_WallRunningForward                 = 10,
	CMove_Zipline                            = 11,
	CMove_Ragdolling                         = 12,
	CMove_Idle                               = 13,
	CMove_Taunt                              = 14,
	CMove_Swim                               = 15,
	CMove_Crouched                           = 16,
	CMove_MAX                                = 17,
};

// Enum GYMGAME.EGymAnswerType
// NumValues: 0x0005
enum class EGymAnswerType : uint8
{
	ETaskAnswer                              = 0,
	ELoreAnswer                              = 1,
	EOtherAnswer                             = 2,
	EExitAnswer                              = 3,
	EGymAnswerType_MAX                       = 4,
};

// Enum GYMGAME.EGymDTTaskStatus
// NumValues: 0x0005
enum class EGymDTTaskStatus : uint8
{
	InProgress                               = 0,
	Completed                                = 1,
	Failed                                   = 2,
	DoesNotHave                              = 3,
	EGymDTTaskStatus_MAX                     = 4,
};

// Enum GYMGAME.EGymDTBranch
// NumValues: 0x0003
enum class EGymDTBranch : uint8
{
	Yes                                      = 0,
	No                                       = 1,
	EGymDTBranch_MAX                         = 2,
};

// Enum GYMGAME.ERotationAxis
// NumValues: 0x0004
enum class ERotationAxis : uint8
{
	Yaw                                      = 0,
	Pitch                                    = 1,
	Roll                                     = 2,
	Max                                      = 3,
};

// Enum GYMGAME.EGymEditorCategoryType
// NumValues: 0x0004
enum class EGymEditorCategoryType : uint32
{
	Asset                                    = 0,
	Options                                  = 1,
	Tool                                     = 2,
	EGymEditorCategoryType_MAX               = 3,
};

// Enum GYMGAME.EGymEditorOptionType
// NumValues: 0x0003
enum class EGymEditorOptionType : uint8
{
	Time                                     = 0,
	Weather                                  = 1,
	EGymEditorOptionType_MAX                 = 2,
};

// Enum GYMGAME.EGymSnappingMode
// NumValues: 0x0006
enum class EGymSnappingMode : uint8
{
	NoSnap                                   = 0,
	Grid                                     = 1,
	Object                                   = 2,
	Surface                                  = 3,
	StackFill                                = 4,
	MAX                                      = 5,
};

// Enum GYMGAME.EEditorGuiOptionType
// NumValues: 0x0004
enum class EEditorGuiOptionType : uint8
{
	String                                   = 0,
	Float                                    = 1,
	Int                                      = 2,
	EEditorGuiOptionType_MAX                 = 3,
};

// Enum GYMGAME.EFragileFloorStatus
// NumValues: 0x0006
enum class EFragileFloorStatus : uint8
{
	Normal                                   = 0,
	Cracking                                 = 1,
	Broken                                   = 2,
	ShouldBeBroken                           = 3,
	ShouldBeNormal                           = 4,
	EFragileFloorStatus_MAX                  = 5,
};

// Enum GYMGAME.EServerInstanceReadyStatus
// NumValues: 0x0004
enum class EServerInstanceReadyStatus : uint8
{
	Unknown                                  = 0,
	WaitingForMap                            = 1,
	Ready                                    = 2,
	EServerInstanceReadyStatus_MAX           = 3,
};

// Enum GYMGAME.ETickerPosition
// NumValues: 0x0003
enum class ETickerPosition : uint8
{
	TopLeft                                  = 0,
	BottomRight                              = 1,
	ETickerPosition_MAX                      = 2,
};

// Enum GYMGAME.ETickerMessageType
// NumValues: 0x0005
enum class ETickerMessageType : uint8
{
	Text                                     = 0,
	IconText                                 = 1,
	TextIconText                             = 2,
	TextIcon                                 = 3,
	ETickerMessageType_MAX                   = 4,
};

// Enum GYMGAME.EInteractionType
// NumValues: 0x0003
enum class EInteractionType : uint8
{
	ImmediateEnd                             = 0,
	ManualEnd                                = 1,
	EInteractionType_MAX                     = 2,
};

// Enum GYMGAME.EGymEditorCategory
// NumValues: 0x0012
enum class EGymEditorCategory : uint8
{
	None                                     = 0,
	Blocks                                   = 1,
	Walls                                    = 2,
	Floors                                   = 3,
	Shapes                                   = 4,
	Trampolines                              = 5,
	Tubes                                    = 6,
	Moving                                   = 7,
	Special                                  = 8,
	Options                                  = 9,
	Dev                                      = 10,
	Tools                                    = 11,
	Rules                                    = 12,
	Decoration                               = 13,
	Physics                                  = 14,
	LevelSettingsButton                      = 15,
	SaveButton                               = 16,
	EGymEditorCategory_MAX                   = 17,
};

// Enum GYMGAME.EMultiPlaceType
// NumValues: 0x0003
enum class EMultiPlaceType : uint8
{
	None                                     = 0,
	Spline                                   = 1,
	EMultiPlaceType_MAX                      = 2,
};

// Enum GYMGAME.ELootMode
// NumValues: 0x0003
enum class ELootMode : uint8
{
	SharedLootPool                           = 0,
	IndividualLootPool                       = 1,
	ELootMode_MAX                            = 2,
};

// Enum GYMGAME.EObjectiveState
// NumValues: 0x0004
enum class EObjectiveState : uint8
{
	InProgress                               = 0,
	Failed                                   = 1,
	Completed                                = 2,
	EObjectiveState_MAX                      = 3,
};

// Enum GYMGAME.EProgressNumberFormat
// NumValues: 0x0005
enum class EProgressNumberFormat : uint8
{
	Auto                                     = 0,
	Int                                      = 1,
	Float                                    = 2,
	Hide                                     = 3,
	EProgressNumberFormat_MAX                = 4,
};

// Enum GYMGAME.EPlayerRuleState
// NumValues: 0x0005
enum class EPlayerRuleState : uint8
{
	None                                     = 0,
	Running                                  = 1,
	Failed                                   = 2,
	Finished                                 = 3,
	EPlayerRuleState_MAX                     = 4,
};

// Enum GYMGAME.EGymPlaylistScoreType
// NumValues: 0x0003
enum class EGymPlaylistScoreType : uint8
{
	Invalid                                  = 0,
	Valid                                    = 1,
	EGymPlaylistScoreType_MAX                = 2,
};

// Enum GYMGAME.EGymPlaylistParticipantState
// NumValues: 0x0003
enum class EGymPlaylistParticipantState : uint8
{
	Playing                                  = 0,
	Eliminated                               = 1,
	EGymPlaylistParticipantState_MAX         = 2,
};

// Enum GYMGAME.EQuestState
// NumValues: 0x0005
enum class EQuestState : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Failed                                   = 2,
	Completed                                = 3,
	EQuestState_MAX                          = 4,
};

// Enum GYMGAME.EEliminationReason
// NumValues: 0x0008
enum class EEliminationReason : uint8
{
	Unknown                                  = 0,
	TimeOut                                  = 1,
	Drowned                                  = 2,
	Exploded                                 = 3,
	Royale                                   = 4,
	Killzone                                 = 5,
	GaveUp                                   = 6,
	EEliminationReason_MAX                   = 7,
};

// Enum GYMGAME.EGymRulesState
// NumValues: 0x0009
enum class EGymRulesState : uint8
{
	None                                     = 0,
	Pending                                  = 1,
	Preparing                                = 2,
	Ready                                    = 3,
	Running                                  = 4,
	Resolved                                 = 5,
	Ended                                    = 6,
	PostRewards                              = 7,
	EGymRulesState_MAX                       = 8,
};

// Enum GYMGAME.FSnapDirection
// NumValues: 0x0003
enum class EFSnapDirection : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 10,
	FSnapDirection_MAX                       = 11,
};

// Enum GYMGAME.ESpectateReason
// NumValues: 0x0005
enum class ESpectateReason : uint8
{
	Unknown                                  = 0,
	User                                     = 1,
	Failed                                   = 2,
	Finished                                 = 3,
	ESpectateReason_MAX                      = 4,
};

// Enum GYMGAME.ESpectatorMovementMode
// NumValues: 0x0004
enum class ESpectatorMovementMode : uint8
{
	FreeCamera                               = 0,
	FirstPerson                              = 1,
	ThirdPerson                              = 2,
	MAX                                      = 3,
};

// Enum GYMGAME.ESupermove
// NumValues: 0x0009
enum class ESupermove : uint8
{
	None                                     = 0,
	Backflip                                 = 1,
	Frontflip                                = 2,
	DashVault                                = 3,
	Grinding                                 = 4,
	CartWheel                                = 5,
	SlideLeap                                = 6,
	WallFlip                                 = 7,
	ESupermove_MAX                           = 8,
};

// Enum GYMGAME.ETauntState
// NumValues: 0x0006
enum class ETauntState : uint8
{
	Start                                    = 0,
	Loop                                     = 1,
	End                                      = 2,
	Finished                                 = 3,
	Failed                                   = 4,
	ETauntState_MAX                          = 5,
};

// Enum GYMGAME.ETideType
// NumValues: 0x0004
enum class ETideType : uint32
{
	FromInstance                             = 0,
	SpawnActor                               = 1,
	MeshSurface                              = 2,
	ETideType_MAX                            = 3,
};

// Enum GYMGAME.EGymVaultingEngineVariantSlot
// NumValues: 0x000B
enum class EGymVaultingEngineVariantSlot : uint8
{
	None                                     = 0,
	Vault_Basic                              = 1,
	SUPER_Vault_Kong                         = 2,
	SUPER_Climb_Kong                         = 3,
	SUPER_Vault_Dash                         = 4,
	SUPER_Climb_Dash                         = 5,
	Vault_Leap                               = 6,
	Climb_Leap                               = 7,
	Climb_Basic                              = 8,
	Vault_Quick_Step                         = 9,
	EGymVaultingEngineVariantSlot_MAX        = 10,
};

// Enum GYMGAME.EGymVaultingEngineAnimationSetRole
// NumValues: 0x0007
enum class EGymVaultingEngineAnimationSetRole : uint8
{
	base                                     = 0,
	EdgeCloseClimb                           = 1,
	FromSky                                  = 2,
	Chain1                                   = 3,
	Chain2                                   = 4,
	Chain3                                   = 5,
	EGymVaultingEngineAnimationSetRole_MAX   = 6,
};

// Enum GYMGAME.EWallRunMode
// NumValues: 0x0004
enum class EWallRunMode : uint32
{
	Forward                                  = 0,
	Right                                    = 1,
	Left                                     = 2,
	EWallRunMode_MAX                         = 3,
};

// Enum GYMGAME.EGymBoundsPushMode
// NumValues: 0x0005
enum class EGymBoundsPushMode : uint8
{
	Single                                   = 0,
	Square2                                  = 1,
	Square3                                  = 2,
	Wall                                     = 3,
	EGymBoundsPushMode_MAX                   = 4,
};

// ScriptStruct GYMGAME.GymScoreboardEntry
// 0x0038 (0x0038 - 0x0000)
struct FGymScoreboardEntry final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PlayerAvatar;                                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StandingString;                                    // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ScoreInfoString;                                   // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymScoreboardEntry) == 0x000008, "Wrong alignment on FGymScoreboardEntry");
static_assert(sizeof(FGymScoreboardEntry) == 0x000038, "Wrong size on FGymScoreboardEntry");
static_assert(offsetof(FGymScoreboardEntry, PlayerName) == 0x000000, "Member 'FGymScoreboardEntry::PlayerName' has a wrong offset!");
static_assert(offsetof(FGymScoreboardEntry, PlayerAvatar) == 0x000010, "Member 'FGymScoreboardEntry::PlayerAvatar' has a wrong offset!");
static_assert(offsetof(FGymScoreboardEntry, StandingString) == 0x000018, "Member 'FGymScoreboardEntry::StandingString' has a wrong offset!");
static_assert(offsetof(FGymScoreboardEntry, ScoreInfoString) == 0x000028, "Member 'FGymScoreboardEntry::ScoreInfoString' has a wrong offset!");

// ScriptStruct GYMGAME.GymUtilityAnimatorProps
// 0x0018 (0x0018 - 0x0000)
struct FGymUtilityAnimatorProps final
{
public:
	int32                                         CustomMovementStateID;                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MovementComponentGrounded;                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ResetAnimation_Slide;                              // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WantsToReset_Jump;                                 // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ResetAnimation_Roll;                               // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WantsTo_BackFlip;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WantsTo_FrontFlip;                                 // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WantsTo_SlideLeap;                                 // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TrampolineAnimationInit;                           // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReplicate;                                       // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          VaultExit;                                         // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AirTime;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWoman;                                           // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGymUtilityAnimatorProps) == 0x000004, "Wrong alignment on FGymUtilityAnimatorProps");
static_assert(sizeof(FGymUtilityAnimatorProps) == 0x000018, "Wrong size on FGymUtilityAnimatorProps");
static_assert(offsetof(FGymUtilityAnimatorProps, CustomMovementStateID) == 0x000000, "Member 'FGymUtilityAnimatorProps::CustomMovementStateID' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, MovementComponentGrounded) == 0x000004, "Member 'FGymUtilityAnimatorProps::MovementComponentGrounded' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, ResetAnimation_Slide) == 0x000005, "Member 'FGymUtilityAnimatorProps::ResetAnimation_Slide' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, WantsToReset_Jump) == 0x000006, "Member 'FGymUtilityAnimatorProps::WantsToReset_Jump' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, ResetAnimation_Roll) == 0x000007, "Member 'FGymUtilityAnimatorProps::ResetAnimation_Roll' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, WantsTo_BackFlip) == 0x000008, "Member 'FGymUtilityAnimatorProps::WantsTo_BackFlip' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, WantsTo_FrontFlip) == 0x000009, "Member 'FGymUtilityAnimatorProps::WantsTo_FrontFlip' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, WantsTo_SlideLeap) == 0x00000A, "Member 'FGymUtilityAnimatorProps::WantsTo_SlideLeap' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, TrampolineAnimationInit) == 0x00000B, "Member 'FGymUtilityAnimatorProps::TrampolineAnimationInit' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, IsReplicate) == 0x00000C, "Member 'FGymUtilityAnimatorProps::IsReplicate' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, VaultExit) == 0x00000D, "Member 'FGymUtilityAnimatorProps::VaultExit' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, AirTime) == 0x000010, "Member 'FGymUtilityAnimatorProps::AirTime' has a wrong offset!");
static_assert(offsetof(FGymUtilityAnimatorProps, IsWoman) == 0x000014, "Member 'FGymUtilityAnimatorProps::IsWoman' has a wrong offset!");

// ScriptStruct GYMGAME.CustomLevelFileInfo
// 0x0060 (0x0060 - 0x0000)
struct FCustomLevelFileInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLocal;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CloudId;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Uri;                                               // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTemp;                                           // 0x004C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x13];                                      // 0x004D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCustomLevelFileInfo) == 0x000008, "Wrong alignment on FCustomLevelFileInfo");
static_assert(sizeof(FCustomLevelFileInfo) == 0x000060, "Wrong size on FCustomLevelFileInfo");
static_assert(offsetof(FCustomLevelFileInfo, Name) == 0x000000, "Member 'FCustomLevelFileInfo::Name' has a wrong offset!");
static_assert(offsetof(FCustomLevelFileInfo, IsLocal) == 0x000010, "Member 'FCustomLevelFileInfo::IsLocal' has a wrong offset!");
static_assert(offsetof(FCustomLevelFileInfo, Path) == 0x000018, "Member 'FCustomLevelFileInfo::Path' has a wrong offset!");
static_assert(offsetof(FCustomLevelFileInfo, CloudId) == 0x000028, "Member 'FCustomLevelFileInfo::CloudId' has a wrong offset!");
static_assert(offsetof(FCustomLevelFileInfo, Uri) == 0x000038, "Member 'FCustomLevelFileInfo::Uri' has a wrong offset!");
static_assert(offsetof(FCustomLevelFileInfo, Version) == 0x000048, "Member 'FCustomLevelFileInfo::Version' has a wrong offset!");
static_assert(offsetof(FCustomLevelFileInfo, bIsTemp) == 0x00004C, "Member 'FCustomLevelFileInfo::bIsTemp' has a wrong offset!");

// ScriptStruct GYMGAME.GymCustomizationAttribute
// 0x0018 (0x0018 - 0x0000)
struct FGymCustomizationAttribute final
{
public:
	class FName                                   Slot;                                              // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymCustomizationAttribute) == 0x000008, "Wrong alignment on FGymCustomizationAttribute");
static_assert(sizeof(FGymCustomizationAttribute) == 0x000018, "Wrong size on FGymCustomizationAttribute");
static_assert(offsetof(FGymCustomizationAttribute, Slot) == 0x000000, "Member 'FGymCustomizationAttribute::Slot' has a wrong offset!");
static_assert(offsetof(FGymCustomizationAttribute, Value) == 0x000008, "Member 'FGymCustomizationAttribute::Value' has a wrong offset!");

// ScriptStruct GYMGAME.GymCharacterCustomization
// 0x0010 (0x0010 - 0x0000)
struct FGymCharacterCustomization final
{
public:
	TArray<struct FGymCustomizationAttribute>     Attributes;                                        // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymCharacterCustomization) == 0x000008, "Wrong alignment on FGymCharacterCustomization");
static_assert(sizeof(FGymCharacterCustomization) == 0x000010, "Wrong size on FGymCharacterCustomization");
static_assert(offsetof(FGymCharacterCustomization, Attributes) == 0x000000, "Member 'FGymCharacterCustomization::Attributes' has a wrong offset!");

// ScriptStruct GYMGAME.GymPlayerPartyInfo
// 0x0038 (0x0038 - 0x0000)
struct FGymPlayerPartyInfo final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGymCharacterCustomization             Customization;                                     // 0x0020(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          LocalPlayer;                                       // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Host;                                              // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGymPlayerPartyInfo) == 0x000008, "Wrong alignment on FGymPlayerPartyInfo");
static_assert(sizeof(FGymPlayerPartyInfo) == 0x000038, "Wrong size on FGymPlayerPartyInfo");
static_assert(offsetof(FGymPlayerPartyInfo, UserId) == 0x000000, "Member 'FGymPlayerPartyInfo::UserId' has a wrong offset!");
static_assert(offsetof(FGymPlayerPartyInfo, DisplayName) == 0x000010, "Member 'FGymPlayerPartyInfo::DisplayName' has a wrong offset!");
static_assert(offsetof(FGymPlayerPartyInfo, Customization) == 0x000020, "Member 'FGymPlayerPartyInfo::Customization' has a wrong offset!");
static_assert(offsetof(FGymPlayerPartyInfo, LocalPlayer) == 0x000030, "Member 'FGymPlayerPartyInfo::LocalPlayer' has a wrong offset!");
static_assert(offsetof(FGymPlayerPartyInfo, Host) == 0x000031, "Member 'FGymPlayerPartyInfo::Host' has a wrong offset!");

// ScriptStruct GYMGAME.GymAssetVariantId
// 0x0010 (0x0010 - 0x0000)
struct FGymAssetVariantId final
{
public:
	class FName                                   AssetName;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariantName;                                       // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymAssetVariantId) == 0x000004, "Wrong alignment on FGymAssetVariantId");
static_assert(sizeof(FGymAssetVariantId) == 0x000010, "Wrong size on FGymAssetVariantId");
static_assert(offsetof(FGymAssetVariantId, AssetName) == 0x000000, "Member 'FGymAssetVariantId::AssetName' has a wrong offset!");
static_assert(offsetof(FGymAssetVariantId, VariantName) == 0x000008, "Member 'FGymAssetVariantId::VariantName' has a wrong offset!");

// ScriptStruct GYMGAME.GymMultiSelectProperty
// 0x0020 (0x0020 - 0x0000)
struct FGymMultiSelectProperty final
{
public:
	class FName                                   PropertySelectionId;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   SelectionDisplayName;                              // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymMultiSelectProperty) == 0x000008, "Wrong alignment on FGymMultiSelectProperty");
static_assert(sizeof(FGymMultiSelectProperty) == 0x000020, "Wrong size on FGymMultiSelectProperty");
static_assert(offsetof(FGymMultiSelectProperty, PropertySelectionId) == 0x000000, "Member 'FGymMultiSelectProperty::PropertySelectionId' has a wrong offset!");
static_assert(offsetof(FGymMultiSelectProperty, SelectionDisplayName) == 0x000008, "Member 'FGymMultiSelectProperty::SelectionDisplayName' has a wrong offset!");

// ScriptStruct GYMGAME.GymProperty
// 0x00D8 (0x00D8 - 0x0000)
struct FGymProperty final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDevProperty;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PropertyId;                                        // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, RepSkip, NativeAccessSpecifierPublic)
	float                                         FloatVal;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntVal;                                            // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBooleanVal;                                       // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WriteableVal;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SelectableVal;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGymAssetVariantId                     VariantIdVal;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGymPropertyType                              PropertyType;                                      // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGymMultiSelectProperty>        SelectableProperty;                                // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	float                                         MinVal;                                            // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMinLimit;                                         // 0x0084(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxVal;                                            // 0x0088(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaxLimit;                                         // 0x008C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StepSize;                                          // 0x0090(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Precision;                                         // 0x0094(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   FalseDisplayText;                                  // 0x0098(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, RepSkip, NativeAccessSpecifierPublic)
	class FText                                   TrueDisplayText;                                   // 0x00B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, RepSkip, NativeAccessSpecifierPublic)
	class UGymLevelAssetData*                     LevelAssetData;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AGymStaticLevelAsset>       VariantVal;                                        // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymProperty) == 0x000008, "Wrong alignment on FGymProperty");
static_assert(sizeof(FGymProperty) == 0x0000D8, "Wrong size on FGymProperty");
static_assert(offsetof(FGymProperty, bIsValid) == 0x000000, "Member 'FGymProperty::bIsValid' has a wrong offset!");
static_assert(offsetof(FGymProperty, bIsDevProperty) == 0x000001, "Member 'FGymProperty::bIsDevProperty' has a wrong offset!");
static_assert(offsetof(FGymProperty, PropertyId) == 0x000004, "Member 'FGymProperty::PropertyId' has a wrong offset!");
static_assert(offsetof(FGymProperty, DisplayName) == 0x000010, "Member 'FGymProperty::DisplayName' has a wrong offset!");
static_assert(offsetof(FGymProperty, FloatVal) == 0x000028, "Member 'FGymProperty::FloatVal' has a wrong offset!");
static_assert(offsetof(FGymProperty, IntVal) == 0x00002C, "Member 'FGymProperty::IntVal' has a wrong offset!");
static_assert(offsetof(FGymProperty, bBooleanVal) == 0x000030, "Member 'FGymProperty::bBooleanVal' has a wrong offset!");
static_assert(offsetof(FGymProperty, WriteableVal) == 0x000038, "Member 'FGymProperty::WriteableVal' has a wrong offset!");
static_assert(offsetof(FGymProperty, SelectableVal) == 0x000048, "Member 'FGymProperty::SelectableVal' has a wrong offset!");
static_assert(offsetof(FGymProperty, VariantIdVal) == 0x000058, "Member 'FGymProperty::VariantIdVal' has a wrong offset!");
static_assert(offsetof(FGymProperty, PropertyType) == 0x000068, "Member 'FGymProperty::PropertyType' has a wrong offset!");
static_assert(offsetof(FGymProperty, SelectableProperty) == 0x000070, "Member 'FGymProperty::SelectableProperty' has a wrong offset!");
static_assert(offsetof(FGymProperty, MinVal) == 0x000080, "Member 'FGymProperty::MinVal' has a wrong offset!");
static_assert(offsetof(FGymProperty, bMinLimit) == 0x000084, "Member 'FGymProperty::bMinLimit' has a wrong offset!");
static_assert(offsetof(FGymProperty, MaxVal) == 0x000088, "Member 'FGymProperty::MaxVal' has a wrong offset!");
static_assert(offsetof(FGymProperty, bMaxLimit) == 0x00008C, "Member 'FGymProperty::bMaxLimit' has a wrong offset!");
static_assert(offsetof(FGymProperty, StepSize) == 0x000090, "Member 'FGymProperty::StepSize' has a wrong offset!");
static_assert(offsetof(FGymProperty, Precision) == 0x000094, "Member 'FGymProperty::Precision' has a wrong offset!");
static_assert(offsetof(FGymProperty, FalseDisplayText) == 0x000098, "Member 'FGymProperty::FalseDisplayText' has a wrong offset!");
static_assert(offsetof(FGymProperty, TrueDisplayText) == 0x0000B0, "Member 'FGymProperty::TrueDisplayText' has a wrong offset!");
static_assert(offsetof(FGymProperty, LevelAssetData) == 0x0000C8, "Member 'FGymProperty::LevelAssetData' has a wrong offset!");
static_assert(offsetof(FGymProperty, VariantVal) == 0x0000D0, "Member 'FGymProperty::VariantVal' has a wrong offset!");

// ScriptStruct GYMGAME.GymServerMapInfo
// 0x0040 (0x0040 - 0x0000)
struct FGymServerMapInfo final
{
public:
	class FString                                 MapId;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapOwner;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapName;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameMode;                                          // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymServerMapInfo) == 0x000008, "Wrong alignment on FGymServerMapInfo");
static_assert(sizeof(FGymServerMapInfo) == 0x000040, "Wrong size on FGymServerMapInfo");
static_assert(offsetof(FGymServerMapInfo, MapId) == 0x000000, "Member 'FGymServerMapInfo::MapId' has a wrong offset!");
static_assert(offsetof(FGymServerMapInfo, MapOwner) == 0x000010, "Member 'FGymServerMapInfo::MapOwner' has a wrong offset!");
static_assert(offsetof(FGymServerMapInfo, MapName) == 0x000020, "Member 'FGymServerMapInfo::MapName' has a wrong offset!");
static_assert(offsetof(FGymServerMapInfo, GameMode) == 0x000030, "Member 'FGymServerMapInfo::GameMode' has a wrong offset!");

// ScriptStruct GYMGAME.GymServerOwner
// 0x0020 (0x0020 - 0x0000)
struct FGymServerOwner final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OwnerId;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymServerOwner) == 0x000008, "Wrong alignment on FGymServerOwner");
static_assert(sizeof(FGymServerOwner) == 0x000020, "Wrong size on FGymServerOwner");
static_assert(offsetof(FGymServerOwner, DisplayName) == 0x000000, "Member 'FGymServerOwner::DisplayName' has a wrong offset!");
static_assert(offsetof(FGymServerOwner, OwnerId) == 0x000010, "Member 'FGymServerOwner::OwnerId' has a wrong offset!");

// ScriptStruct GYMGAME.GymServerInfo
// 0x0158 (0x0158 - 0x0000)
struct FGymServerInfo final
{
public:
	class FString                                 ServerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapName;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapId;                                             // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlaylistId;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGymServerMapInfo                      MapInfo;                                           // 0x0050(0x0040)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 ConnectionString;                                  // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x00A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HttpPort;                                          // 0x00A4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerVersion;                                     // 0x00B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameMode;                                          // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Status;                                            // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentDisplayName;                                // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartMode;                                         // 0x00F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JoinCode;                                          // 0x0108(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QuickplayTimer;                                    // 0x0118(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymServerOwner                        Owner;                                             // 0x0120(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         Players;                                           // 0x0140(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPlayers;                                        // 0x0144(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ipv4;                                              // 0x0148(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymServerInfo) == 0x000008, "Wrong alignment on FGymServerInfo");
static_assert(sizeof(FGymServerInfo) == 0x000158, "Wrong size on FGymServerInfo");
static_assert(offsetof(FGymServerInfo, ServerId) == 0x000000, "Member 'FGymServerInfo::ServerId' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, ServerName) == 0x000010, "Member 'FGymServerInfo::ServerName' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, MapName) == 0x000020, "Member 'FGymServerInfo::MapName' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, MapId) == 0x000030, "Member 'FGymServerInfo::MapId' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, PlaylistId) == 0x000040, "Member 'FGymServerInfo::PlaylistId' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, MapInfo) == 0x000050, "Member 'FGymServerInfo::MapInfo' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, ConnectionString) == 0x000090, "Member 'FGymServerInfo::ConnectionString' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, Port) == 0x0000A0, "Member 'FGymServerInfo::Port' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, HttpPort) == 0x0000A4, "Member 'FGymServerInfo::HttpPort' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, Type) == 0x0000A8, "Member 'FGymServerInfo::Type' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, ServerVersion) == 0x0000B8, "Member 'FGymServerInfo::ServerVersion' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, GameMode) == 0x0000C8, "Member 'FGymServerInfo::GameMode' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, Status) == 0x0000D8, "Member 'FGymServerInfo::Status' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, ContentDisplayName) == 0x0000E8, "Member 'FGymServerInfo::ContentDisplayName' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, StartMode) == 0x0000F8, "Member 'FGymServerInfo::StartMode' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, JoinCode) == 0x000108, "Member 'FGymServerInfo::JoinCode' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, QuickplayTimer) == 0x000118, "Member 'FGymServerInfo::QuickplayTimer' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, Owner) == 0x000120, "Member 'FGymServerInfo::Owner' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, Players) == 0x000140, "Member 'FGymServerInfo::Players' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, MaxPlayers) == 0x000144, "Member 'FGymServerInfo::MaxPlayers' has a wrong offset!");
static_assert(offsetof(FGymServerInfo, Ipv4) == 0x000148, "Member 'FGymServerInfo::Ipv4' has a wrong offset!");

// ScriptStruct GYMGAME.GymAssetTypesArray
// 0x0040 (0x0040 - 0x0000)
struct FGymAssetTypesArray final
{
public:
	TArray<class AActor*>                         BoxAssets;                                         // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         WallAssets;                                        // 0x0010(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         PillarAssets;                                      // 0x0020(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         FloorAssets;                                       // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGymAssetTypesArray) == 0x000008, "Wrong alignment on FGymAssetTypesArray");
static_assert(sizeof(FGymAssetTypesArray) == 0x000040, "Wrong size on FGymAssetTypesArray");
static_assert(offsetof(FGymAssetTypesArray, BoxAssets) == 0x000000, "Member 'FGymAssetTypesArray::BoxAssets' has a wrong offset!");
static_assert(offsetof(FGymAssetTypesArray, WallAssets) == 0x000010, "Member 'FGymAssetTypesArray::WallAssets' has a wrong offset!");
static_assert(offsetof(FGymAssetTypesArray, PillarAssets) == 0x000020, "Member 'FGymAssetTypesArray::PillarAssets' has a wrong offset!");
static_assert(offsetof(FGymAssetTypesArray, FloorAssets) == 0x000030, "Member 'FGymAssetTypesArray::FloorAssets' has a wrong offset!");

// ScriptStruct GYMGAME.GymChallengeReward
// 0x0018 (0x0018 - 0x0000)
struct FGymChallengeReward final
{
public:
