#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMGAME

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GYMGAME.EditorGizmo.EnableAxis
// 0x0001 (0x0001 - 0x0000)
struct EditorGizmo_EnableAxis final
{
public:
	ERotationAxis                                 RotationAxis;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditorGizmo_EnableAxis) == 0x000001, "Wrong alignment on EditorGizmo_EnableAxis");
static_assert(sizeof(EditorGizmo_EnableAxis) == 0x000001, "Wrong size on EditorGizmo_EnableAxis");
static_assert(offsetof(EditorGizmo_EnableAxis, RotationAxis) == 0x000000, "Member 'EditorGizmo_EnableAxis::RotationAxis' has a wrong offset!");

// Function GYMGAME.GymGlobalActionControl.GetActionsFromPage
// 0x0018 (0x0018 - 0x0000)
struct GymGlobalActionControl_GetActionsFromPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGymMetaAction*>                 ReturnValue;                                       // 0x0008(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGlobalActionControl_GetActionsFromPage) == 0x000008, "Wrong alignment on GymGlobalActionControl_GetActionsFromPage");
static_assert(sizeof(GymGlobalActionControl_GetActionsFromPage) == 0x000018, "Wrong size on GymGlobalActionControl_GetActionsFromPage");
static_assert(offsetof(GymGlobalActionControl_GetActionsFromPage, Page) == 0x000000, "Member 'GymGlobalActionControl_GetActionsFromPage::Page' has a wrong offset!");
static_assert(offsetof(GymGlobalActionControl_GetActionsFromPage, ReturnValue) == 0x000008, "Member 'GymGlobalActionControl_GetActionsFromPage::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGlobalActionControl.GetAllActions
// 0x0010 (0x0010 - 0x0000)
struct GymGlobalActionControl_GetAllActions final
{
public:
	TArray<class UGymMetaAction*>                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGlobalActionControl_GetAllActions) == 0x000008, "Wrong alignment on GymGlobalActionControl_GetAllActions");
static_assert(sizeof(GymGlobalActionControl_GetAllActions) == 0x000010, "Wrong size on GymGlobalActionControl_GetAllActions");
static_assert(offsetof(GymGlobalActionControl_GetAllActions, ReturnValue) == 0x000000, "Member 'GymGlobalActionControl_GetAllActions::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGlobalActionControl.GetPageData
// 0x0040 (0x0040 - 0x0000)
struct GymGlobalActionControl_GetPageData final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymActionContainer                    OutActionData;                                     // 0x0008(0x0030)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GymGlobalActionControl_GetPageData) == 0x000008, "Wrong alignment on GymGlobalActionControl_GetPageData");
static_assert(sizeof(GymGlobalActionControl_GetPageData) == 0x000040, "Wrong size on GymGlobalActionControl_GetPageData");
static_assert(offsetof(GymGlobalActionControl_GetPageData, Page) == 0x000000, "Member 'GymGlobalActionControl_GetPageData::Page' has a wrong offset!");
static_assert(offsetof(GymGlobalActionControl_GetPageData, OutActionData) == 0x000008, "Member 'GymGlobalActionControl_GetPageData::OutActionData' has a wrong offset!");
static_assert(offsetof(GymGlobalActionControl_GetPageData, ReturnValue) == 0x000038, "Member 'GymGlobalActionControl_GetPageData::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGlobalActionControl.GetPageNum
// 0x0004 (0x0004 - 0x0000)
struct GymGlobalActionControl_GetPageNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGlobalActionControl_GetPageNum) == 0x000004, "Wrong alignment on GymGlobalActionControl_GetPageNum");
static_assert(sizeof(GymGlobalActionControl_GetPageNum) == 0x000004, "Wrong size on GymGlobalActionControl_GetPageNum");
static_assert(offsetof(GymGlobalActionControl_GetPageNum, ReturnValue) == 0x000000, "Member 'GymGlobalActionControl_GetPageNum::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymAchievements.SetAchievementWithEnum
// 0x0002 (0x0002 - 0x0000)
struct GymAchievements_SetAchievementWithEnum final
{
public:
	EGymAchievement                               Achievement;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAchievements_SetAchievementWithEnum) == 0x000001, "Wrong alignment on GymAchievements_SetAchievementWithEnum");
static_assert(sizeof(GymAchievements_SetAchievementWithEnum) == 0x000002, "Wrong size on GymAchievements_SetAchievementWithEnum");
static_assert(offsetof(GymAchievements_SetAchievementWithEnum, Achievement) == 0x000000, "Member 'GymAchievements_SetAchievementWithEnum::Achievement' has a wrong offset!");
static_assert(offsetof(GymAchievements_SetAchievementWithEnum, ReturnValue) == 0x000001, "Member 'GymAchievements_SetAchievementWithEnum::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymAchievements.SetAchievementWithString
// 0x0018 (0x0018 - 0x0000)
struct GymAchievements_SetAchievementWithString final
{
public:
	class FString                                 AchievementID;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GymAchievements_SetAchievementWithString) == 0x000008, "Wrong alignment on GymAchievements_SetAchievementWithString");
static_assert(sizeof(GymAchievements_SetAchievementWithString) == 0x000018, "Wrong size on GymAchievements_SetAchievementWithString");
static_assert(offsetof(GymAchievements_SetAchievementWithString, AchievementID) == 0x000000, "Member 'GymAchievements_SetAchievementWithString::AchievementID' has a wrong offset!");
static_assert(offsetof(GymAchievements_SetAchievementWithString, ReturnValue) == 0x000010, "Member 'GymAchievements_SetAchievementWithString::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymActionInputWidget.SetInput
// 0x0008 (0x0008 - 0x0000)
struct GymActionInputWidget_SetInput final
{
public:
	class FName                                   Input;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymActionInputWidget_SetInput) == 0x000004, "Wrong alignment on GymActionInputWidget_SetInput");
static_assert(sizeof(GymActionInputWidget_SetInput) == 0x000008, "Wrong size on GymActionInputWidget_SetInput");
static_assert(offsetof(GymActionInputWidget_SetInput, Input) == 0x000000, "Member 'GymActionInputWidget_SetInput::Input' has a wrong offset!");

// Function GYMGAME.GymGlobalTickerEventControl.Client_AddCustomMessage
// 0x0010 (0x0010 - 0x0000)
struct GymGlobalTickerEventControl_Client_AddCustomMessage final
{
public:
	TSubclassOf<class UGymGuiTickerMessageWidget> Message;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETickerPosition                               Position;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GymGlobalTickerEventControl_Client_AddCustomMessage) == 0x000008, "Wrong alignment on GymGlobalTickerEventControl_Client_AddCustomMessage");
static_assert(sizeof(GymGlobalTickerEventControl_Client_AddCustomMessage) == 0x000010, "Wrong size on GymGlobalTickerEventControl_Client_AddCustomMessage");
static_assert(offsetof(GymGlobalTickerEventControl_Client_AddCustomMessage, Message) == 0x000000, "Member 'GymGlobalTickerEventControl_Client_AddCustomMessage::Message' has a wrong offset!");
static_assert(offsetof(GymGlobalTickerEventControl_Client_AddCustomMessage, Position) == 0x000008, "Member 'GymGlobalTickerEventControl_Client_AddCustomMessage::Position' has a wrong offset!");

// Function GYMGAME.GymGlobalTickerEventControl.Client_AddMessage
// 0x0058 (0x0058 - 0x0000)
struct GymGlobalTickerEventControl_Client_AddMessage final
{
public:
	struct FTickerSettingsStruct                  Settings;                                          // 0x0000(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGlobalTickerEventControl_Client_AddMessage) == 0x000008, "Wrong alignment on GymGlobalTickerEventControl_Client_AddMessage");
static_assert(sizeof(GymGlobalTickerEventControl_Client_AddMessage) == 0x000058, "Wrong size on GymGlobalTickerEventControl_Client_AddMessage");
static_assert(offsetof(GymGlobalTickerEventControl_Client_AddMessage, Settings) == 0x000000, "Member 'GymGlobalTickerEventControl_Client_AddMessage::Settings' has a wrong offset!");

// Function GYMGAME.GymGlobalTickerEventControl.Client_RemoveMessage
// 0x0008 (0x0008 - 0x0000)
struct GymGlobalTickerEventControl_Client_RemoveMessage final
{
public:
	class FName                                   MessageId;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGlobalTickerEventControl_Client_RemoveMessage) == 0x000004, "Wrong alignment on GymGlobalTickerEventControl_Client_RemoveMessage");
static_assert(sizeof(GymGlobalTickerEventControl_Client_RemoveMessage) == 0x000008, "Wrong size on GymGlobalTickerEventControl_Client_RemoveMessage");
static_assert(offsetof(GymGlobalTickerEventControl_Client_RemoveMessage, MessageId) == 0x000000, "Member 'GymGlobalTickerEventControl_Client_RemoveMessage::MessageId' has a wrong offset!");

// Function GYMGAME.GymMetaAction.CanPerform
// 0x0001 (0x0001 - 0x0000)
struct GymMetaAction_CanPerform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymMetaAction_CanPerform) == 0x000001, "Wrong alignment on GymMetaAction_CanPerform");
static_assert(sizeof(GymMetaAction_CanPerform) == 0x000001, "Wrong size on GymMetaAction_CanPerform");
static_assert(offsetof(GymMetaAction_CanPerform, ReturnValue) == 0x000000, "Member 'GymMetaAction_CanPerform::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymMetaAction.GetActionName
// 0x0018 (0x0018 - 0x0000)
struct GymMetaAction_GetActionName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymMetaAction_GetActionName) == 0x000008, "Wrong alignment on GymMetaAction_GetActionName");
static_assert(sizeof(GymMetaAction_GetActionName) == 0x000018, "Wrong size on GymMetaAction_GetActionName");
static_assert(offsetof(GymMetaAction_GetActionName, ReturnValue) == 0x000000, "Member 'GymMetaAction_GetActionName::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGlobalChatControl.Client_ReceiveMessage
// 0x0020 (0x0020 - 0x0000)
struct GymGlobalChatControl_Client_ReceiveMessage final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGlobalChatControl_Client_ReceiveMessage) == 0x000008, "Wrong alignment on GymGlobalChatControl_Client_ReceiveMessage");
static_assert(sizeof(GymGlobalChatControl_Client_ReceiveMessage) == 0x000020, "Wrong size on GymGlobalChatControl_Client_ReceiveMessage");
static_assert(offsetof(GymGlobalChatControl_Client_ReceiveMessage, PlayerName) == 0x000000, "Member 'GymGlobalChatControl_Client_ReceiveMessage::PlayerName' has a wrong offset!");
static_assert(offsetof(GymGlobalChatControl_Client_ReceiveMessage, Message) == 0x000010, "Member 'GymGlobalChatControl_Client_ReceiveMessage::Message' has a wrong offset!");

// Function GYMGAME.GymGlobalChatControl.Server_SendMessage
// 0x0020 (0x0020 - 0x0000)
struct GymGlobalChatControl_Server_SendMessage final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGlobalChatControl_Server_SendMessage) == 0x000008, "Wrong alignment on GymGlobalChatControl_Server_SendMessage");
static_assert(sizeof(GymGlobalChatControl_Server_SendMessage) == 0x000020, "Wrong size on GymGlobalChatControl_Server_SendMessage");
static_assert(offsetof(GymGlobalChatControl_Server_SendMessage, PlayerName) == 0x000000, "Member 'GymGlobalChatControl_Server_SendMessage::PlayerName' has a wrong offset!");
static_assert(offsetof(GymGlobalChatControl_Server_SendMessage, Message) == 0x000010, "Member 'GymGlobalChatControl_Server_SendMessage::Message' has a wrong offset!");

// Function GYMGAME.GymAnimationControl.GetHandsHidden
// 0x0001 (0x0001 - 0x0000)
struct GymAnimationControl_GetHandsHidden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAnimationControl_GetHandsHidden) == 0x000001, "Wrong alignment on GymAnimationControl_GetHandsHidden");
static_assert(sizeof(GymAnimationControl_GetHandsHidden) == 0x000001, "Wrong size on GymAnimationControl_GetHandsHidden");
static_assert(offsetof(GymAnimationControl_GetHandsHidden, ReturnValue) == 0x000000, "Member 'GymAnimationControl_GetHandsHidden::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymAnimationControl.SetFirstPersonBody
// 0x0001 (0x0001 - 0x0000)
struct GymAnimationControl_SetFirstPersonBody final
{
public:
	bool                                          Force;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAnimationControl_SetFirstPersonBody) == 0x000001, "Wrong alignment on GymAnimationControl_SetFirstPersonBody");
static_assert(sizeof(GymAnimationControl_SetFirstPersonBody) == 0x000001, "Wrong size on GymAnimationControl_SetFirstPersonBody");
static_assert(offsetof(GymAnimationControl_SetFirstPersonBody, Force) == 0x000000, "Member 'GymAnimationControl_SetFirstPersonBody::Force' has a wrong offset!");

// Function GYMGAME.GymAnimationControl.SetFPHideAllArms
// 0x0001 (0x0001 - 0x0000)
struct GymAnimationControl_SetFPHideAllArms final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAnimationControl_SetFPHideAllArms) == 0x000001, "Wrong alignment on GymAnimationControl_SetFPHideAllArms");
static_assert(sizeof(GymAnimationControl_SetFPHideAllArms) == 0x000001, "Wrong size on GymAnimationControl_SetFPHideAllArms");
static_assert(offsetof(GymAnimationControl_SetFPHideAllArms, State) == 0x000000, "Member 'GymAnimationControl_SetFPHideAllArms::State' has a wrong offset!");

// Function GYMGAME.GymAnimationControl.SetFPHideLegs
// 0x0001 (0x0001 - 0x0000)
struct GymAnimationControl_SetFPHideLegs final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAnimationControl_SetFPHideLegs) == 0x000001, "Wrong alignment on GymAnimationControl_SetFPHideLegs");
static_assert(sizeof(GymAnimationControl_SetFPHideLegs) == 0x000001, "Wrong size on GymAnimationControl_SetFPHideLegs");
static_assert(offsetof(GymAnimationControl_SetFPHideLegs, State) == 0x000000, "Member 'GymAnimationControl_SetFPHideLegs::State' has a wrong offset!");

// Function GYMGAME.GymAnimationControl.SetFPHideTorso
// 0x0001 (0x0001 - 0x0000)
struct GymAnimationControl_SetFPHideTorso final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAnimationControl_SetFPHideTorso) == 0x000001, "Wrong alignment on GymAnimationControl_SetFPHideTorso");
static_assert(sizeof(GymAnimationControl_SetFPHideTorso) == 0x000001, "Wrong size on GymAnimationControl_SetFPHideTorso");
static_assert(offsetof(GymAnimationControl_SetFPHideTorso, State) == 0x000000, "Member 'GymAnimationControl_SetFPHideTorso::State' has a wrong offset!");

// Function GYMGAME.GymAnimationControl.SetOverlayMaterial
// 0x0008 (0x0008 - 0x0000)
struct GymAnimationControl_SetOverlayMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAnimationControl_SetOverlayMaterial) == 0x000008, "Wrong alignment on GymAnimationControl_SetOverlayMaterial");
static_assert(sizeof(GymAnimationControl_SetOverlayMaterial) == 0x000008, "Wrong size on GymAnimationControl_SetOverlayMaterial");
static_assert(offsetof(GymAnimationControl_SetOverlayMaterial, Material) == 0x000000, "Member 'GymAnimationControl_SetOverlayMaterial::Material' has a wrong offset!");

// Function GYMGAME.GymAnimationControl.SetThirdPersonBody
// 0x0001 (0x0001 - 0x0000)
struct GymAnimationControl_SetThirdPersonBody final
{
public:
	bool                                          Force;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAnimationControl_SetThirdPersonBody) == 0x000001, "Wrong alignment on GymAnimationControl_SetThirdPersonBody");
static_assert(sizeof(GymAnimationControl_SetThirdPersonBody) == 0x000001, "Wrong size on GymAnimationControl_SetThirdPersonBody");
static_assert(offsetof(GymAnimationControl_SetThirdPersonBody, Force) == 0x000000, "Member 'GymAnimationControl_SetThirdPersonBody::Force' has a wrong offset!");

// Function GYMGAME.GymAnimationControl.GetUtilAnimator
// 0x0008 (0x0008 - 0x0000)
struct GymAnimationControl_GetUtilAnimator final
{
public:
	class UGymUtilityAnimator*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymAnimationControl_GetUtilAnimator) == 0x000008, "Wrong alignment on GymAnimationControl_GetUtilAnimator");
static_assert(sizeof(GymAnimationControl_GetUtilAnimator) == 0x000008, "Wrong size on GymAnimationControl_GetUtilAnimator");
static_assert(offsetof(GymAnimationControl_GetUtilAnimator, ReturnValue) == 0x000000, "Member 'GymAnimationControl_GetUtilAnimator::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.BPHighlightWidget
// 0x0008 (0x0008 - 0x0000)
struct GymGuiMetaWidget_BPHighlightWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiMetaWidget_BPHighlightWidget) == 0x000008, "Wrong alignment on GymGuiMetaWidget_BPHighlightWidget");
static_assert(sizeof(GymGuiMetaWidget_BPHighlightWidget) == 0x000008, "Wrong size on GymGuiMetaWidget_BPHighlightWidget");
static_assert(offsetof(GymGuiMetaWidget_BPHighlightWidget, Widget) == 0x000000, "Member 'GymGuiMetaWidget_BPHighlightWidget::Widget' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.DoesAnotherWidgetHavePriority
// 0x0001 (0x0001 - 0x0000)
struct GymGuiMetaWidget_DoesAnotherWidgetHavePriority final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiMetaWidget_DoesAnotherWidgetHavePriority) == 0x000001, "Wrong alignment on GymGuiMetaWidget_DoesAnotherWidgetHavePriority");
static_assert(sizeof(GymGuiMetaWidget_DoesAnotherWidgetHavePriority) == 0x000001, "Wrong size on GymGuiMetaWidget_DoesAnotherWidgetHavePriority");
static_assert(offsetof(GymGuiMetaWidget_DoesAnotherWidgetHavePriority, ReturnValue) == 0x000000, "Member 'GymGuiMetaWidget_DoesAnotherWidgetHavePriority::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.FakeClickHighlightedTextFieldGamepad
// 0x0001 (0x0001 - 0x0000)
struct GymGuiMetaWidget_FakeClickHighlightedTextFieldGamepad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiMetaWidget_FakeClickHighlightedTextFieldGamepad) == 0x000001, "Wrong alignment on GymGuiMetaWidget_FakeClickHighlightedTextFieldGamepad");
static_assert(sizeof(GymGuiMetaWidget_FakeClickHighlightedTextFieldGamepad) == 0x000001, "Wrong size on GymGuiMetaWidget_FakeClickHighlightedTextFieldGamepad");
static_assert(offsetof(GymGuiMetaWidget_FakeClickHighlightedTextFieldGamepad, ReturnValue) == 0x000000, "Member 'GymGuiMetaWidget_FakeClickHighlightedTextFieldGamepad::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.GamepadUINavigate
// 0x0020 (0x0020 - 0x0000)
struct GymGuiMetaWidget_GamepadUINavigate final
{
public:
	EUINavDirection                               Direction;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        Widgets;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GymGuiMetaWidget_GamepadUINavigate) == 0x000008, "Wrong alignment on GymGuiMetaWidget_GamepadUINavigate");
static_assert(sizeof(GymGuiMetaWidget_GamepadUINavigate) == 0x000020, "Wrong size on GymGuiMetaWidget_GamepadUINavigate");
static_assert(offsetof(GymGuiMetaWidget_GamepadUINavigate, Direction) == 0x000000, "Member 'GymGuiMetaWidget_GamepadUINavigate::Direction' has a wrong offset!");
static_assert(offsetof(GymGuiMetaWidget_GamepadUINavigate, Widgets) == 0x000008, "Member 'GymGuiMetaWidget_GamepadUINavigate::Widgets' has a wrong offset!");
static_assert(offsetof(GymGuiMetaWidget_GamepadUINavigate, ReturnValue) == 0x000018, "Member 'GymGuiMetaWidget_GamepadUINavigate::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.GetInputPriority
// 0x0004 (0x0004 - 0x0000)
struct GymGuiMetaWidget_GetInputPriority final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiMetaWidget_GetInputPriority) == 0x000004, "Wrong alignment on GymGuiMetaWidget_GetInputPriority");
static_assert(sizeof(GymGuiMetaWidget_GetInputPriority) == 0x000004, "Wrong size on GymGuiMetaWidget_GetInputPriority");
static_assert(offsetof(GymGuiMetaWidget_GetInputPriority, ReturnValue) == 0x000000, "Member 'GymGuiMetaWidget_GetInputPriority::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.HighlightWidget
// 0x0010 (0x0010 - 0x0000)
struct GymGuiMetaWidget_HighlightWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIHoverRequirement                           HoverRequirement;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GymGuiMetaWidget_HighlightWidget) == 0x000008, "Wrong alignment on GymGuiMetaWidget_HighlightWidget");
static_assert(sizeof(GymGuiMetaWidget_HighlightWidget) == 0x000010, "Wrong size on GymGuiMetaWidget_HighlightWidget");
static_assert(offsetof(GymGuiMetaWidget_HighlightWidget, Widget) == 0x000000, "Member 'GymGuiMetaWidget_HighlightWidget::Widget' has a wrong offset!");
static_assert(offsetof(GymGuiMetaWidget_HighlightWidget, HoverRequirement) == 0x000008, "Member 'GymGuiMetaWidget_HighlightWidget::HoverRequirement' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.IsOpenVisibleAndHasPriority
// 0x0001 (0x0001 - 0x0000)
struct GymGuiMetaWidget_IsOpenVisibleAndHasPriority final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiMetaWidget_IsOpenVisibleAndHasPriority) == 0x000001, "Wrong alignment on GymGuiMetaWidget_IsOpenVisibleAndHasPriority");
static_assert(sizeof(GymGuiMetaWidget_IsOpenVisibleAndHasPriority) == 0x000001, "Wrong size on GymGuiMetaWidget_IsOpenVisibleAndHasPriority");
static_assert(offsetof(GymGuiMetaWidget_IsOpenVisibleAndHasPriority, ReturnValue) == 0x000000, "Member 'GymGuiMetaWidget_IsOpenVisibleAndHasPriority::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.IsWidgetVisible
// 0x0010 (0x0010 - 0x0000)
struct GymGuiMetaWidget_IsWidgetVisible final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GymGuiMetaWidget_IsWidgetVisible) == 0x000008, "Wrong alignment on GymGuiMetaWidget_IsWidgetVisible");
static_assert(sizeof(GymGuiMetaWidget_IsWidgetVisible) == 0x000010, "Wrong size on GymGuiMetaWidget_IsWidgetVisible");
static_assert(offsetof(GymGuiMetaWidget_IsWidgetVisible, Widget) == 0x000000, "Member 'GymGuiMetaWidget_IsWidgetVisible::Widget' has a wrong offset!");
static_assert(offsetof(GymGuiMetaWidget_IsWidgetVisible, ReturnValue) == 0x000008, "Member 'GymGuiMetaWidget_IsWidgetVisible::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.SetInputPriority
// 0x0004 (0x0004 - 0x0000)
struct GymGuiMetaWidget_SetInputPriority final
{
public:
	int32                                         NewPriority;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiMetaWidget_SetInputPriority) == 0x000004, "Wrong alignment on GymGuiMetaWidget_SetInputPriority");
static_assert(sizeof(GymGuiMetaWidget_SetInputPriority) == 0x000004, "Wrong size on GymGuiMetaWidget_SetInputPriority");
static_assert(offsetof(GymGuiMetaWidget_SetInputPriority, NewPriority) == 0x000000, "Member 'GymGuiMetaWidget_SetInputPriority::NewPriority' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.SimulateGamepadUINavigate
// 0x0020 (0x0020 - 0x0000)
struct GymGuiMetaWidget_SimulateGamepadUINavigate final
{
public:
	EUINavDirection                               Direction;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        Widgets;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UWidget*                                NextWidget;                                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiMetaWidget_SimulateGamepadUINavigate) == 0x000008, "Wrong alignment on GymGuiMetaWidget_SimulateGamepadUINavigate");
static_assert(sizeof(GymGuiMetaWidget_SimulateGamepadUINavigate) == 0x000020, "Wrong size on GymGuiMetaWidget_SimulateGamepadUINavigate");
static_assert(offsetof(GymGuiMetaWidget_SimulateGamepadUINavigate, Direction) == 0x000000, "Member 'GymGuiMetaWidget_SimulateGamepadUINavigate::Direction' has a wrong offset!");
static_assert(offsetof(GymGuiMetaWidget_SimulateGamepadUINavigate, Widgets) == 0x000008, "Member 'GymGuiMetaWidget_SimulateGamepadUINavigate::Widgets' has a wrong offset!");
static_assert(offsetof(GymGuiMetaWidget_SimulateGamepadUINavigate, NextWidget) == 0x000018, "Member 'GymGuiMetaWidget_SimulateGamepadUINavigate::NextWidget' has a wrong offset!");

// Function GYMGAME.GymGuiMetaWidget.IsOpen
// 0x0001 (0x0001 - 0x0000)
struct GymGuiMetaWidget_IsOpen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiMetaWidget_IsOpen) == 0x000001, "Wrong alignment on GymGuiMetaWidget_IsOpen");
static_assert(sizeof(GymGuiMetaWidget_IsOpen) == 0x000001, "Wrong size on GymGuiMetaWidget_IsOpen");
static_assert(offsetof(GymGuiMetaWidget_IsOpen, ReturnValue) == 0x000000, "Member 'GymGuiMetaWidget_IsOpen::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymBaseGameMode.GetRuleInstance
// 0x0008 (0x0008 - 0x0000)
struct GymBaseGameMode_GetRuleInstance final
{
public:
	class UGymRules*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymBaseGameMode_GetRuleInstance) == 0x000008, "Wrong alignment on GymBaseGameMode_GetRuleInstance");
static_assert(sizeof(GymBaseGameMode_GetRuleInstance) == 0x000008, "Wrong size on GymBaseGameMode_GetRuleInstance");
static_assert(offsetof(GymBaseGameMode_GetRuleInstance, ReturnValue) == 0x000000, "Member 'GymBaseGameMode_GetRuleInstance::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymBaseGameMode.IsCurrentlyInCareer
// 0x0001 (0x0001 - 0x0000)
struct GymBaseGameMode_IsCurrentlyInCareer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymBaseGameMode_IsCurrentlyInCareer) == 0x000001, "Wrong alignment on GymBaseGameMode_IsCurrentlyInCareer");
static_assert(sizeof(GymBaseGameMode_IsCurrentlyInCareer) == 0x000001, "Wrong size on GymBaseGameMode_IsCurrentlyInCareer");
static_assert(offsetof(GymBaseGameMode_IsCurrentlyInCareer, ReturnValue) == 0x000000, "Member 'GymBaseGameMode_IsCurrentlyInCareer::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymBaseGameMode.PauseGymGame
// 0x0008 (0x0008 - 0x0000)
struct GymBaseGameMode_PauseGymGame final
{
public:
	class UObject*                                Pauser;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymBaseGameMode_PauseGymGame) == 0x000008, "Wrong alignment on GymBaseGameMode_PauseGymGame");
static_assert(sizeof(GymBaseGameMode_PauseGymGame) == 0x000008, "Wrong size on GymBaseGameMode_PauseGymGame");
static_assert(offsetof(GymBaseGameMode_PauseGymGame, Pauser) == 0x000000, "Member 'GymBaseGameMode_PauseGymGame::Pauser' has a wrong offset!");

// Function GYMGAME.GymBaseGameMode.UnPauseGymGame
// 0x0010 (0x0010 - 0x0000)
struct GymBaseGameMode_UnPauseGymGame final
{
public:
	class UObject*                                Pauser;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GymBaseGameMode_UnPauseGymGame) == 0x000008, "Wrong alignment on GymBaseGameMode_UnPauseGymGame");
static_assert(sizeof(GymBaseGameMode_UnPauseGymGame) == 0x000010, "Wrong size on GymBaseGameMode_UnPauseGymGame");
static_assert(offsetof(GymBaseGameMode_UnPauseGymGame, Pauser) == 0x000000, "Member 'GymBaseGameMode_UnPauseGymGame::Pauser' has a wrong offset!");
static_assert(offsetof(GymBaseGameMode_UnPauseGymGame, bForce) == 0x000008, "Member 'GymBaseGameMode_UnPauseGymGame::bForce' has a wrong offset!");

// Function GYMGAME.GymBaseGameMode.SendRaceStartAnalytics
// 0x0018 (0x0018 - 0x0000)
struct GymBaseGameMode_SendRaceStartAnalytics final
{
public:
	struct FRuleStartInfo                         Info;                                              // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymBaseGameMode_SendRaceStartAnalytics) == 0x000008, "Wrong alignment on GymBaseGameMode_SendRaceStartAnalytics");
static_assert(sizeof(GymBaseGameMode_SendRaceStartAnalytics) == 0x000018, "Wrong size on GymBaseGameMode_SendRaceStartAnalytics");
static_assert(offsetof(GymBaseGameMode_SendRaceStartAnalytics, Info) == 0x000000, "Member 'GymBaseGameMode_SendRaceStartAnalytics::Info' has a wrong offset!");

// Function GYMGAME.GymRules.CalculateTournamentScoreForStanding
// 0x0008 (0x0008 - 0x0000)
struct GymRules_CalculateTournamentScoreForStanding final
{
public:
	int32                                         Standing;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymRules_CalculateTournamentScoreForStanding) == 0x000004, "Wrong alignment on GymRules_CalculateTournamentScoreForStanding");
static_assert(sizeof(GymRules_CalculateTournamentScoreForStanding) == 0x000008, "Wrong size on GymRules_CalculateTournamentScoreForStanding");
static_assert(offsetof(GymRules_CalculateTournamentScoreForStanding, Standing) == 0x000000, "Member 'GymRules_CalculateTournamentScoreForStanding::Standing' has a wrong offset!");
static_assert(offsetof(GymRules_CalculateTournamentScoreForStanding, ReturnValue) == 0x000004, "Member 'GymRules_CalculateTournamentScoreForStanding::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymRules.GetGameModeId
// 0x0010 (0x0010 - 0x0000)
struct GymRules_GetGameModeId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymRules_GetGameModeId) == 0x000008, "Wrong alignment on GymRules_GetGameModeId");
static_assert(sizeof(GymRules_GetGameModeId) == 0x000010, "Wrong size on GymRules_GetGameModeId");
static_assert(offsetof(GymRules_GetGameModeId, ReturnValue) == 0x000000, "Member 'GymRules_GetGameModeId::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymGuiGlobalMetaWidget.OnWindowFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct GymGuiGlobalMetaWidget_OnWindowFocusChanged final
{
public:
	bool                                          bHasFocus;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiGlobalMetaWidget_OnWindowFocusChanged) == 0x000001, "Wrong alignment on GymGuiGlobalMetaWidget_OnWindowFocusChanged");
static_assert(sizeof(GymGuiGlobalMetaWidget_OnWindowFocusChanged) == 0x000001, "Wrong size on GymGuiGlobalMetaWidget_OnWindowFocusChanged");
static_assert(offsetof(GymGuiGlobalMetaWidget_OnWindowFocusChanged, bHasFocus) == 0x000000, "Member 'GymGuiGlobalMetaWidget_OnWindowFocusChanged::bHasFocus' has a wrong offset!");

// Function GYMGAME.GymCareerRules.BP_SetupEndCutscene
// 0x0008 (0x0008 - 0x0000)
struct GymCareerRules_BP_SetupEndCutscene final
{
public:
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymCareerRules_BP_SetupEndCutscene) == 0x000008, "Wrong alignment on GymCareerRules_BP_SetupEndCutscene");
static_assert(sizeof(GymCareerRules_BP_SetupEndCutscene) == 0x000008, "Wrong size on GymCareerRules_BP_SetupEndCutscene");
static_assert(offsetof(GymCareerRules_BP_SetupEndCutscene, SequenceActor) == 0x000000, "Member 'GymCareerRules_BP_SetupEndCutscene::SequenceActor' has a wrong offset!");

// Function GYMGAME.GymCareerRules.BP_SetupStartCutscene
// 0x0008 (0x0008 - 0x0000)
struct GymCareerRules_BP_SetupStartCutscene final
{
public:
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymCareerRules_BP_SetupStartCutscene) == 0x000008, "Wrong alignment on GymCareerRules_BP_SetupStartCutscene");
static_assert(sizeof(GymCareerRules_BP_SetupStartCutscene) == 0x000008, "Wrong size on GymCareerRules_BP_SetupStartCutscene");
static_assert(offsetof(GymCareerRules_BP_SetupStartCutscene, SequenceActor) == 0x000000, "Member 'GymCareerRules_BP_SetupStartCutscene::SequenceActor' has a wrong offset!");

// Function GYMGAME.GymCareerRules.SpawnActorOfClass
// 0x0080 (0x0080 - 0x0000)
struct GymCareerRules_SpawnActorOfClass final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GymCareerRules_SpawnActorOfClass) == 0x000010, "Wrong alignment on GymCareerRules_SpawnActorOfClass");
static_assert(sizeof(GymCareerRules_SpawnActorOfClass) == 0x000080, "Wrong size on GymCareerRules_SpawnActorOfClass");
static_assert(offsetof(GymCareerRules_SpawnActorOfClass, ActorClass) == 0x000000, "Member 'GymCareerRules_SpawnActorOfClass::ActorClass' has a wrong offset!");
static_assert(offsetof(GymCareerRules_SpawnActorOfClass, Transform) == 0x000010, "Member 'GymCareerRules_SpawnActorOfClass::Transform' has a wrong offset!");
static_assert(offsetof(GymCareerRules_SpawnActorOfClass, ReturnValue) == 0x000070, "Member 'GymCareerRules_SpawnActorOfClass::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymCareerRules.GetCareerName
// 0x0010 (0x0010 - 0x0000)
struct GymCareerRules_GetCareerName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymCareerRules_GetCareerName) == 0x000008, "Wrong alignment on GymCareerRules_GetCareerName");
static_assert(sizeof(GymCareerRules_GetCareerName) == 0x000010, "Wrong size on GymCareerRules_GetCareerName");
static_assert(offsetof(GymCareerRules_GetCareerName, ReturnValue) == 0x000000, "Member 'GymCareerRules_GetCareerName::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymBasicsRules.GoalReached
// 0x0010 (0x0010 - 0x0000)
struct GymBasicsRules_GoalReached final
{
public:
	class AActor*                                 Goal;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGymCharacter*                          PlayerCharacter;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymBasicsRules_GoalReached) == 0x000008, "Wrong alignment on GymBasicsRules_GoalReached");
static_assert(sizeof(GymBasicsRules_GoalReached) == 0x000010, "Wrong size on GymBasicsRules_GoalReached");
static_assert(offsetof(GymBasicsRules_GoalReached, Goal) == 0x000000, "Member 'GymBasicsRules_GoalReached::Goal' has a wrong offset!");
static_assert(offsetof(GymBasicsRules_GoalReached, PlayerCharacter) == 0x000008, "Member 'GymBasicsRules_GoalReached::PlayerCharacter' has a wrong offset!");

// DelegateFunction GYMGAME.GymGuiAssetPropertyEditorWidget.OnPropertyValueChanged__DelegateSignature
// 0x0048 (0x0048 - 0x0000)
struct GymGuiAssetPropertyEditorWidget_OnPropertyValueChanged__DelegateSignature final
{
public:
	struct FGymPropertyValues                     PropertyValue;                                     // 0x0000(0x0048)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiAssetPropertyEditorWidget_OnPropertyValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on GymGuiAssetPropertyEditorWidget_OnPropertyValueChanged__DelegateSignature");
static_assert(sizeof(GymGuiAssetPropertyEditorWidget_OnPropertyValueChanged__DelegateSignature) == 0x000048, "Wrong size on GymGuiAssetPropertyEditorWidget_OnPropertyValueChanged__DelegateSignature");
static_assert(offsetof(GymGuiAssetPropertyEditorWidget_OnPropertyValueChanged__DelegateSignature, PropertyValue) == 0x000000, "Member 'GymGuiAssetPropertyEditorWidget_OnPropertyValueChanged__DelegateSignature::PropertyValue' has a wrong offset!");

// Function GYMGAME.GymGuiAssetPropertyEditorWidget.UpdateProperty
// 0x00D8 (0x00D8 - 0x0000)
struct GymGuiAssetPropertyEditorWidget_UpdateProperty final
{
public:
	struct FGymProperty                           Property;                                          // 0x0000(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymGuiAssetPropertyEditorWidget_UpdateProperty) == 0x000008, "Wrong alignment on GymGuiAssetPropertyEditorWidget_UpdateProperty");
static_assert(sizeof(GymGuiAssetPropertyEditorWidget_UpdateProperty) == 0x0000D8, "Wrong size on GymGuiAssetPropertyEditorWidget_UpdateProperty");
static_assert(offsetof(GymGuiAssetPropertyEditorWidget_UpdateProperty, Property) == 0x000000, "Member 'GymGuiAssetPropertyEditorWidget_UpdateProperty::Property' has a wrong offset!");

// Function GYMGAME.GymMetaRuleMusicState.Client_OnTriggerAudio
// 0x0008 (0x0008 - 0x0000)
struct GymMetaRuleMusicState_Client_OnTriggerAudio final
{
public:
	class FName                                   TriggerName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymMetaRuleMusicState_Client_OnTriggerAudio) == 0x000004, "Wrong alignment on GymMetaRuleMusicState_Client_OnTriggerAudio");
static_assert(sizeof(GymMetaRuleMusicState_Client_OnTriggerAudio) == 0x000008, "Wrong size on GymMetaRuleMusicState_Client_OnTriggerAudio");
static_assert(offsetof(GymMetaRuleMusicState_Client_OnTriggerAudio, TriggerName) == 0x000000, "Member 'GymMetaRuleMusicState_Client_OnTriggerAudio::TriggerName' has a wrong offset!");

// Function GYMGAME.GymMetaRuleMusicState.Client_OnTriggerStingerAudio
// 0x0008 (0x0008 - 0x0000)
struct GymMetaRuleMusicState_Client_OnTriggerStingerAudio final
{
public:
	class FName                                   TriggerName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymMetaRuleMusicState_Client_OnTriggerStingerAudio) == 0x000004, "Wrong alignment on GymMetaRuleMusicState_Client_OnTriggerStingerAudio");
static_assert(sizeof(GymMetaRuleMusicState_Client_OnTriggerStingerAudio) == 0x000008, "Wrong size on GymMetaRuleMusicState_Client_OnTriggerStingerAudio");
static_assert(offsetof(GymMetaRuleMusicState_Client_OnTriggerStingerAudio, TriggerName) == 0x000000, "Member 'GymMetaRuleMusicState_Client_OnTriggerStingerAudio::TriggerName' has a wrong offset!");

// Function GYMGAME.GymObjective.Client_SetCurrentProgression
// 0x0004 (0x0004 - 0x0000)
struct GymObjective_Client_SetCurrentProgression final
{
public:
	float                                         Progression;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_Client_SetCurrentProgression) == 0x000004, "Wrong alignment on GymObjective_Client_SetCurrentProgression");
static_assert(sizeof(GymObjective_Client_SetCurrentProgression) == 0x000004, "Wrong size on GymObjective_Client_SetCurrentProgression");
static_assert(offsetof(GymObjective_Client_SetCurrentProgression, Progression) == 0x000000, "Member 'GymObjective_Client_SetCurrentProgression::Progression' has a wrong offset!");

// Function GYMGAME.GymObjective.Client_SetMaxProgression
// 0x0004 (0x0004 - 0x0000)
struct GymObjective_Client_SetMaxProgression final
{
public:
	float                                         MaxProgress;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_Client_SetMaxProgression) == 0x000004, "Wrong alignment on GymObjective_Client_SetMaxProgression");
static_assert(sizeof(GymObjective_Client_SetMaxProgression) == 0x000004, "Wrong size on GymObjective_Client_SetMaxProgression");
static_assert(offsetof(GymObjective_Client_SetMaxProgression, MaxProgress) == 0x000000, "Member 'GymObjective_Client_SetMaxProgression::MaxProgress' has a wrong offset!");

// Function GYMGAME.GymObjective.Client_SetObjectiveState
// 0x0001 (0x0001 - 0x0000)
struct GymObjective_Client_SetObjectiveState final
{
public:
	EObjectiveState                               State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_Client_SetObjectiveState) == 0x000001, "Wrong alignment on GymObjective_Client_SetObjectiveState");
static_assert(sizeof(GymObjective_Client_SetObjectiveState) == 0x000001, "Wrong size on GymObjective_Client_SetObjectiveState");
static_assert(offsetof(GymObjective_Client_SetObjectiveState, State) == 0x000000, "Member 'GymObjective_Client_SetObjectiveState::State' has a wrong offset!");

// Function GYMGAME.GymObjective.IsObjectiveStarted
// 0x0001 (0x0001 - 0x0000)
struct GymObjective_IsObjectiveStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_IsObjectiveStarted) == 0x000001, "Wrong alignment on GymObjective_IsObjectiveStarted");
static_assert(sizeof(GymObjective_IsObjectiveStarted) == 0x000001, "Wrong size on GymObjective_IsObjectiveStarted");
static_assert(offsetof(GymObjective_IsObjectiveStarted, ReturnValue) == 0x000000, "Member 'GymObjective_IsObjectiveStarted::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymObjective.SetObjectiveState
// 0x0003 (0x0003 - 0x0000)
struct GymObjective_SetObjectiveState final
{
public:
	EObjectiveState                               State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotifyMaster;                                     // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_SetObjectiveState) == 0x000001, "Wrong alignment on GymObjective_SetObjectiveState");
static_assert(sizeof(GymObjective_SetObjectiveState) == 0x000003, "Wrong size on GymObjective_SetObjectiveState");
static_assert(offsetof(GymObjective_SetObjectiveState, State) == 0x000000, "Member 'GymObjective_SetObjectiveState::State' has a wrong offset!");
static_assert(offsetof(GymObjective_SetObjectiveState, bForce) == 0x000001, "Member 'GymObjective_SetObjectiveState::bForce' has a wrong offset!");
static_assert(offsetof(GymObjective_SetObjectiveState, bNotifyMaster) == 0x000002, "Member 'GymObjective_SetObjectiveState::bNotifyMaster' has a wrong offset!");

// Function GYMGAME.GymObjective.GetCurrentProgression
// 0x0004 (0x0004 - 0x0000)
struct GymObjective_GetCurrentProgression final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_GetCurrentProgression) == 0x000004, "Wrong alignment on GymObjective_GetCurrentProgression");
static_assert(sizeof(GymObjective_GetCurrentProgression) == 0x000004, "Wrong size on GymObjective_GetCurrentProgression");
static_assert(offsetof(GymObjective_GetCurrentProgression, ReturnValue) == 0x000000, "Member 'GymObjective_GetCurrentProgression::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymObjective.GetDescriptionText
// 0x0018 (0x0018 - 0x0000)
struct GymObjective_GetDescriptionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_GetDescriptionText) == 0x000008, "Wrong alignment on GymObjective_GetDescriptionText");
static_assert(sizeof(GymObjective_GetDescriptionText) == 0x000018, "Wrong size on GymObjective_GetDescriptionText");
static_assert(offsetof(GymObjective_GetDescriptionText, ReturnValue) == 0x000000, "Member 'GymObjective_GetDescriptionText::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymObjective.GetMaxProgression
// 0x0004 (0x0004 - 0x0000)
struct GymObjective_GetMaxProgression final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_GetMaxProgression) == 0x000004, "Wrong alignment on GymObjective_GetMaxProgression");
static_assert(sizeof(GymObjective_GetMaxProgression) == 0x000004, "Wrong size on GymObjective_GetMaxProgression");
static_assert(offsetof(GymObjective_GetMaxProgression, ReturnValue) == 0x000000, "Member 'GymObjective_GetMaxProgression::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymObjective.GetProgressionText
// 0x0018 (0x0018 - 0x0000)
struct GymObjective_GetProgressionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_GetProgressionText) == 0x000008, "Wrong alignment on GymObjective_GetProgressionText");
static_assert(sizeof(GymObjective_GetProgressionText) == 0x000018, "Wrong size on GymObjective_GetProgressionText");
static_assert(offsetof(GymObjective_GetProgressionText, ReturnValue) == 0x000000, "Member 'GymObjective_GetProgressionText::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymObjective.GetProgressionTextAreaFillOverride
// 0x0004 (0x0004 - 0x0000)
struct GymObjective_GetProgressionTextAreaFillOverride final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_GetProgressionTextAreaFillOverride) == 0x000004, "Wrong alignment on GymObjective_GetProgressionTextAreaFillOverride");
static_assert(sizeof(GymObjective_GetProgressionTextAreaFillOverride) == 0x000004, "Wrong size on GymObjective_GetProgressionTextAreaFillOverride");
static_assert(offsetof(GymObjective_GetProgressionTextAreaFillOverride, ReturnValue) == 0x000000, "Member 'GymObjective_GetProgressionTextAreaFillOverride::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymObjective.GetState
// 0x0001 (0x0001 - 0x0000)
struct GymObjective_GetState final
{
public:
	EObjectiveState                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GymObjective_GetState) == 0x000001, "Wrong alignment on GymObjective_GetState");
static_assert(sizeof(GymObjective_GetState) == 0x000001, "Wrong size on GymObjective_GetState");
static_assert(offsetof(GymObjective_GetState, ReturnValue) == 0x000000, "Member 'GymObjective_GetState::ReturnValue' has a wrong offset!");

// Function GYMGAME.GymObjective.IsCompleted
