#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymGuiPostflow_BP

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GymGuiPostflow_BP.GymGuiPostflow_BP_C
// 0x0040 (0x0370 - 0x0330)
class UGymGuiPostflow_BP_C final : public UGymGuiMetaWidget
{
public:
	class UWidgetAnimation*                       BadAppear;                                         // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GoodAppear;                                        // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AnnouncementGridBG;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AnnouncementGridBG_1;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BadMainText;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BadSecondaryText;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GoodMainText;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GoodSecondaryText;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowBadText(const class FText& Main_Text, const class FText& Flavor_Text);
	void ShowGoodText(const class FText& Main_Text, const class FText& Flavor_Text);
	void ShowText(const class FText& Main_Text, const class FText& Flavor_Text, bool GoodText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GymGuiPostflow_BP_C">();
	}
	static class UGymGuiPostflow_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGuiPostflow_BP_C>();
	}
};
static_assert(alignof(UGymGuiPostflow_BP_C) == 0x000008, "Wrong alignment on UGymGuiPostflow_BP_C");
static_assert(sizeof(UGymGuiPostflow_BP_C) == 0x000370, "Wrong size on UGymGuiPostflow_BP_C");
static_assert(offsetof(UGymGuiPostflow_BP_C, BadAppear) == 0x000330, "Member 'UGymGuiPostflow_BP_C::BadAppear' has a wrong offset!");
static_assert(offsetof(UGymGuiPostflow_BP_C, GoodAppear) == 0x000338, "Member 'UGymGuiPostflow_BP_C::GoodAppear' has a wrong offset!");
static_assert(offsetof(UGymGuiPostflow_BP_C, AnnouncementGridBG) == 0x000340, "Member 'UGymGuiPostflow_BP_C::AnnouncementGridBG' has a wrong offset!");
static_assert(offsetof(UGymGuiPostflow_BP_C, AnnouncementGridBG_1) == 0x000348, "Member 'UGymGuiPostflow_BP_C::AnnouncementGridBG_1' has a wrong offset!");
static_assert(offsetof(UGymGuiPostflow_BP_C, BadMainText) == 0x000350, "Member 'UGymGuiPostflow_BP_C::BadMainText' has a wrong offset!");
static_assert(offsetof(UGymGuiPostflow_BP_C, BadSecondaryText) == 0x000358, "Member 'UGymGuiPostflow_BP_C::BadSecondaryText' has a wrong offset!");
static_assert(offsetof(UGymGuiPostflow_BP_C, GoodMainText) == 0x000360, "Member 'UGymGuiPostflow_BP_C::GoodMainText' has a wrong offset!");
static_assert(offsetof(UGymGuiPostflow_BP_C, GoodSecondaryText) == 0x000368, "Member 'UGymGuiPostflow_BP_C::GoodSecondaryText' has a wrong offset!");

}

