#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymGuiPreflowCountdown_BP

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GymGuiPreflowCountdown_BP.GymGuiPreflowCountdown_BP_C
// 0x0020 (0x0378 - 0x0358)
class UGymGuiPreflowCountdown_BP_C final : public UGymGuiPreflowCountdownWidget
{
public:
	class UImage*                                 Dots1;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dots2;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dots3;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spray;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GymGuiPreflowCountdown_BP_C">();
	}
	static class UGymGuiPreflowCountdown_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGuiPreflowCountdown_BP_C>();
	}
};
static_assert(alignof(UGymGuiPreflowCountdown_BP_C) == 0x000008, "Wrong alignment on UGymGuiPreflowCountdown_BP_C");
static_assert(sizeof(UGymGuiPreflowCountdown_BP_C) == 0x000378, "Wrong size on UGymGuiPreflowCountdown_BP_C");
static_assert(offsetof(UGymGuiPreflowCountdown_BP_C, Dots1) == 0x000358, "Member 'UGymGuiPreflowCountdown_BP_C::Dots1' has a wrong offset!");
static_assert(offsetof(UGymGuiPreflowCountdown_BP_C, Dots2) == 0x000360, "Member 'UGymGuiPreflowCountdown_BP_C::Dots2' has a wrong offset!");
static_assert(offsetof(UGymGuiPreflowCountdown_BP_C, Dots3) == 0x000368, "Member 'UGymGuiPreflowCountdown_BP_C::Dots3' has a wrong offset!");
static_assert(offsetof(UGymGuiPreflowCountdown_BP_C, Spray) == 0x000370, "Member 'UGymGuiPreflowCountdown_BP_C::Spray' has a wrong offset!");

}

