#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GYMGAME

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GYMGAME_structs.hpp"
#include "AIModule_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "AutoSettingsInput_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "PhysicsCore_classes.hpp"
#include "CommonUI_classes.hpp"
#include "AutoSettings_classes.hpp"


namespace SDK
{

// Class GYMGAME.CameraPreflow
// 0x0010 (0x02A8 - 0x0298)
class ACameraPreflow : public AActor
{
public:
	FMulticastInlineDelegateProperty_             OnGymCameraPreflowEnded;                           // 0x0298(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	void GymCameraPreflowEnded__DelegateSignature();
	void StartPreraceSequence();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraPreflow">();
	}
	static class ACameraPreflow* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraPreflow>();
	}
};
static_assert(alignof(ACameraPreflow) == 0x000008, "Wrong alignment on ACameraPreflow");
static_assert(sizeof(ACameraPreflow) == 0x0002A8, "Wrong size on ACameraPreflow");
static_assert(offsetof(ACameraPreflow, OnGymCameraPreflowEnded) == 0x000298, "Member 'ACameraPreflow::OnGymCameraPreflowEnded' has a wrong offset!");

// Class GYMGAME.GymGameModeMusicDataFile
// 0x0008 (0x0038 - 0x0030)
class UGymGameModeMusicDataFile final : public UPrimaryDataAsset
{
public:
	class FName                                   AssetName;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymGameModeMusicDataFile">();
	}
	static class UGymGameModeMusicDataFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGameModeMusicDataFile>();
	}
};
static_assert(alignof(UGymGameModeMusicDataFile) == 0x000008, "Wrong alignment on UGymGameModeMusicDataFile");
static_assert(sizeof(UGymGameModeMusicDataFile) == 0x000038, "Wrong size on UGymGameModeMusicDataFile");
static_assert(offsetof(UGymGameModeMusicDataFile, AssetName) == 0x000030, "Member 'UGymGameModeMusicDataFile::AssetName' has a wrong offset!");

// Class GYMGAME.ClimbableWall
// 0x0000 (0x00A0 - 0x00A0)
class UClimbableWall final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClimbableWall">();
	}
	static class UClimbableWall* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClimbableWall>();
	}
};
static_assert(alignof(UClimbableWall) == 0x000008, "Wrong alignment on UClimbableWall");
static_assert(sizeof(UClimbableWall) == 0x0000A0, "Wrong size on UClimbableWall");

// Class GYMGAME.EditorGizmo
// 0x0028 (0x02C0 - 0x0298)
class AEditorGizmo : public AActor
{
public:
	class USceneComponent*                        GymPivot;                                          // 0x0298(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   YawRotationMesh;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   PitchRotationMesh;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   RollRotationMesh;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EnableAxis(ERotationAxis RotationAxis);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorGizmo">();
	}
	static class AEditorGizmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorGizmo>();
	}
};
static_assert(alignof(AEditorGizmo) == 0x000008, "Wrong alignment on AEditorGizmo");
static_assert(sizeof(AEditorGizmo) == 0x0002C0, "Wrong size on AEditorGizmo");
static_assert(offsetof(AEditorGizmo, GymPivot) == 0x000298, "Member 'AEditorGizmo::GymPivot' has a wrong offset!");
static_assert(offsetof(AEditorGizmo, YawRotationMesh) == 0x0002A0, "Member 'AEditorGizmo::YawRotationMesh' has a wrong offset!");
static_assert(offsetof(AEditorGizmo, PitchRotationMesh) == 0x0002A8, "Member 'AEditorGizmo::PitchRotationMesh' has a wrong offset!");
static_assert(offsetof(AEditorGizmo, RollRotationMesh) == 0x0002B0, "Member 'AEditorGizmo::RollRotationMesh' has a wrong offset!");

// Class GYMGAME.GymSplinePlacer
// 0x0098 (0x0330 - 0x0298)
class AGymSplinePlacer : public AActor
{
public:
	class UGymMultiPlacer*                        CurrentPlacer;                                     // 0x0298(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGymSplinePlaceable*                    PreviewAsset;                                      // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AGymStaticLevelAsset>       AssetType;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AGymStaticLevelAsset>       PreviewAssetType;                                  // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoUpdateOnChange;                                // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CustomPlacedSpline;                                // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExtendMultiplier;                                  // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComponent;                                   // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AGymStaticLevelAsset*>           Spawned;                                           // 0x02D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AGymStaticLevelAsset*>           PreviewSpawned;                                    // 0x02E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AGymSplinePlaceable*>            Placeables;                                        // 0x02F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x20];                                     // 0x0300(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseAssetRotation;                                 // 0x0320(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxSlopeAngle;                                     // 0x0324(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHorizontalTurnRate;                             // 0x0328(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleCheckSegmentLength;                           // 0x032C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClearSplineAssets();
	void UpdateSplineAssets();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymSplinePlacer">();
	}
	static class AGymSplinePlacer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGymSplinePlacer>();
	}
};
static_assert(alignof(AGymSplinePlacer) == 0x000008, "Wrong alignment on AGymSplinePlacer");
static_assert(sizeof(AGymSplinePlacer) == 0x000330, "Wrong size on AGymSplinePlacer");
static_assert(offsetof(AGymSplinePlacer, CurrentPlacer) == 0x000298, "Member 'AGymSplinePlacer::CurrentPlacer' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, PreviewAsset) == 0x0002A0, "Member 'AGymSplinePlacer::PreviewAsset' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, AssetType) == 0x0002B0, "Member 'AGymSplinePlacer::AssetType' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, PreviewAssetType) == 0x0002B8, "Member 'AGymSplinePlacer::PreviewAssetType' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, AutoUpdateOnChange) == 0x0002C0, "Member 'AGymSplinePlacer::AutoUpdateOnChange' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, CustomPlacedSpline) == 0x0002C1, "Member 'AGymSplinePlacer::CustomPlacedSpline' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, ExtendMultiplier) == 0x0002C4, "Member 'AGymSplinePlacer::ExtendMultiplier' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, SplineComponent) == 0x0002C8, "Member 'AGymSplinePlacer::SplineComponent' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, Spawned) == 0x0002D0, "Member 'AGymSplinePlacer::Spawned' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, PreviewSpawned) == 0x0002E0, "Member 'AGymSplinePlacer::PreviewSpawned' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, Placeables) == 0x0002F0, "Member 'AGymSplinePlacer::Placeables' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, bUseAssetRotation) == 0x000320, "Member 'AGymSplinePlacer::bUseAssetRotation' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, MaxSlopeAngle) == 0x000324, "Member 'AGymSplinePlacer::MaxSlopeAngle' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, MaxHorizontalTurnRate) == 0x000328, "Member 'AGymSplinePlacer::MaxHorizontalTurnRate' has a wrong offset!");
static_assert(offsetof(AGymSplinePlacer, AngleCheckSegmentLength) == 0x00032C, "Member 'AGymSplinePlacer::AngleCheckSegmentLength' has a wrong offset!");

// Class GYMGAME.GymFinishlineSplinePlacer
// 0x0080 (0x03B0 - 0x0330)
class AGymFinishlineSplinePlacer final : public AGymSplinePlacer
{
public:
	float                                         ShortDistance;                                     // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LongDistance;                                      // 0x0334(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AGymStaticLevelAsset>       AssetShortType;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AGymStaticLevelAsset>       PillarFillerType;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AGymStaticLevelAsset>       PreviewPillarType;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AGymFinishlineBanner>       FinishLineBannerType;                              // 0x0350(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0x18];                                     // 0x0358(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymFinishlineBanner*                   FinishLineBanner;                                  // 0x0370(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGymFinishlinePlaceable*                EndPointPreview;                                   // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AGymStaticLevelAsset*>           LongPreviewSpawnedArray;                           // 0x0380(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AGymStaticLevelAsset*>           ShortPreviewSpawnedArray;                          // 0x0390(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AGymStaticLevelAsset*>           PreviewPillarsFillers;                             // 0x03A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymFinishlineSplinePlacer">();
	}
	static class AGymFinishlineSplinePlacer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGymFinishlineSplinePlacer>();
	}
};
static_assert(alignof(AGymFinishlineSplinePlacer) == 0x000008, "Wrong alignment on AGymFinishlineSplinePlacer");
static_assert(sizeof(AGymFinishlineSplinePlacer) == 0x0003B0, "Wrong size on AGymFinishlineSplinePlacer");
static_assert(offsetof(AGymFinishlineSplinePlacer, ShortDistance) == 0x000330, "Member 'AGymFinishlineSplinePlacer::ShortDistance' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, LongDistance) == 0x000334, "Member 'AGymFinishlineSplinePlacer::LongDistance' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, AssetShortType) == 0x000338, "Member 'AGymFinishlineSplinePlacer::AssetShortType' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, PillarFillerType) == 0x000340, "Member 'AGymFinishlineSplinePlacer::PillarFillerType' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, PreviewPillarType) == 0x000348, "Member 'AGymFinishlineSplinePlacer::PreviewPillarType' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, FinishLineBannerType) == 0x000350, "Member 'AGymFinishlineSplinePlacer::FinishLineBannerType' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, FinishLineBanner) == 0x000370, "Member 'AGymFinishlineSplinePlacer::FinishLineBanner' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, EndPointPreview) == 0x000378, "Member 'AGymFinishlineSplinePlacer::EndPointPreview' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, LongPreviewSpawnedArray) == 0x000380, "Member 'AGymFinishlineSplinePlacer::LongPreviewSpawnedArray' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, ShortPreviewSpawnedArray) == 0x000390, "Member 'AGymFinishlineSplinePlacer::ShortPreviewSpawnedArray' has a wrong offset!");
static_assert(offsetof(AGymFinishlineSplinePlacer, PreviewPillarsFillers) == 0x0003A0, "Member 'AGymFinishlineSplinePlacer::PreviewPillarsFillers' has a wrong offset!");

// Class GYMGAME.ExtendableBackgroundCell
// 0x0018 (0x02B0 - 0x0298)
class AExtendableBackgroundCell final : public AActor
{
public:
	uint8                                         Pad_298[0x1];                                      // 0x0298(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Claimed;                                           // 0x0299(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HalfSize;                                          // 0x029C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SkyboxActorTag;                                    // 0x02A0(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BuildableFloorTag;                                 // 0x02A8(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CheckStartClaimed();
	void OnClaimedChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExtendableBackgroundCell">();
	}
	static class AExtendableBackgroundCell* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExtendableBackgroundCell>();
	}
};
static_assert(alignof(AExtendableBackgroundCell) == 0x000008, "Wrong alignment on AExtendableBackgroundCell");
static_assert(sizeof(AExtendableBackgroundCell) == 0x0002B0, "Wrong size on AExtendableBackgroundCell");
static_assert(offsetof(AExtendableBackgroundCell, Claimed) == 0x000299, "Member 'AExtendableBackgroundCell::Claimed' has a wrong offset!");
static_assert(offsetof(AExtendableBackgroundCell, HalfSize) == 0x00029C, "Member 'AExtendableBackgroundCell::HalfSize' has a wrong offset!");
static_assert(offsetof(AExtendableBackgroundCell, SkyboxActorTag) == 0x0002A0, "Member 'AExtendableBackgroundCell::SkyboxActorTag' has a wrong offset!");
static_assert(offsetof(AExtendableBackgroundCell, BuildableFloorTag) == 0x0002A8, "Member 'AExtendableBackgroundCell::BuildableFloorTag' has a wrong offset!");

// Class GYMGAME.Gym3DWidgetComponent
// 0x0040 (0x0730 - 0x06F0)
class UGym3DWidgetComponent final : public UWidgetComponent
{
public:
	class UUserWidget*                            UsingWidget;                                       // 0x06F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCommonActionWidget*>            CommonUIActionWidgets;                             // 0x06F8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FColor                                 ColorMask;                                         // 0x0708(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LookAtLocalPlayer;                                 // 0x070C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideMinMaxVisibilityRange;                     // 0x070D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseMinMaxVisibilityRange;                          // 0x070E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70F[0x1];                                      // 0x070F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinVisibilityRange;                                // 0x0710(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVisibilityRange;                                // 0x0714(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideFadeSpeed;                                 // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeSpeed;                                         // 0x071C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseOverrideCommonUIIconRenderScale;                // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideCommonUIIconRenderScale;                   // 0x0724(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_728[0x8];                                      // 0x0728(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Gym3DWidgetComponent">();
	}
	static class UGym3DWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGym3DWidgetComponent>();
	}
};
static_assert(alignof(UGym3DWidgetComponent) == 0x000010, "Wrong alignment on UGym3DWidgetComponent");
static_assert(sizeof(UGym3DWidgetComponent) == 0x000730, "Wrong size on UGym3DWidgetComponent");
static_assert(offsetof(UGym3DWidgetComponent, UsingWidget) == 0x0006F0, "Member 'UGym3DWidgetComponent::UsingWidget' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, CommonUIActionWidgets) == 0x0006F8, "Member 'UGym3DWidgetComponent::CommonUIActionWidgets' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, ColorMask) == 0x000708, "Member 'UGym3DWidgetComponent::ColorMask' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, LookAtLocalPlayer) == 0x00070C, "Member 'UGym3DWidgetComponent::LookAtLocalPlayer' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, OverrideMinMaxVisibilityRange) == 0x00070D, "Member 'UGym3DWidgetComponent::OverrideMinMaxVisibilityRange' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, UseMinMaxVisibilityRange) == 0x00070E, "Member 'UGym3DWidgetComponent::UseMinMaxVisibilityRange' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, MinVisibilityRange) == 0x000710, "Member 'UGym3DWidgetComponent::MinVisibilityRange' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, MaxVisibilityRange) == 0x000714, "Member 'UGym3DWidgetComponent::MaxVisibilityRange' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, OverrideFadeSpeed) == 0x000718, "Member 'UGym3DWidgetComponent::OverrideFadeSpeed' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, FadeSpeed) == 0x00071C, "Member 'UGym3DWidgetComponent::FadeSpeed' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, UseOverrideCommonUIIconRenderScale) == 0x000720, "Member 'UGym3DWidgetComponent::UseOverrideCommonUIIconRenderScale' has a wrong offset!");
static_assert(offsetof(UGym3DWidgetComponent, OverrideCommonUIIconRenderScale) == 0x000724, "Member 'UGym3DWidgetComponent::OverrideCommonUIIconRenderScale' has a wrong offset!");

// Class GYMGAME.GymGlobalMetaControl
// 0x0008 (0x00A8 - 0x00A0)
class UGymGlobalMetaControl : public UActorComponent
{
public:
	class AGymPlayerController*                   Master;                                            // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymGlobalMetaControl">();
	}
	static class UGymGlobalMetaControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGlobalMetaControl>();
	}
};
static_assert(alignof(UGymGlobalMetaControl) == 0x000008, "Wrong alignment on UGymGlobalMetaControl");
static_assert(sizeof(UGymGlobalMetaControl) == 0x0000A8, "Wrong size on UGymGlobalMetaControl");
static_assert(offsetof(UGymGlobalMetaControl, Master) == 0x0000A0, "Member 'UGymGlobalMetaControl::Master' has a wrong offset!");

// Class GYMGAME.GymGlobalActionControl
// 0x00D8 (0x0180 - 0x00A8)
class UGymGlobalActionControl final : public UGymGlobalMetaControl
{
public:
	TArray<class UGymMetaAction*>                 AllActions;                                        // 0x00A8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FGymActionContainer>            ActionPages;                                       // 0x00B8(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UGymToggleCameraAction*                 ToggleCameraAction;                                // 0x00C8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTogglePhotoModeAction*              TogglePhotomodeAction;                             // 0x00D0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymMarkLocationAction*                 MarkLocationAction;                                // 0x00D8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymRespawnAction*                      RespawnAction;                                     // 0x00E0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymEndMatchAction*                     EndMatchAction;                                    // 0x00E8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymStartMatchAction*                   StartMatchAction;                                  // 0x00F0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymVoteAction*                         VoteAction;                                        // 0x00F8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymCancelVoteAction*                   CancelVoteAction;                                  // 0x0100(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymAddFlagAction*                      AddFlagAction;                                     // 0x0108(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymGiveUpAction*                       GiveUpAction;                                      // 0x0110(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction1;                                      // 0x0118(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction2;                                      // 0x0120(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction3;                                      // 0x0128(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction4;                                      // 0x0130(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction5;                                      // 0x0138(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction6;                                      // 0x0140(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction7;                                      // 0x0148(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction8;                                      // 0x0150(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymTauntAction*                        TauntAction9;                                      // 0x0158(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymSprayAction*                        SprayAction1;                                      // 0x0160(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymSprayAction*                        SprayAction2;                                      // 0x0168(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymSprayAction*                        SprayAction3;                                      // 0x0170(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymSprayAction*                        SprayAction4;                                      // 0x0178(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	const TArray<class UGymMetaAction*> GetActionsFromPage(int32 Page);
	const TArray<class UGymMetaAction*> GetAllActions();
	bool GetPageData(int32 Page, struct FGymActionContainer* OutActionData);
	int32 GetPageNum();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymGlobalActionControl">();
	}
	static class UGymGlobalActionControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGlobalActionControl>();
	}
};
static_assert(alignof(UGymGlobalActionControl) == 0x000008, "Wrong alignment on UGymGlobalActionControl");
static_assert(sizeof(UGymGlobalActionControl) == 0x000180, "Wrong size on UGymGlobalActionControl");
static_assert(offsetof(UGymGlobalActionControl, AllActions) == 0x0000A8, "Member 'UGymGlobalActionControl::AllActions' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, ActionPages) == 0x0000B8, "Member 'UGymGlobalActionControl::ActionPages' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, ToggleCameraAction) == 0x0000C8, "Member 'UGymGlobalActionControl::ToggleCameraAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TogglePhotomodeAction) == 0x0000D0, "Member 'UGymGlobalActionControl::TogglePhotomodeAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, MarkLocationAction) == 0x0000D8, "Member 'UGymGlobalActionControl::MarkLocationAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, RespawnAction) == 0x0000E0, "Member 'UGymGlobalActionControl::RespawnAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, EndMatchAction) == 0x0000E8, "Member 'UGymGlobalActionControl::EndMatchAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, StartMatchAction) == 0x0000F0, "Member 'UGymGlobalActionControl::StartMatchAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, VoteAction) == 0x0000F8, "Member 'UGymGlobalActionControl::VoteAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, CancelVoteAction) == 0x000100, "Member 'UGymGlobalActionControl::CancelVoteAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, AddFlagAction) == 0x000108, "Member 'UGymGlobalActionControl::AddFlagAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, GiveUpAction) == 0x000110, "Member 'UGymGlobalActionControl::GiveUpAction' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction1) == 0x000118, "Member 'UGymGlobalActionControl::TauntAction1' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction2) == 0x000120, "Member 'UGymGlobalActionControl::TauntAction2' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction3) == 0x000128, "Member 'UGymGlobalActionControl::TauntAction3' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction4) == 0x000130, "Member 'UGymGlobalActionControl::TauntAction4' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction5) == 0x000138, "Member 'UGymGlobalActionControl::TauntAction5' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction6) == 0x000140, "Member 'UGymGlobalActionControl::TauntAction6' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction7) == 0x000148, "Member 'UGymGlobalActionControl::TauntAction7' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction8) == 0x000150, "Member 'UGymGlobalActionControl::TauntAction8' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, TauntAction9) == 0x000158, "Member 'UGymGlobalActionControl::TauntAction9' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, SprayAction1) == 0x000160, "Member 'UGymGlobalActionControl::SprayAction1' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, SprayAction2) == 0x000168, "Member 'UGymGlobalActionControl::SprayAction2' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, SprayAction3) == 0x000170, "Member 'UGymGlobalActionControl::SprayAction3' has a wrong offset!");
static_assert(offsetof(UGymGlobalActionControl, SprayAction4) == 0x000178, "Member 'UGymGlobalActionControl::SprayAction4' has a wrong offset!");

// Class GYMGAME.GymAchievements
// 0x0040 (0x0068 - 0x0028)
class UGymAchievements final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DEBUG_ResetAchievements();
	bool SetAchievementWithEnum(EGymAchievement Achievement);
	bool SetAchievementWithString(const class FString& AchievementID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymAchievements">();
	}
	static class UGymAchievements* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymAchievements>();
	}
};
static_assert(alignof(UGymAchievements) == 0x000008, "Wrong alignment on UGymAchievements");
static_assert(sizeof(UGymAchievements) == 0x000068, "Wrong size on UGymAchievements");

// Class GYMGAME.GymActionInputWidget
// 0x0008 (0x02C8 - 0x02C0)
class UGymActionInputWidget : public UUserWidget
{
public:
	class UCommonActionWidget*                    ActionWidget;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetInput(class FName Input);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymActionInputWidget">();
	}
	static class UGymActionInputWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymActionInputWidget>();
	}
};
static_assert(alignof(UGymActionInputWidget) == 0x000008, "Wrong alignment on UGymActionInputWidget");
static_assert(sizeof(UGymActionInputWidget) == 0x0002C8, "Wrong size on UGymActionInputWidget");
static_assert(offsetof(UGymActionInputWidget, ActionWidget) == 0x0002C0, "Member 'UGymActionInputWidget::ActionWidget' has a wrong offset!");

// Class GYMGAME.GymGlobalTickerEventControl
// 0x0008 (0x00B0 - 0x00A8)
class UGymGlobalTickerEventControl final : public UGymGlobalMetaControl
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_AddCustomMessage(TSubclassOf<class UGymGuiTickerMessageWidget> Message, ETickerPosition Position);
	void Client_AddMessage(const struct FTickerSettingsStruct& Settings);
	void Client_RemoveMessage(class FName MessageId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymGlobalTickerEventControl">();
	}
	static class UGymGlobalTickerEventControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGlobalTickerEventControl>();
	}
};
static_assert(alignof(UGymGlobalTickerEventControl) == 0x000008, "Wrong alignment on UGymGlobalTickerEventControl");
static_assert(sizeof(UGymGlobalTickerEventControl) == 0x0000B0, "Wrong size on UGymGlobalTickerEventControl");

// Class GYMGAME.GymMetaAction
// 0x0018 (0x00B8 - 0x00A0)
class UGymMetaAction : public UActorComponent
{
public:
	class UGymGlobalActionControl*                Control;                                           // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ActionIcon;                                        // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool CanPerform();
	class FText GetActionName();
	void PerformAction();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymMetaAction">();
	}
	static class UGymMetaAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymMetaAction>();
	}
};
static_assert(alignof(UGymMetaAction) == 0x000008, "Wrong alignment on UGymMetaAction");
static_assert(sizeof(UGymMetaAction) == 0x0000B8, "Wrong size on UGymMetaAction");
static_assert(offsetof(UGymMetaAction, Control) == 0x0000A0, "Member 'UGymMetaAction::Control' has a wrong offset!");
static_assert(offsetof(UGymMetaAction, ActionIcon) == 0x0000B0, "Member 'UGymMetaAction::ActionIcon' has a wrong offset!");

// Class GYMGAME.GymAddFlagAction
// 0x0000 (0x00B8 - 0x00B8)
class UGymAddFlagAction final : public UGymMetaAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymAddFlagAction">();
	}
	static class UGymAddFlagAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymAddFlagAction>();
	}
};
static_assert(alignof(UGymAddFlagAction) == 0x000008, "Wrong alignment on UGymAddFlagAction");
static_assert(sizeof(UGymAddFlagAction) == 0x0000B8, "Wrong size on UGymAddFlagAction");

// Class GYMGAME.GymGlobalChatControl
// 0x0000 (0x00A8 - 0x00A8)
class UGymGlobalChatControl final : public UGymGlobalMetaControl
{
public:
	void Client_ReceiveMessage(const class FString& PlayerName, const class FString& Message);
	void Server_SendMessage(const class FString& PlayerName, const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymGlobalChatControl">();
	}
	static class UGymGlobalChatControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGlobalChatControl>();
	}
};
static_assert(alignof(UGymGlobalChatControl) == 0x000008, "Wrong alignment on UGymGlobalChatControl");
static_assert(sizeof(UGymGlobalChatControl) == 0x0000A8, "Wrong size on UGymGlobalChatControl");

// Class GYMGAME.GymAIController
// 0x0048 (0x0408 - 0x03C0)
class AGymAIController final : public AAIController
{
public:
	class FString                                 GymId;                                             // 0x03C0(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapName;                                           // 0x03D0(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Difficulty;                                        // 0x03E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E4[0x24];                                     // 0x03E4(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishParticipant();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymAIController">();
	}
	static class AGymAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGymAIController>();
	}
};
static_assert(alignof(AGymAIController) == 0x000008, "Wrong alignment on AGymAIController");
static_assert(sizeof(AGymAIController) == 0x000408, "Wrong size on AGymAIController");
static_assert(offsetof(AGymAIController, GymId) == 0x0003C0, "Member 'AGymAIController::GymId' has a wrong offset!");
static_assert(offsetof(AGymAIController, MapName) == 0x0003D0, "Member 'AGymAIController::MapName' has a wrong offset!");
static_assert(offsetof(AGymAIController, Difficulty) == 0x0003E0, "Member 'AGymAIController::Difficulty' has a wrong offset!");

// Class GYMGAME.GymMetaAnimator
// 0x0008 (0x00A8 - 0x00A0)
class UGymMetaAnimator : public UActorComponent
{
public:
	class UGymAnimationControl*                   Control;                                           // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymMetaAnimator">();
	}
	static class UGymMetaAnimator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymMetaAnimator>();
	}
};
static_assert(alignof(UGymMetaAnimator) == 0x000008, "Wrong alignment on UGymMetaAnimator");
static_assert(sizeof(UGymMetaAnimator) == 0x0000A8, "Wrong size on UGymMetaAnimator");
static_assert(offsetof(UGymMetaAnimator, Control) == 0x0000A0, "Member 'UGymMetaAnimator::Control' has a wrong offset!");

// Class GYMGAME.GymGiveUpAction
// 0x0000 (0x00B8 - 0x00B8)
class UGymGiveUpAction final : public UGymMetaAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymGiveUpAction">();
	}
	static class UGymGiveUpAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGiveUpAction>();
	}
};
static_assert(alignof(UGymGiveUpAction) == 0x000008, "Wrong alignment on UGymGiveUpAction");
static_assert(sizeof(UGymGiveUpAction) == 0x0000B8, "Wrong size on UGymGiveUpAction");

// Class GYMGAME.GymAimIKAnimator
// 0x0000 (0x00A8 - 0x00A8)
class UGymAimIKAnimator final : public UGymMetaAnimator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymAimIKAnimator">();
	}
	static class UGymAimIKAnimator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymAimIKAnimator>();
	}
};
static_assert(alignof(UGymAimIKAnimator) == 0x000008, "Wrong alignment on UGymAimIKAnimator");
static_assert(sizeof(UGymAimIKAnimator) == 0x0000A8, "Wrong size on UGymAimIKAnimator");

// Class GYMGAME.GymAIRunData
// 0x0040 (0x0070 - 0x0030)
class UGymAIRunData final : public UPrimaryDataAsset
{
public:
	class FString                                 MapName;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocationID;                                        // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Difficulty;                                        // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RunFileName;                                       // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FinishTime;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFinished;                                         // 0x005C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CompletionPercent;                                 // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastReachedTime;                                   // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEliminationReason                            EliminationReason;                                 // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymAIRunData">();
	}
	static class UGymAIRunData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymAIRunData>();
	}
};
static_assert(alignof(UGymAIRunData) == 0x000008, "Wrong alignment on UGymAIRunData");
static_assert(sizeof(UGymAIRunData) == 0x000070, "Wrong size on UGymAIRunData");
static_assert(offsetof(UGymAIRunData, MapName) == 0x000030, "Member 'UGymAIRunData::MapName' has a wrong offset!");
static_assert(offsetof(UGymAIRunData, LocationID) == 0x000040, "Member 'UGymAIRunData::LocationID' has a wrong offset!");
static_assert(offsetof(UGymAIRunData, Difficulty) == 0x000044, "Member 'UGymAIRunData::Difficulty' has a wrong offset!");
static_assert(offsetof(UGymAIRunData, RunFileName) == 0x000048, "Member 'UGymAIRunData::RunFileName' has a wrong offset!");
static_assert(offsetof(UGymAIRunData, FinishTime) == 0x000058, "Member 'UGymAIRunData::FinishTime' has a wrong offset!");
static_assert(offsetof(UGymAIRunData, bFinished) == 0x00005C, "Member 'UGymAIRunData::bFinished' has a wrong offset!");
static_assert(offsetof(UGymAIRunData, CompletionPercent) == 0x000060, "Member 'UGymAIRunData::CompletionPercent' has a wrong offset!");
static_assert(offsetof(UGymAIRunData, LastReachedTime) == 0x000064, "Member 'UGymAIRunData::LastReachedTime' has a wrong offset!");
static_assert(offsetof(UGymAIRunData, EliminationReason) == 0x000068, "Member 'UGymAIRunData::EliminationReason' has a wrong offset!");

// Class GYMGAME.GymCharacterMetaControl
// 0x0018 (0x00B8 - 0x00A0)
class UGymCharacterMetaControl : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymCharacter*                          Master;                                            // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GymCharacterMetaControl">();
	}
	static class UGymCharacterMetaControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymCharacterMetaControl>();
	}
};
static_assert(alignof(UGymCharacterMetaControl) == 0x000008, "Wrong alignment on UGymCharacterMetaControl");
static_assert(sizeof(UGymCharacterMetaControl) == 0x0000B8, "Wrong size on UGymCharacterMetaControl");
static_assert(offsetof(UGymCharacterMetaControl, Master) == 0x0000A8, "Member 'UGymCharacterMetaControl::Master' has a wrong offset!");

// Class GYMGAME.GymAnimationControl
// 0x0480 (0x0538 - 0x00B8)
class UGymAnimationControl final : public UGymCharacterMetaControl
{
public:
	uint8                                         Pad_B8[0x30];                                      // 0x00B8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     OverlayMaterial;                                   // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGymPivot*                              HandsPivot;                                        // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandsPivotBaseRelativeLocation;                    // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 BaseSkeletalMesh;                                  // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 TPAnimRoot;                                        // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 FPAnimRoot;                                        // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandsBaseRelativeScale;                            // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterPartMeshGroupBindingPtr      FPCHands;                                          // 0x0140(0x0078)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FCharacterPartMeshGroupBindingPtr      FPCHandsKinematic;                                 // 0x01B8(0x0078)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FCharacterPartMeshGroupBindingPtr      FPCBody;                                           // 0x0230(0x0078)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FCharacterPartMeshGroupBindingPtr      FPCLegs;                                           // 0x02A8(0x0078)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FCharacterPartMeshGroupBindingPtr      TPCBase;                                           // 0x0320(0x0078)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     CachedHoodMaterialInstance;                        // 0x0398(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMeshComponent*>         FpcParts;                                          // 0x03A0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UNiagaraComponent*>              FPCEffects;                                        // 0x03B0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FGymCustomizationMesh>          CustomizationMeshes;                               // 0x03C0(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class USkeletalMeshComponent*>         TpcParts;                                          // 0x03D0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UNiagaraComponent*>              TPCEffects;                                        // 0x03E0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F0[0x30];                                     // 0x03F0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymUtilityAnimator*                    UtilAnimator;                                      // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymSwimmingAnimator*                   SwimmingAnimator;                                  // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymBasicAnimator*                      BasicAnimator;                                     // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymFootIKAnimator*                     FootIKAnimator;                                    // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymAimIKAnimator*                      AimIKAnimator;                                     // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymHandsIKAnimator*                    HandsIKAnimator;                                   // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymRollingAnimator*                    RollingAnimator;                                   // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymSlidingAnimator*                    SlidingAnimator;                                   // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymVaultingEngineAnimator*             VaultingEngineAnimator;                            // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymWallScrambleAnimator*               WallScrambleWAnimator;                             // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymSidewaysWRAnimator*                 SidewaysWRAnimator;                                // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymGrindingAnimator*                   GrindingAnimator;                                  // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymWireWalkingAnimator*                WireWalkingAnimator;                               // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymZiplineAnimator*                    ZiplineAnimator;                                   // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymIdleAnimator*                       IdleAnimator;                                      // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGymTauntAnimator*                      TauntAnimator;                                     // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
