#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymGuiCursorWidgetBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C
// 0x00A8 (0x03F8 - 0x0350)
class UGymGuiCursorWidgetBP_C final : public UGymGuiCursorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FloatNotification;                                 // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SupermoveUsed;                                     // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInputActionUI_C*                       BackFlipInputActionUI;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CursorDot;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           EditorIconContainer;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       FrontFlipInputActionUI;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGymGui_FloatingNotification_C*         GymGui_FloatingNotification;                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       JumpInputActionUI;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       JumpInputActionUI_1;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SandboxIconsContainer;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StartIconContainer;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       StartRaceInputActionUI;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       StartRaceInputActionUI_1;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SupermovesIconsPanel;                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularBar_C*                         SuperMoveStaminaMeter;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AbilityIcon_C*                     WBP_AbilityIcon_Forward;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AbilityIcon_C*                     WBP_AbilityIcon_Up;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGymCharacter*                          Character;                                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LastTickOpen;                                      // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           UpdateTimer;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnSupermoveReadyChanged(const int32& IsReady);
	void Construct();
	ESlateVisibility CrosshairVisible();
	ESlateVisibility EditorIconVisible();
	void ExecuteUbergraph_GymGuiCursorWidgetBP(int32 EntryPoint);
	ESlateVisibility StartIconVisible();
	ESlateVisibility SupermoveIconVisible();
	ESlateVisibility SupermoveMeterVisible();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateSupermoveStamina(float Stamina);
	void UpdateWidgetStates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GymGuiCursorWidgetBP_C">();
	}
	static class UGymGuiCursorWidgetBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGuiCursorWidgetBP_C>();
	}
};
static_assert(alignof(UGymGuiCursorWidgetBP_C) == 0x000008, "Wrong alignment on UGymGuiCursorWidgetBP_C");
static_assert(sizeof(UGymGuiCursorWidgetBP_C) == 0x0003F8, "Wrong size on UGymGuiCursorWidgetBP_C");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, UberGraphFrame) == 0x000350, "Member 'UGymGuiCursorWidgetBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, FloatNotification) == 0x000358, "Member 'UGymGuiCursorWidgetBP_C::FloatNotification' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, SupermoveUsed) == 0x000360, "Member 'UGymGuiCursorWidgetBP_C::SupermoveUsed' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, BackFlipInputActionUI) == 0x000368, "Member 'UGymGuiCursorWidgetBP_C::BackFlipInputActionUI' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, CursorDot) == 0x000370, "Member 'UGymGuiCursorWidgetBP_C::CursorDot' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, EditorIconContainer) == 0x000378, "Member 'UGymGuiCursorWidgetBP_C::EditorIconContainer' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, FrontFlipInputActionUI) == 0x000380, "Member 'UGymGuiCursorWidgetBP_C::FrontFlipInputActionUI' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, GymGui_FloatingNotification) == 0x000388, "Member 'UGymGuiCursorWidgetBP_C::GymGui_FloatingNotification' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, JumpInputActionUI) == 0x000390, "Member 'UGymGuiCursorWidgetBP_C::JumpInputActionUI' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, JumpInputActionUI_1) == 0x000398, "Member 'UGymGuiCursorWidgetBP_C::JumpInputActionUI_1' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, SandboxIconsContainer) == 0x0003A0, "Member 'UGymGuiCursorWidgetBP_C::SandboxIconsContainer' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, StartIconContainer) == 0x0003A8, "Member 'UGymGuiCursorWidgetBP_C::StartIconContainer' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, StartRaceInputActionUI) == 0x0003B0, "Member 'UGymGuiCursorWidgetBP_C::StartRaceInputActionUI' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, StartRaceInputActionUI_1) == 0x0003B8, "Member 'UGymGuiCursorWidgetBP_C::StartRaceInputActionUI_1' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, SupermovesIconsPanel) == 0x0003C0, "Member 'UGymGuiCursorWidgetBP_C::SupermovesIconsPanel' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, SuperMoveStaminaMeter) == 0x0003C8, "Member 'UGymGuiCursorWidgetBP_C::SuperMoveStaminaMeter' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, WBP_AbilityIcon_Forward) == 0x0003D0, "Member 'UGymGuiCursorWidgetBP_C::WBP_AbilityIcon_Forward' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, WBP_AbilityIcon_Up) == 0x0003D8, "Member 'UGymGuiCursorWidgetBP_C::WBP_AbilityIcon_Up' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, Character) == 0x0003E0, "Member 'UGymGuiCursorWidgetBP_C::Character' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, LastTickOpen) == 0x0003E8, "Member 'UGymGuiCursorWidgetBP_C::LastTickOpen' has a wrong offset!");
static_assert(offsetof(UGymGuiCursorWidgetBP_C, UpdateTimer) == 0x0003F0, "Member 'UGymGuiCursorWidgetBP_C::UpdateTimer' has a wrong offset!");

}

