#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymGuiCursorWidgetBP

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.BPOnSupermoveReadyChanged
// 0x0004 (0x0004 - 0x0000)
struct GymGuiCursorWidgetBP_C_BPOnSupermoveReadyChanged final
{
public:
	int32                                         IsReady;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_BPOnSupermoveReadyChanged) == 0x000004, "Wrong alignment on GymGuiCursorWidgetBP_C_BPOnSupermoveReadyChanged");
static_assert(sizeof(GymGuiCursorWidgetBP_C_BPOnSupermoveReadyChanged) == 0x000004, "Wrong size on GymGuiCursorWidgetBP_C_BPOnSupermoveReadyChanged");
static_assert(offsetof(GymGuiCursorWidgetBP_C_BPOnSupermoveReadyChanged, IsReady) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_BPOnSupermoveReadyChanged::IsReady' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.CrosshairVisible
// 0x0006 (0x0006 - 0x0000)
struct GymGuiCursorWidgetBP_C_CrosshairVisible final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowCrosshair_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_CrosshairVisible) == 0x000001, "Wrong alignment on GymGuiCursorWidgetBP_C_CrosshairVisible");
static_assert(sizeof(GymGuiCursorWidgetBP_C_CrosshairVisible) == 0x000006, "Wrong size on GymGuiCursorWidgetBP_C_CrosshairVisible");
static_assert(offsetof(GymGuiCursorWidgetBP_C_CrosshairVisible, ReturnValue) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_CrosshairVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_CrosshairVisible, Temp_bool_Variable) == 0x000001, "Member 'GymGuiCursorWidgetBP_C_CrosshairVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_CrosshairVisible, Temp_byte_Variable) == 0x000002, "Member 'GymGuiCursorWidgetBP_C_CrosshairVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_CrosshairVisible, Temp_byte_Variable_1) == 0x000003, "Member 'GymGuiCursorWidgetBP_C_CrosshairVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_CrosshairVisible, CallFunc_GetShowCrosshair_ReturnValue) == 0x000004, "Member 'GymGuiCursorWidgetBP_C_CrosshairVisible::CallFunc_GetShowCrosshair_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_CrosshairVisible, K2Node_Select_Default) == 0x000005, "Member 'GymGuiCursorWidgetBP_C_CrosshairVisible::K2Node_Select_Default' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.EditorIconVisible
// 0x0018 (0x0018 - 0x0000)
struct GymGuiCursorWidgetBP_C_EditorIconVisible final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EditorIsOpen_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymEditorControl*                      CallFunc_GetEditorControl_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEditingAllowed_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_EditorIconVisible) == 0x000008, "Wrong alignment on GymGuiCursorWidgetBP_C_EditorIconVisible");
static_assert(sizeof(GymGuiCursorWidgetBP_C_EditorIconVisible) == 0x000018, "Wrong size on GymGuiCursorWidgetBP_C_EditorIconVisible");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, ReturnValue) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, Temp_bool_Variable) == 0x000001, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, Temp_byte_Variable) == 0x000002, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, Temp_byte_Variable_1) == 0x000003, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, CallFunc_EditorIsOpen_ReturnValue) == 0x000004, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::CallFunc_EditorIsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, CallFunc_GetEditorControl_ReturnValue) == 0x000008, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::CallFunc_GetEditorControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, CallFunc_GetEditingAllowed_ReturnValue) == 0x000010, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::CallFunc_GetEditingAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_EditorIconVisible, K2Node_Select_Default) == 0x000013, "Member 'GymGuiCursorWidgetBP_C_EditorIconVisible::K2Node_Select_Default' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.ExecuteUbergraph_GymGuiCursorWidgetBP
// 0x00B8 (0x00B8 - 0x0000)
struct GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_IsReady;                              // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymCharacter*                          K2Node_DynamicCast_AsGym_Character;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EditorIsOpen_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Stamina;                              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetPercent_NewParam_ImplicitCast;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP) == 0x000008, "Wrong alignment on GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP");
static_assert(sizeof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP) == 0x0000B8, "Wrong size on GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, EntryPoint) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, Temp_bool_Variable) == 0x000004, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, Temp_byte_Variable) == 0x000005, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, Temp_byte_Variable_1) == 0x000006, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, K2Node_Event_MyGeometry) == 0x000008, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, K2Node_Event_InDeltaTime) == 0x000040, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, K2Node_Event_IsReady) == 0x000044, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::K2Node_Event_IsReady' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_Conv_IntToBool_ReturnValue) == 0x000048, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, K2Node_Select_Default) == 0x000049, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_PlayAnimation_ReturnValue_3) == 0x000068, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_PlayAnimation_ReturnValue_4) == 0x000070, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000078, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, K2Node_DynamicCast_AsGym_Character) == 0x000090, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::K2Node_DynamicCast_AsGym_Character' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A0, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_EditorIsOpen_ReturnValue) == 0x0000A8, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_EditorIsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000A9, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_Not_PreBool_ReturnValue) == 0x0000AA, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, K2Node_Event_Stamina) == 0x0000AC, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::K2Node_Event_Stamina' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP, CallFunc_SetPercent_NewParam_ImplicitCast) == 0x0000B0, "Member 'GymGuiCursorWidgetBP_C_ExecuteUbergraph_GymGuiCursorWidgetBP::CallFunc_SetPercent_NewParam_ImplicitCast' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.StartIconVisible
// 0x0018 (0x0018 - 0x0000)
struct GymGuiCursorWidgetBP_C_StartIconVisible final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EditorIsOpen_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymRuleControl*                        CallFunc_GetRuleControl_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartVote_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_StartIconVisible) == 0x000008, "Wrong alignment on GymGuiCursorWidgetBP_C_StartIconVisible");
static_assert(sizeof(GymGuiCursorWidgetBP_C_StartIconVisible) == 0x000018, "Wrong size on GymGuiCursorWidgetBP_C_StartIconVisible");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, ReturnValue) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, Temp_bool_Variable) == 0x000001, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, Temp_byte_Variable) == 0x000002, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, Temp_byte_Variable_1) == 0x000003, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, CallFunc_EditorIsOpen_ReturnValue) == 0x000004, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::CallFunc_EditorIsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, CallFunc_GetRuleControl_ReturnValue) == 0x000008, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::CallFunc_GetRuleControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, CallFunc_CanStartVote_ReturnValue) == 0x000010, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::CallFunc_CanStartVote_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_StartIconVisible, K2Node_Select_Default) == 0x000013, "Member 'GymGuiCursorWidgetBP_C_StartIconVisible::K2Node_Select_Default' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.SupermoveIconVisible
// 0x0009 (0x0009 - 0x0000)
struct GymGuiCursorWidgetBP_C_SupermoveIconVisible final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowSupermoveIcons_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EditorIsOpen_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_SupermoveIconVisible) == 0x000001, "Wrong alignment on GymGuiCursorWidgetBP_C_SupermoveIconVisible");
static_assert(sizeof(GymGuiCursorWidgetBP_C_SupermoveIconVisible) == 0x000009, "Wrong size on GymGuiCursorWidgetBP_C_SupermoveIconVisible");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, ReturnValue) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, Temp_bool_Variable) == 0x000001, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, Temp_byte_Variable) == 0x000002, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, Temp_byte_Variable_1) == 0x000003, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, CallFunc_GetShowSupermoveIcons_ReturnValue) == 0x000004, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::CallFunc_GetShowSupermoveIcons_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, CallFunc_EditorIsOpen_ReturnValue) == 0x000005, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::CallFunc_EditorIsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveIconVisible, K2Node_Select_Default) == 0x000008, "Member 'GymGuiCursorWidgetBP_C_SupermoveIconVisible::K2Node_Select_Default' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.SupermoveMeterVisible
// 0x0006 (0x0006 - 0x0000)
struct GymGuiCursorWidgetBP_C_SupermoveMeterVisible final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowSupermoveMeter_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_SupermoveMeterVisible) == 0x000001, "Wrong alignment on GymGuiCursorWidgetBP_C_SupermoveMeterVisible");
static_assert(sizeof(GymGuiCursorWidgetBP_C_SupermoveMeterVisible) == 0x000006, "Wrong size on GymGuiCursorWidgetBP_C_SupermoveMeterVisible");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveMeterVisible, ReturnValue) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_SupermoveMeterVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveMeterVisible, Temp_bool_Variable) == 0x000001, "Member 'GymGuiCursorWidgetBP_C_SupermoveMeterVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveMeterVisible, Temp_byte_Variable) == 0x000002, "Member 'GymGuiCursorWidgetBP_C_SupermoveMeterVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveMeterVisible, Temp_byte_Variable_1) == 0x000003, "Member 'GymGuiCursorWidgetBP_C_SupermoveMeterVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveMeterVisible, CallFunc_GetShowSupermoveMeter_ReturnValue) == 0x000004, "Member 'GymGuiCursorWidgetBP_C_SupermoveMeterVisible::CallFunc_GetShowSupermoveMeter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_SupermoveMeterVisible, K2Node_Select_Default) == 0x000005, "Member 'GymGuiCursorWidgetBP_C_SupermoveMeterVisible::K2Node_Select_Default' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.Tick
// 0x003C (0x003C - 0x0000)
struct GymGuiCursorWidgetBP_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_Tick) == 0x000004, "Wrong alignment on GymGuiCursorWidgetBP_C_Tick");
static_assert(sizeof(GymGuiCursorWidgetBP_C_Tick) == 0x00003C, "Wrong size on GymGuiCursorWidgetBP_C_Tick");
static_assert(offsetof(GymGuiCursorWidgetBP_C_Tick, MyGeometry) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_Tick, InDeltaTime) == 0x000038, "Member 'GymGuiCursorWidgetBP_C_Tick::InDeltaTime' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.UpdateSupermoveStamina
// 0x0004 (0x0004 - 0x0000)
struct GymGuiCursorWidgetBP_C_UpdateSupermoveStamina final
{
public:
	float                                         Stamina;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_UpdateSupermoveStamina) == 0x000004, "Wrong alignment on GymGuiCursorWidgetBP_C_UpdateSupermoveStamina");
static_assert(sizeof(GymGuiCursorWidgetBP_C_UpdateSupermoveStamina) == 0x000004, "Wrong size on GymGuiCursorWidgetBP_C_UpdateSupermoveStamina");
static_assert(offsetof(GymGuiCursorWidgetBP_C_UpdateSupermoveStamina, Stamina) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_UpdateSupermoveStamina::Stamina' has a wrong offset!");

// Function GymGuiCursorWidgetBP.GymGuiCursorWidgetBP_C.UpdateWidgetStates
// 0x0005 (0x0005 - 0x0000)
struct GymGuiCursorWidgetBP_C_UpdateWidgetStates final
{
public:
	ESlateVisibility                              CallFunc_CrosshairVisible_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_SupermoveMeterVisible_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_SupermoveIconVisible_ReturnValue;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_EditorIconVisible_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_StartIconVisible_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiCursorWidgetBP_C_UpdateWidgetStates) == 0x000001, "Wrong alignment on GymGuiCursorWidgetBP_C_UpdateWidgetStates");
static_assert(sizeof(GymGuiCursorWidgetBP_C_UpdateWidgetStates) == 0x000005, "Wrong size on GymGuiCursorWidgetBP_C_UpdateWidgetStates");
static_assert(offsetof(GymGuiCursorWidgetBP_C_UpdateWidgetStates, CallFunc_CrosshairVisible_ReturnValue) == 0x000000, "Member 'GymGuiCursorWidgetBP_C_UpdateWidgetStates::CallFunc_CrosshairVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGuiCursorWidgetBP_C_UpdateWidgetStates, CallFunc_SupermoveMeterVisible_ReturnValue) == 0x000001, "Member 'GymGuiCursorWidgetBP_C_UpdateWidgetStates::CallFunc_SupermoveMeterVisible_ReturnValue' has a wrong offset!");
