#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymGuiPostflow_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function GymGuiPostflow_BP.GymGuiPostflow_BP_C.ShowBadText
// 0x0038 (0x0038 - 0x0000)
struct GymGuiPostflow_BP_C_ShowBadText final
{
public:
	class FText                                   Main_Text;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Flavor_Text;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiPostflow_BP_C_ShowBadText) == 0x000008, "Wrong alignment on GymGuiPostflow_BP_C_ShowBadText");
static_assert(sizeof(GymGuiPostflow_BP_C_ShowBadText) == 0x000038, "Wrong size on GymGuiPostflow_BP_C_ShowBadText");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowBadText, Main_Text) == 0x000000, "Member 'GymGuiPostflow_BP_C_ShowBadText::Main_Text' has a wrong offset!");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowBadText, Flavor_Text) == 0x000018, "Member 'GymGuiPostflow_BP_C_ShowBadText::Flavor_Text' has a wrong offset!");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowBadText, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'GymGuiPostflow_BP_C_ShowBadText::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function GymGuiPostflow_BP.GymGuiPostflow_BP_C.ShowGoodText
// 0x0038 (0x0038 - 0x0000)
struct GymGuiPostflow_BP_C_ShowGoodText final
{
public:
	class FText                                   Main_Text;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Flavor_Text;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiPostflow_BP_C_ShowGoodText) == 0x000008, "Wrong alignment on GymGuiPostflow_BP_C_ShowGoodText");
static_assert(sizeof(GymGuiPostflow_BP_C_ShowGoodText) == 0x000038, "Wrong size on GymGuiPostflow_BP_C_ShowGoodText");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowGoodText, Main_Text) == 0x000000, "Member 'GymGuiPostflow_BP_C_ShowGoodText::Main_Text' has a wrong offset!");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowGoodText, Flavor_Text) == 0x000018, "Member 'GymGuiPostflow_BP_C_ShowGoodText::Flavor_Text' has a wrong offset!");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowGoodText, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'GymGuiPostflow_BP_C_ShowGoodText::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function GymGuiPostflow_BP.GymGuiPostflow_BP_C.ShowText
// 0x0038 (0x0038 - 0x0000)
struct GymGuiPostflow_BP_C_ShowText final
{
public:
	class FText                                   Main_Text;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Flavor_Text;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          GoodText;                                          // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGuiPostflow_BP_C_ShowText) == 0x000008, "Wrong alignment on GymGuiPostflow_BP_C_ShowText");
static_assert(sizeof(GymGuiPostflow_BP_C_ShowText) == 0x000038, "Wrong size on GymGuiPostflow_BP_C_ShowText");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowText, Main_Text) == 0x000000, "Member 'GymGuiPostflow_BP_C_ShowText::Main_Text' has a wrong offset!");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowText, Flavor_Text) == 0x000018, "Member 'GymGuiPostflow_BP_C_ShowText::Flavor_Text' has a wrong offset!");
static_assert(offsetof(GymGuiPostflow_BP_C_ShowText, GoodText) == 0x000030, "Member 'GymGuiPostflow_BP_C_ShowText::GoodText' has a wrong offset!");

}

