#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymGameTickerMessageWidget_BP

#include "Basic.hpp"

#include "TickerIconData_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GymGameTickerMessageWidget_BP.GymGameTickerMessageWidget_BP_C.ExecuteUbergraph_GymGameTickerMessageWidget_BP
// 0x0038 (0x0038 - 0x0000)
struct GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETickerPosition                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETickerPosition                               Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_3;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP) == 0x000008, "Wrong alignment on GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP");
static_assert(sizeof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP) == 0x000038, "Wrong size on GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, EntryPoint) == 0x000000, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, Temp_byte_Variable) == 0x000004, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000008, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, Temp_byte_Variable_1) == 0x000010, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, Temp_byte_Variable_2) == 0x000011, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, Temp_byte_Variable_3) == 0x000012, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, K2Node_Select_Default) == 0x000018, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP, K2Node_Select_Default_1) == 0x000030, "Member 'GymGameTickerMessageWidget_BP_C_ExecuteUbergraph_GymGameTickerMessageWidget_BP::K2Node_Select_Default_1' has a wrong offset!");

// Function GymGameTickerMessageWidget_BP.GymGameTickerMessageWidget_BP_C.GetTexture
// 0x0030 (0x0030 - 0x0000)
struct GymGameTickerMessageWidget_BP_C_GetTexture final
{
public:
	class FString                                 IconTextureId;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTickerIconData                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymGameTickerMessageWidget_BP_C_GetTexture) == 0x000008, "Wrong alignment on GymGameTickerMessageWidget_BP_C_GetTexture");
static_assert(sizeof(GymGameTickerMessageWidget_BP_C_GetTexture) == 0x000030, "Wrong size on GymGameTickerMessageWidget_BP_C_GetTexture");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_GetTexture, IconTextureId) == 0x000000, "Member 'GymGameTickerMessageWidget_BP_C_GetTexture::IconTextureId' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_GetTexture, ReturnValue) == 0x000010, "Member 'GymGameTickerMessageWidget_BP_C_GetTexture::ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_GetTexture, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'GymGameTickerMessageWidget_BP_C_GetTexture::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_GetTexture, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'GymGameTickerMessageWidget_BP_C_GetTexture::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GymGameTickerMessageWidget_BP_C_GetTexture, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000028, "Member 'GymGameTickerMessageWidget_BP_C_GetTexture::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

