#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymGui_FloatingNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GymGui_FloatingNotification.GymGui_FloatingNotification_C
// 0x0048 (0x0308 - 0x02C0)
class UGymGui_FloatingNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       SecondaryFloat;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TitleFloat;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title_Text;                                        // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Secondary_Text;                                    // 0x02F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_GymGui_FloatingNotification(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GymGui_FloatingNotification_C">();
	}
	static class UGymGui_FloatingNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGymGui_FloatingNotification_C>();
	}
};
static_assert(alignof(UGymGui_FloatingNotification_C) == 0x000008, "Wrong alignment on UGymGui_FloatingNotification_C");
static_assert(sizeof(UGymGui_FloatingNotification_C) == 0x000308, "Wrong size on UGymGui_FloatingNotification_C");
static_assert(offsetof(UGymGui_FloatingNotification_C, UberGraphFrame) == 0x0002C0, "Member 'UGymGui_FloatingNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGymGui_FloatingNotification_C, SecondaryFloat) == 0x0002C8, "Member 'UGymGui_FloatingNotification_C::SecondaryFloat' has a wrong offset!");
static_assert(offsetof(UGymGui_FloatingNotification_C, TitleFloat) == 0x0002D0, "Member 'UGymGui_FloatingNotification_C::TitleFloat' has a wrong offset!");
static_assert(offsetof(UGymGui_FloatingNotification_C, Title_Text) == 0x0002D8, "Member 'UGymGui_FloatingNotification_C::Title_Text' has a wrong offset!");
static_assert(offsetof(UGymGui_FloatingNotification_C, Secondary_Text) == 0x0002F0, "Member 'UGymGui_FloatingNotification_C::Secondary_Text' has a wrong offset!");

}

