#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GymPlayerControllerWithChat

#include "Basic.hpp"


namespace SDK::Params
{

// Function GymPlayerControllerWithChat.GymPlayerControllerWithChat_C.ExecuteUbergraph_GymPlayerControllerWithChat
// 0x0090 (0x0090 - 0x0000)
struct GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GymGameInstance_C*                  K2Node_DynamicCast_AsBP_Gym_Game_Instance;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USoundWave*                       K2Node_CustomEvent_PlayingSoundWave;               // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlaybackPercent;                // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GymGameInstance_C*                  K2Node_DynamicCast_AsBP_Gym_Game_Instance_1;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Play_StartTime_ImplicitCast;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSound2D_StartTime_ImplicitCast;      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat) == 0x000008, "Wrong alignment on GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat");
static_assert(sizeof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat) == 0x000090, "Wrong size on GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, EntryPoint) == 0x000000, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::EntryPoint' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, K2Node_DynamicCast_AsBP_Gym_Game_Instance) == 0x000028, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::K2Node_DynamicCast_AsBP_Gym_Game_Instance' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, K2Node_CustomEvent_PlayingSoundWave) == 0x000038, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::K2Node_CustomEvent_PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, K2Node_CustomEvent_PlaybackPercent) == 0x000040, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::K2Node_CustomEvent_PlaybackPercent' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_SpawnSound2D_ReturnValue) == 0x000048, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_GetGameInstance_ReturnValue_1) == 0x000058, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, K2Node_DynamicCast_AsBP_Gym_Game_Instance_1) == 0x000060, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::K2Node_DynamicCast_AsBP_Gym_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000070, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x000078, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_Play_StartTime_ImplicitCast) == 0x00007C, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_Play_StartTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_SpawnSound2D_StartTime_ImplicitCast) == 0x000080, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_SpawnSound2D_StartTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'GymPlayerControllerWithChat_C_ExecuteUbergraph_GymPlayerControllerWithChat::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GymPlayerControllerWithChat.GymPlayerControllerWithChat_C.GetPlayerName
// 0x0020 (0x0020 - 0x0000)
struct GymPlayerControllerWithChat_C_GetPlayerName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GymPlayerControllerWithChat_C_GetPlayerName) == 0x000008, "Wrong alignment on GymPlayerControllerWithChat_C_GetPlayerName");
static_assert(sizeof(GymPlayerControllerWithChat_C_GetPlayerName) == 0x000020, "Wrong size on GymPlayerControllerWithChat_C_GetPlayerName");
static_assert(offsetof(GymPlayerControllerWithChat_C_GetPlayerName, Name_0) == 0x000000, "Member 'GymPlayerControllerWithChat_C_GetPlayerName::Name_0' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_GetPlayerName, CallFunc_GetPlayerName_ReturnValue) == 0x000010, "Member 'GymPlayerControllerWithChat_C_GetPlayerName::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");

// Function GymPlayerControllerWithChat.GymPlayerControllerWithChat_C.GetPlayerTeam
// 0x0010 (0x0010 - 0x0000)
struct GymPlayerControllerWithChat_C_GetPlayerTeam final
{
public:
	class FString                                 Team;                                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GymPlayerControllerWithChat_C_GetPlayerTeam) == 0x000008, "Wrong alignment on GymPlayerControllerWithChat_C_GetPlayerTeam");
static_assert(sizeof(GymPlayerControllerWithChat_C_GetPlayerTeam) == 0x000010, "Wrong size on GymPlayerControllerWithChat_C_GetPlayerTeam");
static_assert(offsetof(GymPlayerControllerWithChat_C_GetPlayerTeam, Team) == 0x000000, "Member 'GymPlayerControllerWithChat_C_GetPlayerTeam::Team' has a wrong offset!");

// Function GymPlayerControllerWithChat.GymPlayerControllerWithChat_C.OnPlaybackpercent
// 0x0010 (0x0010 - 0x0000)
struct GymPlayerControllerWithChat_C_OnPlaybackpercent final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackPercent;                                   // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymPlayerControllerWithChat_C_OnPlaybackpercent) == 0x000008, "Wrong alignment on GymPlayerControllerWithChat_C_OnPlaybackpercent");
static_assert(sizeof(GymPlayerControllerWithChat_C_OnPlaybackpercent) == 0x000010, "Wrong size on GymPlayerControllerWithChat_C_OnPlaybackpercent");
static_assert(offsetof(GymPlayerControllerWithChat_C_OnPlaybackpercent, PlayingSoundWave) == 0x000000, "Member 'GymPlayerControllerWithChat_C_OnPlaybackpercent::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(GymPlayerControllerWithChat_C_OnPlaybackpercent, PlaybackPercent) == 0x000008, "Member 'GymPlayerControllerWithChat_C_OnPlaybackpercent::PlaybackPercent' has a wrong offset!");

// Function GymPlayerControllerWithChat.GymPlayerControllerWithChat_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GymPlayerControllerWithChat_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GymPlayerControllerWithChat_C_ReceiveTick) == 0x000004, "Wrong alignment on GymPlayerControllerWithChat_C_ReceiveTick");
static_assert(sizeof(GymPlayerControllerWithChat_C_ReceiveTick) == 0x000004, "Wrong size on GymPlayerControllerWithChat_C_ReceiveTick");
static_assert(offsetof(GymPlayerControllerWithChat_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GymPlayerControllerWithChat_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

