#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Header_Style1Minusnocaps_H2

#include "Basic.hpp"


namespace SDK::Params
{

// Function Header_Style1-nocaps_H2.Header_Style1-nocaps_H2_C.ExecuteUbergraph_Header_Style1-nocaps_H2
// 0x0040 (0x0040 - 0x0000)
struct Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FText                                   K2Node_CustomEvent_Value;                          // 0x0020(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2) == 0x000008, "Wrong alignment on Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2");
static_assert(sizeof(Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2) == 0x000040, "Wrong size on Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2");
static_assert(offsetof(Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2, EntryPoint) == 0x000000, "Member 'Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2, K2Node_CustomEvent_Value) == 0x000020, "Member 'Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2, K2Node_Event_IsDesignTime) == 0x000038, "Member 'Header_Style1Minusnocaps_H2_C_ExecuteUbergraph_Header_Style1Minusnocaps_H2::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function Header_Style1-nocaps_H2.Header_Style1-nocaps_H2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Header_Style1Minusnocaps_H2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Header_Style1Minusnocaps_H2_C_PreConstruct) == 0x000001, "Wrong alignment on Header_Style1Minusnocaps_H2_C_PreConstruct");
static_assert(sizeof(Header_Style1Minusnocaps_H2_C_PreConstruct) == 0x000001, "Wrong size on Header_Style1Minusnocaps_H2_C_PreConstruct");
static_assert(offsetof(Header_Style1Minusnocaps_H2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Header_Style1Minusnocaps_H2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Header_Style1-nocaps_H2.Header_Style1-nocaps_H2_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct Header_Style1Minusnocaps_H2_C_SetText final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Header_Style1Minusnocaps_H2_C_SetText) == 0x000008, "Wrong alignment on Header_Style1Minusnocaps_H2_C_SetText");
static_assert(sizeof(Header_Style1Minusnocaps_H2_C_SetText) == 0x000018, "Wrong size on Header_Style1Minusnocaps_H2_C_SetText");
static_assert(offsetof(Header_Style1Minusnocaps_H2_C_SetText, Value) == 0x000000, "Member 'Header_Style1Minusnocaps_H2_C_SetText::Value' has a wrong offset!");

}

