#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Header_Style1_H2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Header_Style1_H2.Header_Style1_H2_C
// 0x0030 (0x02F0 - 0x02C0)
class UHeader_Style1_H2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       HeaderCommonText;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderCommonTextShadow;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ContentText;                                       // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_Header_Style1_H2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Header_Style1_H2_C">();
	}
	static class UHeader_Style1_H2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeader_Style1_H2_C>();
	}
};
static_assert(alignof(UHeader_Style1_H2_C) == 0x000008, "Wrong alignment on UHeader_Style1_H2_C");
static_assert(sizeof(UHeader_Style1_H2_C) == 0x0002F0, "Wrong size on UHeader_Style1_H2_C");
static_assert(offsetof(UHeader_Style1_H2_C, UberGraphFrame) == 0x0002C0, "Member 'UHeader_Style1_H2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeader_Style1_H2_C, HeaderCommonText) == 0x0002C8, "Member 'UHeader_Style1_H2_C::HeaderCommonText' has a wrong offset!");
static_assert(offsetof(UHeader_Style1_H2_C, HeaderCommonTextShadow) == 0x0002D0, "Member 'UHeader_Style1_H2_C::HeaderCommonTextShadow' has a wrong offset!");
static_assert(offsetof(UHeader_Style1_H2_C, ContentText) == 0x0002D8, "Member 'UHeader_Style1_H2_C::ContentText' has a wrong offset!");

}

