#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputActionUI

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function InputActionUI.InputActionUI_C.ExecuteUbergraph_InputActionUI
// 0x0028 (0x0028 - 0x0000)
struct InputActionUI_C_ExecuteUbergraph_InputActionUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputActionUI_C_ExecuteUbergraph_InputActionUI) == 0x000008, "Wrong alignment on InputActionUI_C_ExecuteUbergraph_InputActionUI");
static_assert(sizeof(InputActionUI_C_ExecuteUbergraph_InputActionUI) == 0x000028, "Wrong size on InputActionUI_C_ExecuteUbergraph_InputActionUI");
static_assert(offsetof(InputActionUI_C_ExecuteUbergraph_InputActionUI, EntryPoint) == 0x000000, "Member 'InputActionUI_C_ExecuteUbergraph_InputActionUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_ExecuteUbergraph_InputActionUI, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'InputActionUI_C_ExecuteUbergraph_InputActionUI::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_ExecuteUbergraph_InputActionUI, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'InputActionUI_C_ExecuteUbergraph_InputActionUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_ExecuteUbergraph_InputActionUI, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'InputActionUI_C_ExecuteUbergraph_InputActionUI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_ExecuteUbergraph_InputActionUI, CallFunc_GetCurrentInputType_ReturnValue) == 0x000012, "Member 'InputActionUI_C_ExecuteUbergraph_InputActionUI::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_ExecuteUbergraph_InputActionUI, K2Node_CustomEvent_bNewInputType) == 0x000013, "Member 'InputActionUI_C_ExecuteUbergraph_InputActionUI::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_ExecuteUbergraph_InputActionUI, K2Node_Event_IsDesignTime) == 0x000014, "Member 'InputActionUI_C_ExecuteUbergraph_InputActionUI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_ExecuteUbergraph_InputActionUI, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'InputActionUI_C_ExecuteUbergraph_InputActionUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function InputActionUI.InputActionUI_C.GetHiddenMode
// 0x0005 (0x0005 - 0x0000)
struct InputActionUI_C_GetHiddenMode final
{
public:
	ESlateVisibility                              HiddenMode;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputActionUI_C_GetHiddenMode) == 0x000001, "Wrong alignment on InputActionUI_C_GetHiddenMode");
static_assert(sizeof(InputActionUI_C_GetHiddenMode) == 0x000005, "Wrong size on InputActionUI_C_GetHiddenMode");
static_assert(offsetof(InputActionUI_C_GetHiddenMode, HiddenMode) == 0x000000, "Member 'InputActionUI_C_GetHiddenMode::HiddenMode' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_GetHiddenMode, Temp_bool_Variable) == 0x000001, "Member 'InputActionUI_C_GetHiddenMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_GetHiddenMode, Temp_byte_Variable) == 0x000002, "Member 'InputActionUI_C_GetHiddenMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_GetHiddenMode, Temp_byte_Variable_1) == 0x000003, "Member 'InputActionUI_C_GetHiddenMode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_GetHiddenMode, K2Node_Select_Default) == 0x000004, "Member 'InputActionUI_C_GetHiddenMode::K2Node_Select_Default' has a wrong offset!");

// Function InputActionUI.InputActionUI_C.OnInputMethodChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct InputActionUI_C_OnInputMethodChanged_Event final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputActionUI_C_OnInputMethodChanged_Event) == 0x000001, "Wrong alignment on InputActionUI_C_OnInputMethodChanged_Event");
static_assert(sizeof(InputActionUI_C_OnInputMethodChanged_Event) == 0x000001, "Wrong size on InputActionUI_C_OnInputMethodChanged_Event");
static_assert(offsetof(InputActionUI_C_OnInputMethodChanged_Event, bNewInputType) == 0x000000, "Member 'InputActionUI_C_OnInputMethodChanged_Event::bNewInputType' has a wrong offset!");

// Function InputActionUI.InputActionUI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct InputActionUI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputActionUI_C_PreConstruct) == 0x000001, "Wrong alignment on InputActionUI_C_PreConstruct");
static_assert(sizeof(InputActionUI_C_PreConstruct) == 0x000001, "Wrong size on InputActionUI_C_PreConstruct");
static_assert(offsetof(InputActionUI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'InputActionUI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function InputActionUI.InputActionUI_C.UpdateButtonVisibility
// 0x000A (0x000A - 0x0000)
struct InputActionUI_C_UpdateButtonVisibility final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetHiddenMode_HiddenMode;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetHiddenMode_HiddenMode_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputActionUI_C_UpdateButtonVisibility) == 0x000001, "Wrong alignment on InputActionUI_C_UpdateButtonVisibility");
static_assert(sizeof(InputActionUI_C_UpdateButtonVisibility) == 0x00000A, "Wrong size on InputActionUI_C_UpdateButtonVisibility");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, InputType) == 0x000000, "Member 'InputActionUI_C_UpdateButtonVisibility::InputType' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'InputActionUI_C_UpdateButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'InputActionUI_C_UpdateButtonVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, Temp_byte_Variable) == 0x000003, "Member 'InputActionUI_C_UpdateButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, Temp_bool_Variable_1) == 0x000004, "Member 'InputActionUI_C_UpdateButtonVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, Temp_byte_Variable_1) == 0x000005, "Member 'InputActionUI_C_UpdateButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, CallFunc_GetHiddenMode_HiddenMode) == 0x000006, "Member 'InputActionUI_C_UpdateButtonVisibility::CallFunc_GetHiddenMode_HiddenMode' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, CallFunc_GetHiddenMode_HiddenMode_1) == 0x000007, "Member 'InputActionUI_C_UpdateButtonVisibility::CallFunc_GetHiddenMode_HiddenMode_1' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, K2Node_Select_Default) == 0x000008, "Member 'InputActionUI_C_UpdateButtonVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateButtonVisibility, K2Node_Select_Default_1) == 0x000009, "Member 'InputActionUI_C_UpdateButtonVisibility::K2Node_Select_Default_1' has a wrong offset!");

// Function InputActionUI.InputActionUI_C.UpdateVisibleButton
// 0x0018 (0x0018 - 0x0000)
struct InputActionUI_C_UpdateVisibleButton final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputActionUI_C_UpdateVisibleButton) == 0x000008, "Wrong alignment on InputActionUI_C_UpdateVisibleButton");
static_assert(sizeof(InputActionUI_C_UpdateVisibleButton) == 0x000018, "Wrong size on InputActionUI_C_UpdateVisibleButton");
static_assert(offsetof(InputActionUI_C_UpdateVisibleButton, InputType) == 0x000000, "Member 'InputActionUI_C_UpdateVisibleButton::InputType' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateVisibleButton, Temp_bool_Variable) == 0x000001, "Member 'InputActionUI_C_UpdateVisibleButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateVisibleButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'InputActionUI_C_UpdateVisibleButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateVisibleButton, Temp_bool_Variable_1) == 0x000003, "Member 'InputActionUI_C_UpdateVisibleButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateVisibleButton, K2Node_Select_Default) == 0x000008, "Member 'InputActionUI_C_UpdateVisibleButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(InputActionUI_C_UpdateVisibleButton, K2Node_Select_Default_1) == 0x000010, "Member 'InputActionUI_C_UpdateVisibleButton::K2Node_Select_Default_1' has a wrong offset!");

}

