#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputRowTwoSlots

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InputRowTwoSlots.InputRowTwoSlots_C
// 0x0050 (0x0310 - 0x02C0)
class UInputRowTwoSlots_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                AlternatingRowBorder;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content1;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content2;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Index_0;                                           // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinDesiredWidth;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InputRowTwoSlots(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputRowTwoSlots_C">();
	}
	static class UInputRowTwoSlots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputRowTwoSlots_C>();
	}
};
static_assert(alignof(UInputRowTwoSlots_C) == 0x000008, "Wrong alignment on UInputRowTwoSlots_C");
static_assert(sizeof(UInputRowTwoSlots_C) == 0x000310, "Wrong size on UInputRowTwoSlots_C");
static_assert(offsetof(UInputRowTwoSlots_C, UberGraphFrame) == 0x0002C0, "Member 'UInputRowTwoSlots_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInputRowTwoSlots_C, AlternatingRowBorder) == 0x0002C8, "Member 'UInputRowTwoSlots_C::AlternatingRowBorder' has a wrong offset!");
static_assert(offsetof(UInputRowTwoSlots_C, Content1) == 0x0002D0, "Member 'UInputRowTwoSlots_C::Content1' has a wrong offset!");
static_assert(offsetof(UInputRowTwoSlots_C, Content2) == 0x0002D8, "Member 'UInputRowTwoSlots_C::Content2' has a wrong offset!");
static_assert(offsetof(UInputRowTwoSlots_C, LabelText) == 0x0002E0, "Member 'UInputRowTwoSlots_C::LabelText' has a wrong offset!");
static_assert(offsetof(UInputRowTwoSlots_C, Label) == 0x0002E8, "Member 'UInputRowTwoSlots_C::Label' has a wrong offset!");
static_assert(offsetof(UInputRowTwoSlots_C, Index_0) == 0x000300, "Member 'UInputRowTwoSlots_C::Index_0' has a wrong offset!");
static_assert(offsetof(UInputRowTwoSlots_C, MinDesiredWidth) == 0x000308, "Member 'UInputRowTwoSlots_C::MinDesiredWidth' has a wrong offset!");

}

