#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputActionUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InputActionUI.InputActionUI_C
// 0x0048 (0x0308 - 0x02C0)
class UInputActionUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStyledActionLabel_C*                   StyledActionLabelGamepad;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionLabel_C*                   StyledActionLabelKeyboard;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisLabel_C*                     StyledAxisLabelGamepad;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisLabel_C*                     StyledAxisLabelKeyboard;                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   InputActionNameKeyboard;                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InputActionNameGamepad;                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputActionIsAxis;                                 // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowForGamepad;                                    // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowForKeyboard;                                   // 0x0302(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollapsedWhenhidden;                               // 0x0303(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_InputActionUI(int32 EntryPoint);
	void GetHiddenMode(ESlateVisibility* HiddenMode);
	void OnInputMethodChanged_Event(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);
	void UpdateButtonVisibility(ECommonInputType InputType);
	void UpdateVisibleButton(ECommonInputType InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputActionUI_C">();
	}
	static class UInputActionUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputActionUI_C>();
	}
};
static_assert(alignof(UInputActionUI_C) == 0x000008, "Wrong alignment on UInputActionUI_C");
static_assert(sizeof(UInputActionUI_C) == 0x000308, "Wrong size on UInputActionUI_C");
static_assert(offsetof(UInputActionUI_C, UberGraphFrame) == 0x0002C0, "Member 'UInputActionUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, StyledActionLabelGamepad) == 0x0002C8, "Member 'UInputActionUI_C::StyledActionLabelGamepad' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, StyledActionLabelKeyboard) == 0x0002D0, "Member 'UInputActionUI_C::StyledActionLabelKeyboard' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, StyledAxisLabelGamepad) == 0x0002D8, "Member 'UInputActionUI_C::StyledAxisLabelGamepad' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, StyledAxisLabelKeyboard) == 0x0002E0, "Member 'UInputActionUI_C::StyledAxisLabelKeyboard' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, WidgetSwitcher) == 0x0002E8, "Member 'UInputActionUI_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, InputActionNameKeyboard) == 0x0002F0, "Member 'UInputActionUI_C::InputActionNameKeyboard' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, InputActionNameGamepad) == 0x0002F8, "Member 'UInputActionUI_C::InputActionNameGamepad' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, InputActionIsAxis) == 0x000300, "Member 'UInputActionUI_C::InputActionIsAxis' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, ShowForGamepad) == 0x000301, "Member 'UInputActionUI_C::ShowForGamepad' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, ShowForKeyboard) == 0x000302, "Member 'UInputActionUI_C::ShowForKeyboard' has a wrong offset!");
static_assert(offsetof(UInputActionUI_C, CollapsedWhenhidden) == 0x000303, "Member 'UInputActionUI_C::CollapsedWhenhidden' has a wrong offset!");

}

