#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputSettingsPage

#include "Basic.hpp"

#include "SettingPage_classes.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InputSettingsPage.InputSettingsPage_C
// 0x01F0 (0x04D0 - 0x02E0)
class UInputSettingsPage_C final : public USettingPage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStyledActionMapping_C*                 ActionInputActionWheel_GP;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputActionWheel_KB;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputCancelVote_GP;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputCancelVote_KB;                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputJump_GP;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputJump_KB;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputPlaceFlag_GP;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputPlaceFlag_KB;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputSlideRoll_GP;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputSlideRoll_KB;                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputStartRace_GP;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputStartRace_KB;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputSupermoveLeft_GP;                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputSupermoveLeft_KB;                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputSupermoveRight_GP;                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputSupermoveRight_KB;                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputVote_GP;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledActionMapping_C*                 ActionInputVote_KB;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputLookDown_GP;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputLookDown_KB;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputLookLeft_GP;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputLookLeft_KB;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputLookRight_GP;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputLookRight_KB;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputLookUp_GP;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputLookUp_KB;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputMoveBackward_GP;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputMoveBackward_KB;                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputMoveForward_GP;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputMoveForward_KB;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputMoveLeft_GP;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputMoveLeft_KB;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputMoveRight_GP;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledAxisMapping_C*                   AxisInputMoveRight_KB;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalRadioSelect_C*               ControlPresetRadioSelect;                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultRadioSelectSetting_C*           GamepadIconsSetting;                               // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    InputRowHeader;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           InputSettings;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_VAR;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_ActionWheel;                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_CancelVote;                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_Jump;                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_LookDown;                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_LookLeft;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_LookRight;                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_LookUp;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_MoveBackward;                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_MoveForward;                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_MoveLeft;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_MoveRight;                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_PlaceFlag;                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_SlideRoll;                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_StartRace;                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_SuperMoveLeft;                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_SupermoveRight;                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputRowTwoSlots_C*                    SettingInputRow_Vote;                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_GamepadXSensitivity;                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_GamepadYSensitivity;                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_MouseXSensitivity_DEFAULTFOCUS;         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_MouseYSensitivity;                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRowHeader_C*                    SettingRowHeaderControls;                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__InputSettingsPage_HorizontalRadioSelect_K2Node_ComponentBoundEvent_0_RadioSelectedSignature__DelegateSignature(const class FString& Value);
	void Construct();
	void ExecuteUbergraph_InputSettingsPage(int32 EntryPoint);
	void OnIconSetSettingChanged(const class FString& NewValue);
	void OnSettingsClosed();
	void SetScrollBoxDestination(EDescendantScrollDestination Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputSettingsPage_C">();
	}
	static class UInputSettingsPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputSettingsPage_C>();
	}
};
static_assert(alignof(UInputSettingsPage_C) == 0x000008, "Wrong alignment on UInputSettingsPage_C");
static_assert(sizeof(UInputSettingsPage_C) == 0x0004D0, "Wrong size on UInputSettingsPage_C");
static_assert(offsetof(UInputSettingsPage_C, UberGraphFrame) == 0x0002E0, "Member 'UInputSettingsPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputActionWheel_GP) == 0x0002E8, "Member 'UInputSettingsPage_C::ActionInputActionWheel_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputActionWheel_KB) == 0x0002F0, "Member 'UInputSettingsPage_C::ActionInputActionWheel_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputCancelVote_GP) == 0x0002F8, "Member 'UInputSettingsPage_C::ActionInputCancelVote_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputCancelVote_KB) == 0x000300, "Member 'UInputSettingsPage_C::ActionInputCancelVote_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputJump_GP) == 0x000308, "Member 'UInputSettingsPage_C::ActionInputJump_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputJump_KB) == 0x000310, "Member 'UInputSettingsPage_C::ActionInputJump_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputPlaceFlag_GP) == 0x000318, "Member 'UInputSettingsPage_C::ActionInputPlaceFlag_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputPlaceFlag_KB) == 0x000320, "Member 'UInputSettingsPage_C::ActionInputPlaceFlag_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputSlideRoll_GP) == 0x000328, "Member 'UInputSettingsPage_C::ActionInputSlideRoll_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputSlideRoll_KB) == 0x000330, "Member 'UInputSettingsPage_C::ActionInputSlideRoll_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputStartRace_GP) == 0x000338, "Member 'UInputSettingsPage_C::ActionInputStartRace_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputStartRace_KB) == 0x000340, "Member 'UInputSettingsPage_C::ActionInputStartRace_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputSupermoveLeft_GP) == 0x000348, "Member 'UInputSettingsPage_C::ActionInputSupermoveLeft_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputSupermoveLeft_KB) == 0x000350, "Member 'UInputSettingsPage_C::ActionInputSupermoveLeft_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputSupermoveRight_GP) == 0x000358, "Member 'UInputSettingsPage_C::ActionInputSupermoveRight_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputSupermoveRight_KB) == 0x000360, "Member 'UInputSettingsPage_C::ActionInputSupermoveRight_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputVote_GP) == 0x000368, "Member 'UInputSettingsPage_C::ActionInputVote_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ActionInputVote_KB) == 0x000370, "Member 'UInputSettingsPage_C::ActionInputVote_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputLookDown_GP) == 0x000378, "Member 'UInputSettingsPage_C::AxisInputLookDown_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputLookDown_KB) == 0x000380, "Member 'UInputSettingsPage_C::AxisInputLookDown_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputLookLeft_GP) == 0x000388, "Member 'UInputSettingsPage_C::AxisInputLookLeft_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputLookLeft_KB) == 0x000390, "Member 'UInputSettingsPage_C::AxisInputLookLeft_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputLookRight_GP) == 0x000398, "Member 'UInputSettingsPage_C::AxisInputLookRight_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputLookRight_KB) == 0x0003A0, "Member 'UInputSettingsPage_C::AxisInputLookRight_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputLookUp_GP) == 0x0003A8, "Member 'UInputSettingsPage_C::AxisInputLookUp_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputLookUp_KB) == 0x0003B0, "Member 'UInputSettingsPage_C::AxisInputLookUp_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputMoveBackward_GP) == 0x0003B8, "Member 'UInputSettingsPage_C::AxisInputMoveBackward_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputMoveBackward_KB) == 0x0003C0, "Member 'UInputSettingsPage_C::AxisInputMoveBackward_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputMoveForward_GP) == 0x0003C8, "Member 'UInputSettingsPage_C::AxisInputMoveForward_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputMoveForward_KB) == 0x0003D0, "Member 'UInputSettingsPage_C::AxisInputMoveForward_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputMoveLeft_GP) == 0x0003D8, "Member 'UInputSettingsPage_C::AxisInputMoveLeft_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputMoveLeft_KB) == 0x0003E0, "Member 'UInputSettingsPage_C::AxisInputMoveLeft_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputMoveRight_GP) == 0x0003E8, "Member 'UInputSettingsPage_C::AxisInputMoveRight_GP' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, AxisInputMoveRight_KB) == 0x0003F0, "Member 'UInputSettingsPage_C::AxisInputMoveRight_KB' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ControlPresetRadioSelect) == 0x0003F8, "Member 'UInputSettingsPage_C::ControlPresetRadioSelect' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, GamepadIconsSetting) == 0x000400, "Member 'UInputSettingsPage_C::GamepadIconsSetting' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, InputRowHeader) == 0x000408, "Member 'UInputSettingsPage_C::InputRowHeader' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, InputSettings) == 0x000410, "Member 'UInputSettingsPage_C::InputSettings' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, ScrollBox_VAR) == 0x000418, "Member 'UInputSettingsPage_C::ScrollBox_VAR' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_ActionWheel) == 0x000420, "Member 'UInputSettingsPage_C::SettingInputRow_ActionWheel' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_CancelVote) == 0x000428, "Member 'UInputSettingsPage_C::SettingInputRow_CancelVote' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_Jump) == 0x000430, "Member 'UInputSettingsPage_C::SettingInputRow_Jump' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_LookDown) == 0x000438, "Member 'UInputSettingsPage_C::SettingInputRow_LookDown' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_LookLeft) == 0x000440, "Member 'UInputSettingsPage_C::SettingInputRow_LookLeft' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_LookRight) == 0x000448, "Member 'UInputSettingsPage_C::SettingInputRow_LookRight' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_LookUp) == 0x000450, "Member 'UInputSettingsPage_C::SettingInputRow_LookUp' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_MoveBackward) == 0x000458, "Member 'UInputSettingsPage_C::SettingInputRow_MoveBackward' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_MoveForward) == 0x000460, "Member 'UInputSettingsPage_C::SettingInputRow_MoveForward' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_MoveLeft) == 0x000468, "Member 'UInputSettingsPage_C::SettingInputRow_MoveLeft' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_MoveRight) == 0x000470, "Member 'UInputSettingsPage_C::SettingInputRow_MoveRight' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_PlaceFlag) == 0x000478, "Member 'UInputSettingsPage_C::SettingInputRow_PlaceFlag' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_SlideRoll) == 0x000480, "Member 'UInputSettingsPage_C::SettingInputRow_SlideRoll' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_StartRace) == 0x000488, "Member 'UInputSettingsPage_C::SettingInputRow_StartRace' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_SuperMoveLeft) == 0x000490, "Member 'UInputSettingsPage_C::SettingInputRow_SuperMoveLeft' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_SupermoveRight) == 0x000498, "Member 'UInputSettingsPage_C::SettingInputRow_SupermoveRight' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingInputRow_Vote) == 0x0004A0, "Member 'UInputSettingsPage_C::SettingInputRow_Vote' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingRow_GamepadXSensitivity) == 0x0004A8, "Member 'UInputSettingsPage_C::SettingRow_GamepadXSensitivity' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingRow_GamepadYSensitivity) == 0x0004B0, "Member 'UInputSettingsPage_C::SettingRow_GamepadYSensitivity' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingRow_MouseXSensitivity_DEFAULTFOCUS) == 0x0004B8, "Member 'UInputSettingsPage_C::SettingRow_MouseXSensitivity_DEFAULTFOCUS' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingRow_MouseYSensitivity) == 0x0004C0, "Member 'UInputSettingsPage_C::SettingRow_MouseYSensitivity' has a wrong offset!");
static_assert(offsetof(UInputSettingsPage_C, SettingRowHeaderControls) == 0x0004C8, "Member 'UInputSettingsPage_C::SettingRowHeaderControls' has a wrong offset!");

}

