#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KitData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct KitData.KitData
// 0x0068 (0x0068 - 0x0000)
struct FKitData final
{
public:
	class FText                                   DisplayName_4_25BBD8F6420C12F959D5E2BF7E814C92;    // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_6_B8FC68A84072FF334FB4E1918428B7AB;    // 0x0018(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Icon_9_31A760EC4774406FF97CBC869C6BC675;           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   LocationName_12_C427E552491E867FC137C792235290C5;  // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FString                                 KitId_19_EB5B24B14D029EE4004BCB8337C8E00C;         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Variant_18_4D4C80D8413A0F8A3F2BB78146C14D3A;       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FKitData) == 0x000008, "Wrong alignment on FKitData");
static_assert(sizeof(FKitData) == 0x000068, "Wrong size on FKitData");
static_assert(offsetof(FKitData, DisplayName_4_25BBD8F6420C12F959D5E2BF7E814C92) == 0x000000, "Member 'FKitData::DisplayName_4_25BBD8F6420C12F959D5E2BF7E814C92' has a wrong offset!");
static_assert(offsetof(FKitData, Description_6_B8FC68A84072FF334FB4E1918428B7AB) == 0x000018, "Member 'FKitData::Description_6_B8FC68A84072FF334FB4E1918428B7AB' has a wrong offset!");
static_assert(offsetof(FKitData, Icon_9_31A760EC4774406FF97CBC869C6BC675) == 0x000030, "Member 'FKitData::Icon_9_31A760EC4774406FF97CBC869C6BC675' has a wrong offset!");
static_assert(offsetof(FKitData, LocationName_12_C427E552491E867FC137C792235290C5) == 0x000038, "Member 'FKitData::LocationName_12_C427E552491E867FC137C792235290C5' has a wrong offset!");
static_assert(offsetof(FKitData, KitId_19_EB5B24B14D029EE4004BCB8337C8E00C) == 0x000050, "Member 'FKitData::KitId_19_EB5B24B14D029EE4004BCB8337C8E00C' has a wrong offset!");
static_assert(offsetof(FKitData, Variant_18_4D4C80D8413A0F8A3F2BB78146C14D3A) == 0x000060, "Member 'FKitData::Variant_18_4D4C80D8413A0F8A3F2BB78146C14D3A' has a wrong offset!");

}

