#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MasterMenuTabButtonBP

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MasterMenuTabButtonBP.MasterMenuTabButtonBP_C
// 0x0078 (0x0338 - 0x02C0)
class UMasterMenuTabButtonBP_C final : public UHighlightableElement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_621;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NotificationOverlay;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NotificationText;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleField;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GymMainMenu_C*                      Main;                                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0300(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FColor                                 NormalColor;                                       // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 HighlightColor;                                    // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TextHighlightColor;                                // 0x0320(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__MasterMenuTabButtonBP_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MasterMenuTabButtonBP_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MasterMenuTabButtonBP_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_MasterMenuTabButtonBP(int32 EntryPoint);
	void Get_TitleField_ColorAndOpacity();
	struct FSlateColor Get_TitleField_ColorAndOpacity_0();
	void PlayButtonSound();
	void SetHighlight(bool Value);
	void SetNotifications(int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MasterMenuTabButtonBP_C">();
	}
	static class UMasterMenuTabButtonBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMasterMenuTabButtonBP_C>();
	}
};
static_assert(alignof(UMasterMenuTabButtonBP_C) == 0x000008, "Wrong alignment on UMasterMenuTabButtonBP_C");
static_assert(sizeof(UMasterMenuTabButtonBP_C) == 0x000338, "Wrong size on UMasterMenuTabButtonBP_C");
static_assert(offsetof(UMasterMenuTabButtonBP_C, UberGraphFrame) == 0x0002C0, "Member 'UMasterMenuTabButtonBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, Button) == 0x0002C8, "Member 'UMasterMenuTabButtonBP_C::Button' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, Image_621) == 0x0002D0, "Member 'UMasterMenuTabButtonBP_C::Image_621' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, NotificationOverlay) == 0x0002D8, "Member 'UMasterMenuTabButtonBP_C::NotificationOverlay' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, NotificationText) == 0x0002E0, "Member 'UMasterMenuTabButtonBP_C::NotificationText' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, TitleField) == 0x0002E8, "Member 'UMasterMenuTabButtonBP_C::TitleField' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, Main) == 0x0002F0, "Member 'UMasterMenuTabButtonBP_C::Main' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, Index_0) == 0x0002F8, "Member 'UMasterMenuTabButtonBP_C::Index_0' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, Title) == 0x000300, "Member 'UMasterMenuTabButtonBP_C::Title' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, NormalColor) == 0x000318, "Member 'UMasterMenuTabButtonBP_C::NormalColor' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, HighlightColor) == 0x00031C, "Member 'UMasterMenuTabButtonBP_C::HighlightColor' has a wrong offset!");
static_assert(offsetof(UMasterMenuTabButtonBP_C, TextHighlightColor) == 0x000320, "Member 'UMasterMenuTabButtonBP_C::TextHighlightColor' has a wrong offset!");

}

