#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MasterMenuTabButtonBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MasterMenuTabButtonBP.MasterMenuTabButtonBP_C.ExecuteUbergraph_MasterMenuTabButtonBP
// 0x00A8 (0x00A8 - 0x0000)
struct MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_Event_Value;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x003C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0050(0x0014)()
	int32                                         K2Node_Event_Count;                                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0094(0x0014)()
};
static_assert(alignof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP) == 0x000008, "Wrong alignment on MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP");
static_assert(sizeof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP) == 0x0000A8, "Wrong size on MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, EntryPoint) == 0x000000, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, K2Node_Event_Value) == 0x000018, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00001C, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x00002C, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, K2Node_MakeStruct_SlateColor_1) == 0x00003C, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, K2Node_MakeStruct_SlateColor_2) == 0x000050, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, K2Node_Event_Count) == 0x000064, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, K2Node_DynamicCast_AsSound_Base) == 0x000088, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP, K2Node_MakeStruct_SlateColor_3) == 0x000094, "Member 'MasterMenuTabButtonBP_C_ExecuteUbergraph_MasterMenuTabButtonBP::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function MasterMenuTabButtonBP.MasterMenuTabButtonBP_C.Get_TitleField_ColorAndOpacity_0
// 0x0014 (0x0014 - 0x0000)
struct MasterMenuTabButtonBP_C_Get_TitleField_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(MasterMenuTabButtonBP_C_Get_TitleField_ColorAndOpacity_0) == 0x000004, "Wrong alignment on MasterMenuTabButtonBP_C_Get_TitleField_ColorAndOpacity_0");
static_assert(sizeof(MasterMenuTabButtonBP_C_Get_TitleField_ColorAndOpacity_0) == 0x000014, "Wrong size on MasterMenuTabButtonBP_C_Get_TitleField_ColorAndOpacity_0");
static_assert(offsetof(MasterMenuTabButtonBP_C_Get_TitleField_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'MasterMenuTabButtonBP_C_Get_TitleField_ColorAndOpacity_0::ReturnValue' has a wrong offset!");

// Function MasterMenuTabButtonBP.MasterMenuTabButtonBP_C.SetHighlight
// 0x0001 (0x0001 - 0x0000)
struct MasterMenuTabButtonBP_C_SetHighlight final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MasterMenuTabButtonBP_C_SetHighlight) == 0x000001, "Wrong alignment on MasterMenuTabButtonBP_C_SetHighlight");
static_assert(sizeof(MasterMenuTabButtonBP_C_SetHighlight) == 0x000001, "Wrong size on MasterMenuTabButtonBP_C_SetHighlight");
static_assert(offsetof(MasterMenuTabButtonBP_C_SetHighlight, Value) == 0x000000, "Member 'MasterMenuTabButtonBP_C_SetHighlight::Value' has a wrong offset!");

// Function MasterMenuTabButtonBP.MasterMenuTabButtonBP_C.SetNotifications
// 0x0004 (0x0004 - 0x0000)
struct MasterMenuTabButtonBP_C_SetNotifications final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MasterMenuTabButtonBP_C_SetNotifications) == 0x000004, "Wrong alignment on MasterMenuTabButtonBP_C_SetNotifications");
static_assert(sizeof(MasterMenuTabButtonBP_C_SetNotifications) == 0x000004, "Wrong size on MasterMenuTabButtonBP_C_SetNotifications");
static_assert(offsetof(MasterMenuTabButtonBP_C_SetNotifications, Count) == 0x000000, "Member 'MasterMenuTabButtonBP_C_SetNotifications::Count' has a wrong offset!");

}

