#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Objective_WBP

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Objective_WBP.Objective_WBP_C.ExecuteUbergraph_Objective_WBP
// 0x00D8 (0x00D8 - 0x0000)
struct Objective_WBP_C_ExecuteUbergraph_Objective_WBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProgressionTextAreaFillOverride_ReturnValue; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0058(0x0008)(NoDestructor)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetProgressionText_ReturnValue;           // 0x0070(0x0018)(ConstParm)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x0088(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsObjectiveStarted_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0098(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP) == 0x000008, "Wrong alignment on Objective_WBP_C_ExecuteUbergraph_Objective_WBP");
static_assert(sizeof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP) == 0x0000D8, "Wrong size on Objective_WBP_C_ExecuteUbergraph_Objective_WBP");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, EntryPoint) == 0x000000, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, Temp_bool_Variable) == 0x000004, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, K2Node_Event_IsDesignTime) == 0x000005, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, K2Node_Event_MyGeometry) == 0x000008, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, K2Node_Event_InDeltaTime) == 0x000040, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000048, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_GetProgressionTextAreaFillOverride_ReturnValue) == 0x000050, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_GetProgressionTextAreaFillOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000054, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, K2Node_MakeStruct_SlateChildSize) == 0x000058, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000060, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_GetProgressionText_ReturnValue) == 0x000070, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_GetProgressionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, K2Node_MakeStruct_SlateChildSize_1) == 0x000088, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_IsObjectiveStarted_ReturnValue) == 0x000091, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_IsObjectiveStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_MakeLiteralText_ReturnValue) == 0x000098, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, Temp_byte_Variable) == 0x0000B0, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0000B1, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, Temp_byte_Variable_1) == 0x0000B3, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, K2Node_Select_Default) == 0x0000B4, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0000B8, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000C0, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000C8, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_ExecuteUbergraph_Objective_WBP, K2Node_MakeStruct_Value_ImplicitCast) == 0x0000D0, "Member 'Objective_WBP_C_ExecuteUbergraph_Objective_WBP::K2Node_MakeStruct_Value_ImplicitCast' has a wrong offset!");

// Function Objective_WBP.Objective_WBP_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Objective_WBP_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Objective_WBP_C_PreConstruct) == 0x000001, "Wrong alignment on Objective_WBP_C_PreConstruct");
static_assert(sizeof(Objective_WBP_C_PreConstruct) == 0x000001, "Wrong size on Objective_WBP_C_PreConstruct");
static_assert(offsetof(Objective_WBP_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Objective_WBP_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Objective_WBP.Objective_WBP_C.Tick
// 0x003C (0x003C - 0x0000)
struct Objective_WBP_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Objective_WBP_C_Tick) == 0x000004, "Wrong alignment on Objective_WBP_C_Tick");
static_assert(sizeof(Objective_WBP_C_Tick) == 0x00003C, "Wrong size on Objective_WBP_C_Tick");
static_assert(offsetof(Objective_WBP_C_Tick, MyGeometry) == 0x000000, "Member 'Objective_WBP_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Objective_WBP_C_Tick, InDeltaTime) == 0x000038, "Member 'Objective_WBP_C_Tick::InDeltaTime' has a wrong offset!");

}

