#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Objective_WBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Objective_WBP.Objective_WBP_C
// 0x0028 (0x02E8 - 0x02C0)
class UObjective_WBP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CompleteText;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Container;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DescrText;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGymObjective*                          Objective;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Objective_WBP(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Objective_WBP_C">();
	}
	static class UObjective_WBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjective_WBP_C>();
	}
};
static_assert(alignof(UObjective_WBP_C) == 0x000008, "Wrong alignment on UObjective_WBP_C");
static_assert(sizeof(UObjective_WBP_C) == 0x0002E8, "Wrong size on UObjective_WBP_C");
static_assert(offsetof(UObjective_WBP_C, UberGraphFrame) == 0x0002C0, "Member 'UObjective_WBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UObjective_WBP_C, CompleteText) == 0x0002C8, "Member 'UObjective_WBP_C::CompleteText' has a wrong offset!");
static_assert(offsetof(UObjective_WBP_C, Container) == 0x0002D0, "Member 'UObjective_WBP_C::Container' has a wrong offset!");
static_assert(offsetof(UObjective_WBP_C, DescrText) == 0x0002D8, "Member 'UObjective_WBP_C::DescrText' has a wrong offset!");
static_assert(offsetof(UObjective_WBP_C, Objective) == 0x0002E0, "Member 'UObjective_WBP_C::Objective' has a wrong offset!");

}

