#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Physical_Behavior_ActorComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C
// 0x01C0 (0x0260 - 0x00A0)
class UPhysical_Behavior_ActorComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerController*                      Player_Controller;                                 // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Owner;                                             // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRagdolling;                                      // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeshLocation;                                      // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetGroundLocation;                              // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorSpringState                     MeshLocationSpringState;                           // 0x00F0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                Pelvis_Offset;                                     // 0x0128(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerStopUsingPoseSnapshot;                      // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerStartUsingPoseSnapshot;                     // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerPlayGetup;                                  // 0x0142(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RagdollStationaryTime;                             // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RagdollStationaryTimeForGetup;                     // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevCenterOfMass;                                  // 0x0158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowInfo;                                          // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RagdollStationarySpeedThreshold;                   // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             GetupTMOffset;                                     // 0x0180(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             GetupTargetTM;                                     // 0x01E0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GetupCounter;                                      // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            CharacterMovement;                                 // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleComponent;                                  // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CanReturnToAnimation(bool* Result);
	void ExecuteUbergraph_Physical_Behavior_ActorComponent(int32 EntryPoint);
	void Initialize(const struct FVector& PelvisOffset, class APlayerController* PlayerController);
	void InitializeOwnerVars();
	void OnBackAmount(double* OnBackAmount_0);
	void ReceiveTick(float DeltaSeconds);
	void ReturnToAnimation();
	void ReturnToAnimation1();
	void ReturnToAnimation2();
	void ReturnToAnimation3();
	void ReturnToAnimationFinal();
	void SetGetupOrientation();
	void StartRagdoll();
	void UpdateMeshLocation();
	void UpdateRagdoll();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Physical_Behavior_ActorComponent_C">();
	}
	static class UPhysical_Behavior_ActorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysical_Behavior_ActorComponent_C>();
	}
};
static_assert(alignof(UPhysical_Behavior_ActorComponent_C) == 0x000010, "Wrong alignment on UPhysical_Behavior_ActorComponent_C");
static_assert(sizeof(UPhysical_Behavior_ActorComponent_C) == 0x000260, "Wrong size on UPhysical_Behavior_ActorComponent_C");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UPhysical_Behavior_ActorComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, Player_Controller) == 0x0000A8, "Member 'UPhysical_Behavior_ActorComponent_C::Player_Controller' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, Owner) == 0x0000B0, "Member 'UPhysical_Behavior_ActorComponent_C::Owner' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, IsRagdolling) == 0x0000B8, "Member 'UPhysical_Behavior_ActorComponent_C::IsRagdolling' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, MeshLocation) == 0x0000C0, "Member 'UPhysical_Behavior_ActorComponent_C::MeshLocation' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, TargetGroundLocation) == 0x0000D8, "Member 'UPhysical_Behavior_ActorComponent_C::TargetGroundLocation' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, MeshLocationSpringState) == 0x0000F0, "Member 'UPhysical_Behavior_ActorComponent_C::MeshLocationSpringState' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, Pelvis_Offset) == 0x000128, "Member 'UPhysical_Behavior_ActorComponent_C::Pelvis_Offset' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, TriggerStopUsingPoseSnapshot) == 0x000140, "Member 'UPhysical_Behavior_ActorComponent_C::TriggerStopUsingPoseSnapshot' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, TriggerStartUsingPoseSnapshot) == 0x000141, "Member 'UPhysical_Behavior_ActorComponent_C::TriggerStartUsingPoseSnapshot' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, TriggerPlayGetup) == 0x000142, "Member 'UPhysical_Behavior_ActorComponent_C::TriggerPlayGetup' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, RagdollStationaryTime) == 0x000148, "Member 'UPhysical_Behavior_ActorComponent_C::RagdollStationaryTime' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, RagdollStationaryTimeForGetup) == 0x000150, "Member 'UPhysical_Behavior_ActorComponent_C::RagdollStationaryTimeForGetup' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, PrevCenterOfMass) == 0x000158, "Member 'UPhysical_Behavior_ActorComponent_C::PrevCenterOfMass' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, ShowInfo) == 0x000170, "Member 'UPhysical_Behavior_ActorComponent_C::ShowInfo' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, RagdollStationarySpeedThreshold) == 0x000178, "Member 'UPhysical_Behavior_ActorComponent_C::RagdollStationarySpeedThreshold' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, GetupTMOffset) == 0x000180, "Member 'UPhysical_Behavior_ActorComponent_C::GetupTMOffset' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, GetupTargetTM) == 0x0001E0, "Member 'UPhysical_Behavior_ActorComponent_C::GetupTargetTM' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, GetupCounter) == 0x000240, "Member 'UPhysical_Behavior_ActorComponent_C::GetupCounter' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, CharacterMovement) == 0x000248, "Member 'UPhysical_Behavior_ActorComponent_C::CharacterMovement' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, Mesh) == 0x000250, "Member 'UPhysical_Behavior_ActorComponent_C::Mesh' has a wrong offset!");
static_assert(offsetof(UPhysical_Behavior_ActorComponent_C, CapsuleComponent) == 0x000258, "Member 'UPhysical_Behavior_ActorComponent_C::CapsuleComponent' has a wrong offset!");

}

