#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicalBehavior_AnimBP_Data

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PhysicalBehavior_AnimBP_Data.PhysicalBehavior_AnimBP_Data
// 0x0020 (0x0020 - 0x0000)
struct FPhysicalBehavior_AnimBP_Data final
{
public:
	bool                                          IsRagdolling_3_ACBB8697497174093025CC83A8B630DD;   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsingPoseSnapshot_5_58710E794752A1B1AE2EEF9D9069062E; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRolling_7_AE5309DF451B0DBC8B37C2B14AAD2CFD;      // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GetupOnBackAmount_12_BDBEC52F4C06F58750782BB62880D36A; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysical_Behavior_ActorComponent_C*    PhysicalBehaviorComponent_13_3605A17D41478447D50DF58A713595BD; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URollDownSlope_ActorComponent_C*        RollDownSlopeComponent_16_4CB0073A42126A6F16865691FEDCAB89; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPhysicalBehavior_AnimBP_Data) == 0x000008, "Wrong alignment on FPhysicalBehavior_AnimBP_Data");
static_assert(sizeof(FPhysicalBehavior_AnimBP_Data) == 0x000020, "Wrong size on FPhysicalBehavior_AnimBP_Data");
static_assert(offsetof(FPhysicalBehavior_AnimBP_Data, IsRagdolling_3_ACBB8697497174093025CC83A8B630DD) == 0x000000, "Member 'FPhysicalBehavior_AnimBP_Data::IsRagdolling_3_ACBB8697497174093025CC83A8B630DD' has a wrong offset!");
static_assert(offsetof(FPhysicalBehavior_AnimBP_Data, UsingPoseSnapshot_5_58710E794752A1B1AE2EEF9D9069062E) == 0x000001, "Member 'FPhysicalBehavior_AnimBP_Data::UsingPoseSnapshot_5_58710E794752A1B1AE2EEF9D9069062E' has a wrong offset!");
static_assert(offsetof(FPhysicalBehavior_AnimBP_Data, IsRolling_7_AE5309DF451B0DBC8B37C2B14AAD2CFD) == 0x000002, "Member 'FPhysicalBehavior_AnimBP_Data::IsRolling_7_AE5309DF451B0DBC8B37C2B14AAD2CFD' has a wrong offset!");
static_assert(offsetof(FPhysicalBehavior_AnimBP_Data, GetupOnBackAmount_12_BDBEC52F4C06F58750782BB62880D36A) == 0x000008, "Member 'FPhysicalBehavior_AnimBP_Data::GetupOnBackAmount_12_BDBEC52F4C06F58750782BB62880D36A' has a wrong offset!");
static_assert(offsetof(FPhysicalBehavior_AnimBP_Data, PhysicalBehaviorComponent_13_3605A17D41478447D50DF58A713595BD) == 0x000010, "Member 'FPhysicalBehavior_AnimBP_Data::PhysicalBehaviorComponent_13_3605A17D41478447D50DF58A713595BD' has a wrong offset!");
static_assert(offsetof(FPhysicalBehavior_AnimBP_Data, RollDownSlopeComponent_16_4CB0073A42126A6F16865691FEDCAB89) == 0x000018, "Member 'FPhysicalBehavior_AnimBP_Data::RollDownSlopeComponent_16_4CB0073A42126A6F16865691FEDCAB89' has a wrong offset!");

}

