#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Physical_Behavior_ActorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.CanReturnToAnimation
// 0x0002 (0x0002 - 0x0000)
struct Physical_Behavior_ActorComponent_C_CanReturnToAnimation final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_CanReturnToAnimation) == 0x000001, "Wrong alignment on Physical_Behavior_ActorComponent_C_CanReturnToAnimation");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_CanReturnToAnimation) == 0x000002, "Wrong size on Physical_Behavior_ActorComponent_C_CanReturnToAnimation");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_CanReturnToAnimation, Result) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_CanReturnToAnimation::Result' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_CanReturnToAnimation, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000001, "Member 'Physical_Behavior_ActorComponent_C_CanReturnToAnimation::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.ExecuteUbergraph_Physical_Behavior_ActorComponent
// 0x0128 (0x0128 - 0x0000)
struct Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanReturnToAnimation_Result;              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent) == 0x000008, "Wrong alignment on Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent) == 0x000128, "Wrong size on Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent, EntryPoint) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000008, "Member 'Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent, K2Node_Event_DeltaSeconds) == 0x0000F0, "Member 'Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent, CallFunc_CanReturnToAnimation_Result) == 0x0000F4, "Member 'Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent::CallFunc_CanReturnToAnimation_Result' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000F8, "Member 'Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent, CallFunc_GetPhysicsLinearVelocity_ReturnValue) == 0x000110, "Member 'Physical_Behavior_ActorComponent_C_ExecuteUbergraph_Physical_Behavior_ActorComponent::CallFunc_GetPhysicsLinearVelocity_ReturnValue' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.Initialize
// 0x0020 (0x0020 - 0x0000)
struct Physical_Behavior_ActorComponent_C_Initialize final
{
public:
	struct FVector                                PelvisOffset;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_Initialize) == 0x000008, "Wrong alignment on Physical_Behavior_ActorComponent_C_Initialize");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_Initialize) == 0x000020, "Wrong size on Physical_Behavior_ActorComponent_C_Initialize");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_Initialize, PelvisOffset) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_Initialize::PelvisOffset' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_Initialize, PlayerController) == 0x000018, "Member 'Physical_Behavior_ActorComponent_C_Initialize::PlayerController' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.InitializeOwnerVars
// 0x0028 (0x0028 - 0x0000)
struct Physical_Behavior_ActorComponent_C_InitializeOwnerVars final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_InitializeOwnerVars) == 0x000008, "Wrong alignment on Physical_Behavior_ActorComponent_C_InitializeOwnerVars");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_InitializeOwnerVars) == 0x000028, "Wrong size on Physical_Behavior_ActorComponent_C_InitializeOwnerVars");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_InitializeOwnerVars, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_InitializeOwnerVars::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_InitializeOwnerVars, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'Physical_Behavior_ActorComponent_C_InitializeOwnerVars::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_InitializeOwnerVars, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000010, "Member 'Physical_Behavior_ActorComponent_C_InitializeOwnerVars::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_InitializeOwnerVars, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000018, "Member 'Physical_Behavior_ActorComponent_C_InitializeOwnerVars::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_InitializeOwnerVars, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Physical_Behavior_ActorComponent_C_InitializeOwnerVars::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.OnBackAmount
// 0x0058 (0x0058 - 0x0000)
struct Physical_Behavior_ActorComponent_C_OnBackAmount final
{
public:
	double                                        OnBackAmount_0;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_OnBackAmount) == 0x000008, "Wrong alignment on Physical_Behavior_ActorComponent_C_OnBackAmount");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_OnBackAmount) == 0x000058, "Wrong size on Physical_Behavior_ActorComponent_C_OnBackAmount");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_OnBackAmount, OnBackAmount_0) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_OnBackAmount::OnBackAmount_0' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_OnBackAmount, CallFunc_GetSocketRotation_ReturnValue) == 0x000008, "Member 'Physical_Behavior_ActorComponent_C_OnBackAmount::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_OnBackAmount, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Physical_Behavior_ActorComponent_C_OnBackAmount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_OnBackAmount, CallFunc_GetRightVector_ReturnValue) == 0x000028, "Member 'Physical_Behavior_ActorComponent_C_OnBackAmount::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_OnBackAmount, CallFunc_BreakVector_X) == 0x000040, "Member 'Physical_Behavior_ActorComponent_C_OnBackAmount::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_OnBackAmount, CallFunc_BreakVector_Y) == 0x000048, "Member 'Physical_Behavior_ActorComponent_C_OnBackAmount::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_OnBackAmount, CallFunc_BreakVector_Z) == 0x000050, "Member 'Physical_Behavior_ActorComponent_C_OnBackAmount::CallFunc_BreakVector_Z' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Physical_Behavior_ActorComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on Physical_Behavior_ActorComponent_C_ReceiveTick");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_ReceiveTick) == 0x000004, "Wrong size on Physical_Behavior_ActorComponent_C_ReceiveTick");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.ReturnToAnimation2
// 0x0008 (0x0008 - 0x0000)
struct Physical_Behavior_ActorComponent_C_ReturnToAnimation2 final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_ReturnToAnimation2) == 0x000008, "Wrong alignment on Physical_Behavior_ActorComponent_C_ReturnToAnimation2");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_ReturnToAnimation2) == 0x000008, "Wrong size on Physical_Behavior_ActorComponent_C_ReturnToAnimation2");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_ReturnToAnimation2, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_ReturnToAnimation2::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.SetGetupOrientation
// 0x01C0 (0x01C0 - 0x0000)
struct Physical_Behavior_ActorComponent_C_SetGetupOrientation final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_OnBackAmount_OnBackAmount;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x00D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_SetGetupOrientation) == 0x000008, "Wrong alignment on Physical_Behavior_ActorComponent_C_SetGetupOrientation");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_SetGetupOrientation) == 0x0001C0, "Wrong size on Physical_Behavior_ActorComponent_C_SetGetupOrientation");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, Temp_bool_Variable) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_OnBackAmount_OnBackAmount) == 0x000008, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_OnBackAmount_OnBackAmount' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000030, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_GetSocketLocation_ReturnValue) == 0x000048, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000060, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000078, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000090, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, K2Node_Select_Default) == 0x0000A8, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_MakeRotFromZX_ReturnValue) == 0x0000C0, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_SetGetupOrientation, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0000D8, "Member 'Physical_Behavior_ActorComponent_C_SetGetupOrientation::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.StartRagdoll
// 0x0008 (0x0008 - 0x0000)
struct Physical_Behavior_ActorComponent_C_StartRagdoll final
{
public:
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_StartRagdoll) == 0x000004, "Wrong alignment on Physical_Behavior_ActorComponent_C_StartRagdoll");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_StartRagdoll) == 0x000008, "Wrong size on Physical_Behavior_ActorComponent_C_StartRagdoll");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_StartRagdoll, CallFunc_MakeLiteralName_ReturnValue) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_StartRagdoll::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.UpdateMeshLocation
// 0x0290 (0x0290 - 0x0000)
struct Physical_Behavior_ActorComponent_C_UpdateMeshLocation final
{
public:
	struct FVector                                PelvisLocation;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocalVar_0;                                     // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0058(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VectorSpringInterp_ReturnValue;           // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VectorSpringInterp_DeltaTime_ImplicitCast; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation) == 0x000008, "Wrong alignment on Physical_Behavior_ActorComponent_C_UpdateMeshLocation");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation) == 0x000290, "Wrong size on Physical_Behavior_ActorComponent_C_UpdateMeshLocation");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, PelvisLocation) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::PelvisLocation' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, NewLocalVar_0) == 0x000018, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, Temp_object_Variable) == 0x000030, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_LineTraceSingle_OutHit) == 0x000058, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_LineTraceSingle_ReturnValue) == 0x000140, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000148, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_bBlockingHit) == 0x000150, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_bInitialOverlap) == 0x000151, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_Time) == 0x000154, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_Distance) == 0x000158, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_Location) == 0x000160, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A8, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_PhysMat) == 0x0001C0, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_HitActor) == 0x0001C8, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_HitBoneName) == 0x0001D8, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_BoneName) == 0x0001E0, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_HitItem) == 0x0001E8, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_ElementIndex) == 0x0001EC, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_FaceIndex) == 0x0001F0, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_TraceStart) == 0x0001F8, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_BreakHitResult_TraceEnd) == 0x000210, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000228, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_VectorSpringInterp_ReturnValue) == 0x000240, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_VectorSpringInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_GetSocketLocation_ReturnValue) == 0x000258, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000270, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateMeshLocation, CallFunc_VectorSpringInterp_DeltaTime_ImplicitCast) == 0x000288, "Member 'Physical_Behavior_ActorComponent_C_UpdateMeshLocation::CallFunc_VectorSpringInterp_DeltaTime_ImplicitCast' has a wrong offset!");

// Function Physical_Behavior_ActorComponent.Physical_Behavior_ActorComponent_C.UpdateRagdoll
// 0x0088 (0x0088 - 0x0000)
struct Physical_Behavior_ActorComponent_C_UpdateRagdoll final
{
public:
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSkeletalCenterOfMass_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Physical_Behavior_ActorComponent_C_UpdateRagdoll) == 0x000008, "Wrong alignment on Physical_Behavior_ActorComponent_C_UpdateRagdoll");
static_assert(sizeof(Physical_Behavior_ActorComponent_C_UpdateRagdoll) == 0x000088, "Wrong size on Physical_Behavior_ActorComponent_C_UpdateRagdoll");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateRagdoll, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'Physical_Behavior_ActorComponent_C_UpdateRagdoll::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Physical_Behavior_ActorComponent_C_UpdateRagdoll, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'Physical_Behavior_ActorComponent_C_UpdateRagdoll::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
