#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicalBehavior_BlueprintLibrary

#include "Basic.hpp"

#include "PhysicalBehavior_AnimBP_Data_structs.hpp"


namespace SDK::Params
{

// Function PhysicalBehavior_BlueprintLibrary.PhysicalBehavior_BlueprintLibrary_C.FinishGetUp
// 0x0028 (0x0028 - 0x0000)
struct PhysicalBehavior_BlueprintLibrary_C_FinishGetUp final
{
public:
	struct FPhysicalBehavior_AnimBP_Data          Data;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PhysicalBehavior_BlueprintLibrary_C_FinishGetUp) == 0x000008, "Wrong alignment on PhysicalBehavior_BlueprintLibrary_C_FinishGetUp");
static_assert(sizeof(PhysicalBehavior_BlueprintLibrary_C_FinishGetUp) == 0x000028, "Wrong size on PhysicalBehavior_BlueprintLibrary_C_FinishGetUp");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_FinishGetUp, Data) == 0x000000, "Member 'PhysicalBehavior_BlueprintLibrary_C_FinishGetUp::Data' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_FinishGetUp, __WorldContext) == 0x000020, "Member 'PhysicalBehavior_BlueprintLibrary_C_FinishGetUp::__WorldContext' has a wrong offset!");

// Function PhysicalBehavior_BlueprintLibrary.PhysicalBehavior_BlueprintLibrary_C.Initialize Data
// 0x0070 (0x0070 - 0x0000)
struct PhysicalBehavior_BlueprintLibrary_C_Initialize_Data final
{
public:
	struct FPhysicalBehavior_AnimBP_Data          Data;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UAnimInstance*                          AnimInstance;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysical_Behavior_ActorComponent_C*    CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URollDownSlope_ActorComponent_C*        CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPhysicalBehavior_AnimBP_Data          K2Node_SetFieldsInStruct_StructOut;                // 0x0050(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data) == 0x000008, "Wrong alignment on PhysicalBehavior_BlueprintLibrary_C_Initialize_Data");
static_assert(sizeof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data) == 0x000070, "Wrong size on PhysicalBehavior_BlueprintLibrary_C_Initialize_Data");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data, Data) == 0x000000, "Member 'PhysicalBehavior_BlueprintLibrary_C_Initialize_Data::Data' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data, AnimInstance) == 0x000020, "Member 'PhysicalBehavior_BlueprintLibrary_C_Initialize_Data::AnimInstance' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data, __WorldContext) == 0x000028, "Member 'PhysicalBehavior_BlueprintLibrary_C_Initialize_Data::__WorldContext' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000030, "Member 'PhysicalBehavior_BlueprintLibrary_C_Initialize_Data::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'PhysicalBehavior_BlueprintLibrary_C_Initialize_Data::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'PhysicalBehavior_BlueprintLibrary_C_Initialize_Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000048, "Member 'PhysicalBehavior_BlueprintLibrary_C_Initialize_Data::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Initialize_Data, K2Node_SetFieldsInStruct_StructOut) == 0x000050, "Member 'PhysicalBehavior_BlueprintLibrary_C_Initialize_Data::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function PhysicalBehavior_BlueprintLibrary.PhysicalBehavior_BlueprintLibrary_C.Update
// 0x0050 (0x0050 - 0x0000)
struct PhysicalBehavior_BlueprintLibrary_C_Update final
{
public:
	struct FPhysicalBehavior_AnimBP_Data          Data;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicalBehavior_AnimBP_Data          K2Node_SetFieldsInStruct_StructOut;                // 0x0030(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(PhysicalBehavior_BlueprintLibrary_C_Update) == 0x000008, "Wrong alignment on PhysicalBehavior_BlueprintLibrary_C_Update");
static_assert(sizeof(PhysicalBehavior_BlueprintLibrary_C_Update) == 0x000050, "Wrong size on PhysicalBehavior_BlueprintLibrary_C_Update");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Update, Data) == 0x000000, "Member 'PhysicalBehavior_BlueprintLibrary_C_Update::Data' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Update, __WorldContext) == 0x000020, "Member 'PhysicalBehavior_BlueprintLibrary_C_Update::__WorldContext' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Update, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'PhysicalBehavior_BlueprintLibrary_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicalBehavior_BlueprintLibrary_C_Update, K2Node_SetFieldsInStruct_StructOut) == 0x000030, "Member 'PhysicalBehavior_BlueprintLibrary_C_Update::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

