#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RowData

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct RowData.RowData
// 0x0040 (0x0040 - 0x0000)
struct FRowData final
{
public:
	class FText                                   ColumnTitle_7_3FB3743A41BA8692C18627AE233D34B9;    // 0x0000(0x0018)(Edit, BlueprintVisible)
	double                                        ColumnFill_6_7CC354A34707AFF70D0127B4D65F093E;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          HorizontalAlignment_10_07AD4DDF4FB675EBE2AB48BB6DDAE8B1; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding_14_173B92BD48DBE374087C10B18D5201D8;       // 0x0024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   TitleId_17_96EC09E04D13D4DF57A90F965B87F933;       // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FRowData) == 0x000008, "Wrong alignment on FRowData");
static_assert(sizeof(FRowData) == 0x000040, "Wrong size on FRowData");
static_assert(offsetof(FRowData, ColumnTitle_7_3FB3743A41BA8692C18627AE233D34B9) == 0x000000, "Member 'FRowData::ColumnTitle_7_3FB3743A41BA8692C18627AE233D34B9' has a wrong offset!");
static_assert(offsetof(FRowData, ColumnFill_6_7CC354A34707AFF70D0127B4D65F093E) == 0x000018, "Member 'FRowData::ColumnFill_6_7CC354A34707AFF70D0127B4D65F093E' has a wrong offset!");
static_assert(offsetof(FRowData, HorizontalAlignment_10_07AD4DDF4FB675EBE2AB48BB6DDAE8B1) == 0x000020, "Member 'FRowData::HorizontalAlignment_10_07AD4DDF4FB675EBE2AB48BB6DDAE8B1' has a wrong offset!");
static_assert(offsetof(FRowData, Padding_14_173B92BD48DBE374087C10B18D5201D8) == 0x000024, "Member 'FRowData::Padding_14_173B92BD48DBE374087C10B18D5201D8' has a wrong offset!");
static_assert(offsetof(FRowData, TitleId_17_96EC09E04D13D4DF57A90F965B87F933) == 0x000034, "Member 'FRowData::TitleId_17_96EC09E04D13D4DF57A90F965B87F933' has a wrong offset!");

}

