#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingRowHeader

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SettingRowHeader.SettingRowHeader_C.ExecuteUbergraph_SettingRowHeader
// 0x0038 (0x0038 - 0x0000)
struct SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           K2Node_DynamicCast_AsVertical_Box;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader) == 0x000008, "Wrong alignment on SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader");
static_assert(sizeof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader) == 0x000038, "Wrong size on SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, EntryPoint) == 0x000000, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, Temp_bool_Variable) == 0x000005, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, Temp_byte_Variable) == 0x000006, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, Temp_byte_Variable_1) == 0x000007, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, CallFunc_TextIsEmpty_ReturnValue) == 0x000008, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, CallFunc_GetParent_ReturnValue) == 0x000010, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, K2Node_DynamicCast_AsVertical_Box) == 0x000018, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::K2Node_DynamicCast_AsVertical_Box' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, CallFunc_GetChildIndex_ReturnValue) == 0x000024, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, CallFunc_Percent_IntInt_ReturnValue) == 0x000028, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, K2Node_Select_Default) == 0x00002D, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x000030, "Member 'SettingRowHeader_C_ExecuteUbergraph_SettingRowHeader::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");

// Function SettingRowHeader.SettingRowHeader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SettingRowHeader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingRowHeader_C_PreConstruct) == 0x000001, "Wrong alignment on SettingRowHeader_C_PreConstruct");
static_assert(sizeof(SettingRowHeader_C_PreConstruct) == 0x000001, "Wrong size on SettingRowHeader_C_PreConstruct");
static_assert(offsetof(SettingRowHeader_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SettingRowHeader_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

