#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsUI.SettingsUI_C
// 0x0098 (0x0358 - 0x02C0)
class USettingsUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioSettingsPage_C*                   AudioSettingsPage;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CategoryInfoWarningSwitcher;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CategorySwitcher;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameplaySettingsPage_C*                GameplaySettingsPage;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalRadioSelect_C*               HorizontalRadioSelect;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_186;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputActionUI;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputActionUI_1;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputSettingsPage_C*                   InputSettingsPage;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SettingExplainerText;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVideoSettingsPage_C*                   VideoSettingsPage;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Credits_MakeaGames_C*              WBP_Credits_MakeaGames;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             CloseRequested;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVideoSettingsPage_C*                   Target;                                            // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          RowHovered;                                        // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USettingRow_C*                          CurrentHoveredWidget;                              // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CategoryIndex;                                     // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindPage(class USettingPage_C* SettingPage);
	void CategoryChanged(const class FString& Value);
	void CloseRequested__DelegateSignature();
	void CloseSettings();
	void Construct();
	void ExecuteUbergraph_SettingsUI(int32 EntryPoint);
	void FocusToDefaultWidget();
	void FocusToWidget(class UWidget* Widget);
	void OpenNextCategory();
	void OpenPrevCategory();
	void OpenSettings();
	void SetScrollBoxAutoScroll(bool Value);
	void SettingRowHovered(class USettingRow_C* RowWidget);
	void SettingRowUnhovered(class USettingRow_C* RowWidget);
	void Setup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsUI_C">();
	}
	static class USettingsUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsUI_C>();
	}
};
static_assert(alignof(USettingsUI_C) == 0x000008, "Wrong alignment on USettingsUI_C");
static_assert(sizeof(USettingsUI_C) == 0x000358, "Wrong size on USettingsUI_C");
static_assert(offsetof(USettingsUI_C, UberGraphFrame) == 0x0002C0, "Member 'USettingsUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, AudioSettingsPage) == 0x0002C8, "Member 'USettingsUI_C::AudioSettingsPage' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, CategoryInfoWarningSwitcher) == 0x0002D0, "Member 'USettingsUI_C::CategoryInfoWarningSwitcher' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, CategorySwitcher) == 0x0002D8, "Member 'USettingsUI_C::CategorySwitcher' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, GameplaySettingsPage) == 0x0002E0, "Member 'USettingsUI_C::GameplaySettingsPage' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, HorizontalRadioSelect) == 0x0002E8, "Member 'USettingsUI_C::HorizontalRadioSelect' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, Image_186) == 0x0002F0, "Member 'USettingsUI_C::Image_186' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, InputActionUI) == 0x0002F8, "Member 'USettingsUI_C::InputActionUI' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, InputActionUI_1) == 0x000300, "Member 'USettingsUI_C::InputActionUI_1' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, InputSettingsPage) == 0x000308, "Member 'USettingsUI_C::InputSettingsPage' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, SettingExplainerText) == 0x000310, "Member 'USettingsUI_C::SettingExplainerText' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, VideoSettingsPage) == 0x000318, "Member 'USettingsUI_C::VideoSettingsPage' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, WBP_Credits_MakeaGames) == 0x000320, "Member 'USettingsUI_C::WBP_Credits_MakeaGames' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, CloseRequested) == 0x000328, "Member 'USettingsUI_C::CloseRequested' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, Target) == 0x000338, "Member 'USettingsUI_C::Target' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, RowHovered) == 0x000340, "Member 'USettingsUI_C::RowHovered' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, CurrentHoveredWidget) == 0x000348, "Member 'USettingsUI_C::CurrentHoveredWidget' has a wrong offset!");
static_assert(offsetof(USettingsUI_C, CategoryIndex) == 0x000350, "Member 'USettingsUI_C::CategoryIndex' has a wrong offset!");

}

