#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingPage

#include "Basic.hpp"


namespace SDK::Params
{

// Function SettingPage.SettingPage_C.BindRowWidget
// 0x0028 (0x0028 - 0x0000)
struct SettingPage_C_BindRowWidget final
{
public:
	class USettingRow_C*                          RowWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USettingRow_C* RowWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USettingRow_C* RowWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPage_C_BindRowWidget) == 0x000008, "Wrong alignment on SettingPage_C_BindRowWidget");
static_assert(sizeof(SettingPage_C_BindRowWidget) == 0x000028, "Wrong size on SettingPage_C_BindRowWidget");
static_assert(offsetof(SettingPage_C_BindRowWidget, RowWidget) == 0x000000, "Member 'SettingPage_C_BindRowWidget::RowWidget' has a wrong offset!");
static_assert(offsetof(SettingPage_C_BindRowWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'SettingPage_C_BindRowWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingPage_C_BindRowWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'SettingPage_C_BindRowWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function SettingPage.SettingPage_C.OnRowHovered
// 0x0008 (0x0008 - 0x0000)
struct SettingPage_C_OnRowHovered final
{
public:
	class USettingRow_C*                          RowWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPage_C_OnRowHovered) == 0x000008, "Wrong alignment on SettingPage_C_OnRowHovered");
static_assert(sizeof(SettingPage_C_OnRowHovered) == 0x000008, "Wrong size on SettingPage_C_OnRowHovered");
static_assert(offsetof(SettingPage_C_OnRowHovered, RowWidget) == 0x000000, "Member 'SettingPage_C_OnRowHovered::RowWidget' has a wrong offset!");

// Function SettingPage.SettingPage_C.OnRowUnhovered
// 0x0008 (0x0008 - 0x0000)
struct SettingPage_C_OnRowUnhovered final
{
public:
	class USettingRow_C*                          RowWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPage_C_OnRowUnhovered) == 0x000008, "Wrong alignment on SettingPage_C_OnRowUnhovered");
static_assert(sizeof(SettingPage_C_OnRowUnhovered) == 0x000008, "Wrong size on SettingPage_C_OnRowUnhovered");
static_assert(offsetof(SettingPage_C_OnRowUnhovered, RowWidget) == 0x000000, "Member 'SettingPage_C_OnRowUnhovered::RowWidget' has a wrong offset!");

// Function SettingPage.SettingPage_C.OnSettingRowHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingPage_C_OnSettingRowHovered__DelegateSignature final
{
public:
	class USettingRow_C*                          RowWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPage_C_OnSettingRowHovered__DelegateSignature) == 0x000008, "Wrong alignment on SettingPage_C_OnSettingRowHovered__DelegateSignature");
static_assert(sizeof(SettingPage_C_OnSettingRowHovered__DelegateSignature) == 0x000008, "Wrong size on SettingPage_C_OnSettingRowHovered__DelegateSignature");
static_assert(offsetof(SettingPage_C_OnSettingRowHovered__DelegateSignature, RowWidget) == 0x000000, "Member 'SettingPage_C_OnSettingRowHovered__DelegateSignature::RowWidget' has a wrong offset!");

// Function SettingPage.SettingPage_C.OnSettingRowUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingPage_C_OnSettingRowUnhovered__DelegateSignature final
{
public:
	class USettingRow_C*                          RowWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPage_C_OnSettingRowUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on SettingPage_C_OnSettingRowUnhovered__DelegateSignature");
static_assert(sizeof(SettingPage_C_OnSettingRowUnhovered__DelegateSignature) == 0x000008, "Wrong size on SettingPage_C_OnSettingRowUnhovered__DelegateSignature");
static_assert(offsetof(SettingPage_C_OnSettingRowUnhovered__DelegateSignature, RowWidget) == 0x000000, "Member 'SettingPage_C_OnSettingRowUnhovered__DelegateSignature::RowWidget' has a wrong offset!");

}

