#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StyledSpinnerSetting

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function StyledSpinnerSetting.StyledSpinnerSetting_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct StyledSpinnerSetting_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UStyledSpinner_C*                       K2Node_DynamicCast_AsStyled_Spinner;               // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StyledSpinnerSetting_C_OnFocusReceived) == 0x000008, "Wrong alignment on StyledSpinnerSetting_C_OnFocusReceived");
static_assert(sizeof(StyledSpinnerSetting_C_OnFocusReceived) == 0x0001C0, "Wrong size on StyledSpinnerSetting_C_OnFocusReceived");
static_assert(offsetof(StyledSpinnerSetting_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'StyledSpinnerSetting_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(StyledSpinnerSetting_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'StyledSpinnerSetting_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(StyledSpinnerSetting_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'StyledSpinnerSetting_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSpinnerSetting_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'StyledSpinnerSetting_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSpinnerSetting_C_OnFocusReceived, K2Node_DynamicCast_AsStyled_Spinner) == 0x0001B0, "Member 'StyledSpinnerSetting_C_OnFocusReceived::K2Node_DynamicCast_AsStyled_Spinner' has a wrong offset!");
static_assert(offsetof(StyledSpinnerSetting_C_OnFocusReceived, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'StyledSpinnerSetting_C_OnFocusReceived::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

