#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StyledCategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AutoSettings_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StyledCategoryButton.StyledCategoryButton_C
// 0x0048 (0x0348 - 0x0300)
class UStyledCategoryButton_C final : public URadioButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PushAnim;                                          // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonObject;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Spinner;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__StyledCategoryButton_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__StyledCategoryButton_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__StyledCategoryButton_ButtonObject_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_StyledCategoryButton(int32 EntryPoint);
	struct FSlateColor GetColour();
	void UpdateSelected(bool InSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StyledCategoryButton_C">();
	}
	static class UStyledCategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyledCategoryButton_C>();
	}
};
static_assert(alignof(UStyledCategoryButton_C) == 0x000008, "Wrong alignment on UStyledCategoryButton_C");
static_assert(sizeof(UStyledCategoryButton_C) == 0x000348, "Wrong size on UStyledCategoryButton_C");
static_assert(offsetof(UStyledCategoryButton_C, UberGraphFrame) == 0x000300, "Member 'UStyledCategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStyledCategoryButton_C, PushAnim) == 0x000308, "Member 'UStyledCategoryButton_C::PushAnim' has a wrong offset!");
static_assert(offsetof(UStyledCategoryButton_C, HoverAnim) == 0x000310, "Member 'UStyledCategoryButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UStyledCategoryButton_C, Background) == 0x000318, "Member 'UStyledCategoryButton_C::Background' has a wrong offset!");
static_assert(offsetof(UStyledCategoryButton_C, ButtonObject) == 0x000320, "Member 'UStyledCategoryButton_C::ButtonObject' has a wrong offset!");
static_assert(offsetof(UStyledCategoryButton_C, ContentBorder) == 0x000328, "Member 'UStyledCategoryButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UStyledCategoryButton_C, HoverBorder) == 0x000330, "Member 'UStyledCategoryButton_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UStyledCategoryButton_C, Spinner) == 0x000338, "Member 'UStyledCategoryButton_C::Spinner' has a wrong offset!");
static_assert(offsetof(UStyledCategoryButton_C, Text) == 0x000340, "Member 'UStyledCategoryButton_C::Text' has a wrong offset!");

}

