#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StyledSliderSetting

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function StyledSliderSetting.StyledSliderSetting_C.ExecuteUbergraph_StyledSliderSetting
// 0x00D0 (0x00D0 - 0x0000)
struct StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText& Text, ETextCommit CommitMethod)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NormalizedValue;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RawValue;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0028(0x0018)()
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0040(0x0018)(ConstParm)
	ETextCommit                                   K2Node_CustomEvent_CommitMethod;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampRawValue_ReturnValue;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_RawValueToNormalized_ReturnValue;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampRawValue_RawValue_ImplicitCast;      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting) == 0x000008, "Wrong alignment on StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting");
static_assert(sizeof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting) == 0x0000D0, "Wrong size on StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, EntryPoint) == 0x000000, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, K2Node_Event_NormalizedValue) == 0x000014, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::K2Node_Event_NormalizedValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, K2Node_Event_RawValue) == 0x000018, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::K2Node_Event_RawValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000028, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, K2Node_CustomEvent_Text) == 0x000040, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, K2Node_CustomEvent_CommitMethod) == 0x000058, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::K2Node_CustomEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Replace_ReturnValue) == 0x000070, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_IsNumeric_ReturnValue) == 0x000080, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000088, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000090, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_ClampRawValue_ReturnValue) == 0x000098, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_ClampRawValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000A0, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_RawValueToNormalized_ReturnValue) == 0x0000B0, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_RawValueToNormalized_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000B8, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_ClampRawValue_RawValue_ImplicitCast) == 0x0000C0, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_ClampRawValue_RawValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x0000C8, "Member 'StyledSliderSetting_C_ExecuteUbergraph_StyledSliderSetting::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");

// Function StyledSliderSetting.StyledSliderSetting_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct StyledSliderSetting_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(StyledSliderSetting_C_OnFocusReceived) == 0x000008, "Wrong alignment on StyledSliderSetting_C_OnFocusReceived");
static_assert(sizeof(StyledSliderSetting_C_OnFocusReceived) == 0x0001B0, "Wrong size on StyledSliderSetting_C_OnFocusReceived");
static_assert(offsetof(StyledSliderSetting_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'StyledSliderSetting_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'StyledSliderSetting_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'StyledSliderSetting_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'StyledSliderSetting_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function StyledSliderSetting.StyledSliderSetting_C.OnPreviewKeyDown
// 0x0310 (0x0310 - 0x0000)
struct StyledSliderSetting_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0238(0x00B8)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_1;          // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StyledSliderSetting_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on StyledSliderSetting_C_OnPreviewKeyDown");
static_assert(sizeof(StyledSliderSetting_C_OnPreviewKeyDown) == 0x000310, "Wrong size on StyledSliderSetting_C_OnPreviewKeyDown");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, ReturnValue) == 0x000078, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000148, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000150, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000158, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x000159, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_BooleanOR_ReturnValue) == 0x00015A, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_GetValue_ReturnValue) == 0x00015C, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000160, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000168, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_FClamp_ReturnValue) == 0x000170, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_FClamp_ReturnValue_1) == 0x000178, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000238, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0002F0, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0002F8, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000300, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_SetValue_InValue_ImplicitCast) == 0x000308, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewKeyDown, CallFunc_SetValue_InValue_ImplicitCast_1) == 0x00030C, "Member 'StyledSliderSetting_C_OnPreviewKeyDown::CallFunc_SetValue_InValue_ImplicitCast_1' has a wrong offset!");

// Function StyledSliderSetting.StyledSliderSetting_C.OnPreviewMouseButtonDown
// 0x0300 (0x0300 - 0x0000)
struct StyledSliderSetting_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0170(0x0018)(HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B[0x5];                                      // 0x018B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0190(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0248(0x00B8)()
};
static_assert(alignof(StyledSliderSetting_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on StyledSliderSetting_C_OnPreviewMouseButtonDown");
static_assert(sizeof(StyledSliderSetting_C_OnPreviewMouseButtonDown) == 0x000300, "Wrong size on StyledSliderSetting_C_OnPreviewMouseButtonDown");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000168, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000170, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, CallFunc_GetCurrentInputType_ReturnValue) == 0x000188, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000189, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, K2Node_SwitchEnum_CmpSuccess) == 0x00018A, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000190, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000248, "Member 'StyledSliderSetting_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function StyledSliderSetting.StyledSliderSetting_C.OnSliderValueUpdated
// 0x0008 (0x0008 - 0x0000)
struct StyledSliderSetting_C_OnSliderValueUpdated final
{
public:
	float                                         NormalizedValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RawValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StyledSliderSetting_C_OnSliderValueUpdated) == 0x000004, "Wrong alignment on StyledSliderSetting_C_OnSliderValueUpdated");
static_assert(sizeof(StyledSliderSetting_C_OnSliderValueUpdated) == 0x000008, "Wrong size on StyledSliderSetting_C_OnSliderValueUpdated");
static_assert(offsetof(StyledSliderSetting_C_OnSliderValueUpdated, NormalizedValue) == 0x000000, "Member 'StyledSliderSetting_C_OnSliderValueUpdated::NormalizedValue' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_OnSliderValueUpdated, RawValue) == 0x000004, "Member 'StyledSliderSetting_C_OnSliderValueUpdated::RawValue' has a wrong offset!");

// Function StyledSliderSetting.StyledSliderSetting_C.TextCommitted
// 0x0020 (0x0020 - 0x0000)
struct StyledSliderSetting_C_TextCommitted final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StyledSliderSetting_C_TextCommitted) == 0x000008, "Wrong alignment on StyledSliderSetting_C_TextCommitted");
static_assert(sizeof(StyledSliderSetting_C_TextCommitted) == 0x000020, "Wrong size on StyledSliderSetting_C_TextCommitted");
static_assert(offsetof(StyledSliderSetting_C_TextCommitted, Text) == 0x000000, "Member 'StyledSliderSetting_C_TextCommitted::Text' has a wrong offset!");
static_assert(offsetof(StyledSliderSetting_C_TextCommitted, CommitMethod) == 0x000018, "Member 'StyledSliderSetting_C_TextCommitted::CommitMethod' has a wrong offset!");

}

