#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StyledSpinner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AutoSettings_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StyledSpinner.StyledSpinner_C
// 0x0030 (0x0320 - 0x02F0)
class UStyledSpinner_C final : public USpinner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             LabelTextBlock;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftArrow;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LeftButton;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightArrow;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RightButton;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__LeftButton_K2Node_ComponentBoundEvent_178_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__RightButton_K2Node_ComponentBoundEvent_196_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_StyledSpinner(int32 EntryPoint);
	class FText GetLabelText();
	struct FLinearColor GetLeftArrowColorAndOpacity();
	struct FLinearColor GetRightArrowColorAndOpacity();
	void OnSelectionChanged(const struct FSettingOption& SelectedOption);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StyledSpinner_C">();
	}
	static class UStyledSpinner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyledSpinner_C>();
	}
};
static_assert(alignof(UStyledSpinner_C) == 0x000008, "Wrong alignment on UStyledSpinner_C");
static_assert(sizeof(UStyledSpinner_C) == 0x000320, "Wrong size on UStyledSpinner_C");
static_assert(offsetof(UStyledSpinner_C, UberGraphFrame) == 0x0002F0, "Member 'UStyledSpinner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStyledSpinner_C, LabelTextBlock) == 0x0002F8, "Member 'UStyledSpinner_C::LabelTextBlock' has a wrong offset!");
static_assert(offsetof(UStyledSpinner_C, LeftArrow) == 0x000300, "Member 'UStyledSpinner_C::LeftArrow' has a wrong offset!");
static_assert(offsetof(UStyledSpinner_C, LeftButton) == 0x000308, "Member 'UStyledSpinner_C::LeftButton' has a wrong offset!");
static_assert(offsetof(UStyledSpinner_C, RightArrow) == 0x000310, "Member 'UStyledSpinner_C::RightArrow' has a wrong offset!");
static_assert(offsetof(UStyledSpinner_C, RightButton) == 0x000318, "Member 'UStyledSpinner_C::RightButton' has a wrong offset!");

}

