#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StyledKeyLabel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AutoSettingsInput_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StyledKeyLabel.StyledKeyLabel_C
// 0x0018 (0x0348 - 0x0330)
class UStyledKeyLabel_C final : public UKeyLabel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconImage;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StyledKeyLabel(int32 EntryPoint);
	class FText GetDisplayNameUpper();
	void UpdateKeyLabel();

	struct FSlateBrush GetIconBrush() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StyledKeyLabel_C">();
	}
	static class UStyledKeyLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyledKeyLabel_C>();
	}
};
static_assert(alignof(UStyledKeyLabel_C) == 0x000008, "Wrong alignment on UStyledKeyLabel_C");
static_assert(sizeof(UStyledKeyLabel_C) == 0x000348, "Wrong size on UStyledKeyLabel_C");
static_assert(offsetof(UStyledKeyLabel_C, UberGraphFrame) == 0x000330, "Member 'UStyledKeyLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStyledKeyLabel_C, IconImage) == 0x000338, "Member 'UStyledKeyLabel_C::IconImage' has a wrong offset!");
static_assert(offsetof(UStyledKeyLabel_C, LabelText) == 0x000340, "Member 'UStyledKeyLabel_C::LabelText' has a wrong offset!");

}

