#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StyledKeyLabel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function StyledKeyLabel.StyledKeyLabel_C.ExecuteUbergraph_StyledKeyLabel
// 0x0320 (0x0320 - 0x0000)
struct StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasIcon_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayNameUpper_ReturnValue;          // 0x0008(0x0018)()
	struct FSlateBrush                            CallFunc_GetIconBrush_ReturnValue;                 // 0x0020(0x00D0)()
	struct FSlateBrush                            K2Node_SetFieldsInStruct_StructOut;                // 0x00F0(0x00D0)()
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetIconVisibility_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetDisplayNameVisibility_ReturnValue;     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0xF];                                      // 0x0221(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0230(0x00D0)()
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast;         // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0310(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel) == 0x000010, "Wrong alignment on StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel");
static_assert(sizeof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel) == 0x000320, "Wrong size on StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, EntryPoint) == 0x000000, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::EntryPoint' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_HasIcon_ReturnValue) == 0x000004, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_HasIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_GetDisplayNameUpper_ReturnValue) == 0x000008, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_GetDisplayNameUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_GetIconBrush_ReturnValue) == 0x000020, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_GetIconBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, K2Node_SetFieldsInStruct_StructOut) == 0x0000F0, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, K2Node_DynamicCast_AsTexture_2D) == 0x0001C0, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_BreakVector2D_X) == 0x0001D0, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_BreakVector2D_Y) == 0x0001D8, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x0001E0, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x0001E4, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0001E8, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0001F0, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_GetIconVisibility_ReturnValue) == 0x0001F8, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_GetIconVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000200, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000208, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_MakeVector2D_ReturnValue) == 0x000210, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_GetDisplayNameVisibility_ReturnValue) == 0x000220, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_GetDisplayNameVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, K2Node_MakeStruct_SlateBrush) == 0x000230, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, CallFunc_BreakVector2D_InVec_ImplicitCast) == 0x000300, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::CallFunc_BreakVector2D_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x000310, "Member 'StyledKeyLabel_C_ExecuteUbergraph_StyledKeyLabel::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");

// Function StyledKeyLabel.StyledKeyLabel_C.GetDisplayNameUpper
// 0x0068 (0x0068 - 0x0000)
struct StyledKeyLabel_C_GetDisplayNameUpper final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToUpper_ReturnValue;                      // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
};
static_assert(alignof(StyledKeyLabel_C_GetDisplayNameUpper) == 0x000008, "Wrong alignment on StyledKeyLabel_C_GetDisplayNameUpper");
static_assert(sizeof(StyledKeyLabel_C_GetDisplayNameUpper) == 0x000068, "Wrong size on StyledKeyLabel_C_GetDisplayNameUpper");
static_assert(offsetof(StyledKeyLabel_C_GetDisplayNameUpper, ReturnValue) == 0x000000, "Member 'StyledKeyLabel_C_GetDisplayNameUpper::ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_GetDisplayNameUpper, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'StyledKeyLabel_C_GetDisplayNameUpper::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_GetDisplayNameUpper, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'StyledKeyLabel_C_GetDisplayNameUpper::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_GetDisplayNameUpper, CallFunc_ToUpper_ReturnValue) == 0x000040, "Member 'StyledKeyLabel_C_GetDisplayNameUpper::CallFunc_ToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_GetDisplayNameUpper, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'StyledKeyLabel_C_GetDisplayNameUpper::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function StyledKeyLabel.StyledKeyLabel_C.GetIconBrush
// 0x01B0 (0x01B0 - 0x0000)
struct StyledKeyLabel_C_GetIconBrush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
	class UTexture*                               CallFunc_GetIcon_ReturnValue;                      // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00E0(0x00D0)()
};
static_assert(alignof(StyledKeyLabel_C_GetIconBrush) == 0x000010, "Wrong alignment on StyledKeyLabel_C_GetIconBrush");
static_assert(sizeof(StyledKeyLabel_C_GetIconBrush) == 0x0001B0, "Wrong size on StyledKeyLabel_C_GetIconBrush");
static_assert(offsetof(StyledKeyLabel_C_GetIconBrush, ReturnValue) == 0x000000, "Member 'StyledKeyLabel_C_GetIconBrush::ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_GetIconBrush, CallFunc_GetIcon_ReturnValue) == 0x0000D0, "Member 'StyledKeyLabel_C_GetIconBrush::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(StyledKeyLabel_C_GetIconBrush, K2Node_MakeStruct_SlateBrush) == 0x0000E0, "Member 'StyledKeyLabel_C_GetIconBrush::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

