#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SUPERMOVES_3PP_AnimBP_FINAL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SUPERMOVES_3PP_AnimBP_FINAL.SUPERMOVES_3PP_AnimBP_FINAL_C.AnimBlueprintGeneratedConstantData
// 0x03B7 (0x03B8 - 0x0001)
struct SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2232;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2233;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2234;                               // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2235;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2236;                              // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2237;                               // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2238;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2239;                               // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2240;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2241;                               // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2242;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2243;                               // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2244;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2245;                               // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2246;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2247;                               // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2248;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2249;                               // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2250;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2251;                               // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2252;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2253;                              // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2254;                               // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2255;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2256;                               // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2257;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2258;                              // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2259;                               // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2260;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2261;                               // 0x00BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2262;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2263;                               // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2264;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2265;                              // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2266;                               // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2267;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2268;                               // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2269;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2270;                               // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2271;                                // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2272;                               // 0x00FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2273;                                // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2274;                               // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2275;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2276;                              // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2277;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2278;                                // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2279;                              // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2280;                               // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2281;                                // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2282;                               // 0x0144(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2283;                                // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2284;                               // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2285;                                // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2286;                              // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2287;                              // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2288;                               // 0x0164(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2289;                                // 0x016C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2290;                              // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2291;                               // 0x0174(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2292;                                // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2293;                               // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2294;                               // 0x0188(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2295;                               // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2296;                                // 0x0198(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2297;                               // 0x019C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2298;                               // 0x01A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2299;                               // 0x01AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2300;                               // 0x01B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2301;                                // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2302;                               // 0x01C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2303;                                // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2304;                               // 0x01CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2305;                                // 0x01D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2306;                               // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2307;                                // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2308;                               // 0x01E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2309;                                // 0x01EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2310;                               // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2311;                                // 0x01F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2312;                               // 0x01FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2313;                                // 0x0204(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2314;                               // 0x0208(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2315;                                // 0x0210(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2316;                               // 0x0214(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2317;                                // 0x021C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2318;                              // 0x0220(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2319;                               // 0x0224(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2320;                               // 0x022C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2321;                              // 0x0238(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2322;                               // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2323;                                // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2324;                               // 0x0254(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2325;                                // 0x025C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_2326;                             // 0x0260(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_2327;                              // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2328;                              // 0x0290(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2329;                              // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2330;                               // 0x0298(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2331;                               // 0x0299(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_2332;                               // 0x029A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B[0x5];                                      // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_2333;                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_2334;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_2335;                               // 0x02B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_2336;                               // 0x02B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_2337;                               // 0x02B2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2338;                              // 0x02B8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2339;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2340;                                // 0x02D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2341;                               // 0x02D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2342;                               // 0x02DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_2343;                             // 0x02E8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0308(0x0080)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0388(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x03A0(0x0018)()
};
static_assert(alignof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData) == 0x0003B8, "Wrong size on SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2232) == 0x000004, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2232' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2233) == 0x00000C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2233' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2234) == 0x000010, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2234' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2235) == 0x000018, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2235' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2236) == 0x00001C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2236' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2237) == 0x000020, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2237' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2238) == 0x000028, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2238' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2239) == 0x00002C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2239' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2240) == 0x000034, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2240' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2241) == 0x000038, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2241' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2242) == 0x000040, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2242' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2243) == 0x000044, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2243' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2244) == 0x00004C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2244' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2245) == 0x000050, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2245' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2246) == 0x000058, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2246' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2247) == 0x00005C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2247' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2248) == 0x000064, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2248' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2249) == 0x000068, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2249' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2250) == 0x000070, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2250' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2251) == 0x000074, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2251' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2252) == 0x00007C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2252' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2253) == 0x000080, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2253' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2254) == 0x000084, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2254' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2255) == 0x00008C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2255' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2256) == 0x000090, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2256' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2257) == 0x000098, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2257' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2258) == 0x0000A0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2258' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2259) == 0x0000B0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2259' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2260) == 0x0000B8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2260' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2261) == 0x0000BC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2261' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2262) == 0x0000C4, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2262' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2263) == 0x0000C8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2263' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2264) == 0x0000D0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2264' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2265) == 0x0000D4, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2265' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2266) == 0x0000D8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2266' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2267) == 0x0000E0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2267' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2268) == 0x0000E4, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2268' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2269) == 0x0000EC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2269' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2270) == 0x0000F0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2270' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2271) == 0x0000F8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2271' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2272) == 0x0000FC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2272' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2273) == 0x000104, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2273' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2274) == 0x000108, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2274' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2275) == 0x000110, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2275' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2276) == 0x000118, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2276' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2277) == 0x000128, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2277' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2278) == 0x000130, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2278' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2279) == 0x000134, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2279' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2280) == 0x000138, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2280' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2281) == 0x000140, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2281' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2282) == 0x000144, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2282' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2283) == 0x00014C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2283' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2284) == 0x000150, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2284' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2285) == 0x000158, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2285' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2286) == 0x00015C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2286' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2287) == 0x000160, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2287' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2288) == 0x000164, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2288' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2289) == 0x00016C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2289' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2290) == 0x000170, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2290' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2291) == 0x000174, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2291' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2292) == 0x00017C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2292' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2293) == 0x000180, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2293' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2294) == 0x000188, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2294' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2295) == 0x000190, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2295' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2296) == 0x000198, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2296' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2297) == 0x00019C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2297' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2298) == 0x0001A4, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2298' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2299) == 0x0001AC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2299' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2300) == 0x0001B4, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2300' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2301) == 0x0001BC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2301' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2302) == 0x0001C0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2302' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2303) == 0x0001C8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2303' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2304) == 0x0001CC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2304' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2305) == 0x0001D4, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2305' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2306) == 0x0001D8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2306' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2307) == 0x0001E0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2307' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2308) == 0x0001E4, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2308' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2309) == 0x0001EC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2309' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2310) == 0x0001F0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2310' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2311) == 0x0001F8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2311' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2312) == 0x0001FC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2312' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2313) == 0x000204, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2313' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2314) == 0x000208, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2314' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2315) == 0x000210, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2315' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2316) == 0x000214, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2316' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2317) == 0x00021C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2317' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2318) == 0x000220, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2318' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2319) == 0x000224, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2319' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2320) == 0x00022C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2320' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2321) == 0x000238, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2321' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2322) == 0x000248, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2322' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2323) == 0x000250, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2323' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2324) == 0x000254, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2324' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2325) == 0x00025C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2325' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __StructProperty_2326) == 0x000260, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__StructProperty_2326' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2327) == 0x00028C, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2327' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2328) == 0x000290, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2328' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __FloatProperty_2329) == 0x000294, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__FloatProperty_2329' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __BoolProperty_2330) == 0x000298, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__BoolProperty_2330' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __EnumProperty_2331) == 0x000299, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__EnumProperty_2331' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __ByteProperty_2332) == 0x00029A, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__ByteProperty_2332' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __BlendProfile_2333) == 0x0002A0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__BlendProfile_2333' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __CurveFloat_2334) == 0x0002A8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__CurveFloat_2334' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __BoolProperty_2335) == 0x0002B0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__BoolProperty_2335' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __EnumProperty_2336) == 0x0002B1, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__EnumProperty_2336' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __EnumProperty_2337) == 0x0002B2, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__EnumProperty_2337' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2338) == 0x0002B8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2338' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2339) == 0x0002C8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2339' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __IntProperty_2340) == 0x0002D0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__IntProperty_2340' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2341) == 0x0002D4, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2341' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __NameProperty_2342) == 0x0002DC, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__NameProperty_2342' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, __StructProperty_2343) == 0x0002E8, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::__StructProperty_2343' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000308, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000388, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0003A0, "Member 'SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SUPERMOVES_3PP_AnimBP_FINAL.SUPERMOVES_3PP_AnimBP_FINAL_C.AnimBlueprintGeneratedMutableData
// 0x008B (0x008C - 0x0001)
struct SUPERMOVES_3PP_AnimBP_FINAL::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_8;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_11;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_20;                                  // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_21;                                  // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_25;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_29;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
