#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskList_WBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TaskList_WBP.TaskList_WBP_C
// 0x0030 (0x0370 - 0x0340)
class UTaskList_WBP_C final : public UGymQuestWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           ObjectiveContainer;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestMessageWidgetBad;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestMessageWidgetGood;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGymObjectiveControl*                   Objective_Control;                                 // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGymQuest*                              LastActiveQuest;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Check_Active_Quest_Changed(bool* StateChanged);
	void Construct();
	void ExecuteUbergraph_TaskList_WBP(int32 EntryPoint);
	void ShowMessage(const class FText& Message, bool bGoodMessage);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskList_WBP_C">();
	}
	static class UTaskList_WBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskList_WBP_C>();
	}
};
static_assert(alignof(UTaskList_WBP_C) == 0x000008, "Wrong alignment on UTaskList_WBP_C");
static_assert(sizeof(UTaskList_WBP_C) == 0x000370, "Wrong size on UTaskList_WBP_C");
static_assert(offsetof(UTaskList_WBP_C, UberGraphFrame) == 0x000340, "Member 'UTaskList_WBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTaskList_WBP_C, ObjectiveContainer) == 0x000348, "Member 'UTaskList_WBP_C::ObjectiveContainer' has a wrong offset!");
static_assert(offsetof(UTaskList_WBP_C, QuestMessageWidgetBad) == 0x000350, "Member 'UTaskList_WBP_C::QuestMessageWidgetBad' has a wrong offset!");
static_assert(offsetof(UTaskList_WBP_C, QuestMessageWidgetGood) == 0x000358, "Member 'UTaskList_WBP_C::QuestMessageWidgetGood' has a wrong offset!");
static_assert(offsetof(UTaskList_WBP_C, Objective_Control) == 0x000360, "Member 'UTaskList_WBP_C::Objective_Control' has a wrong offset!");
static_assert(offsetof(UTaskList_WBP_C, LastActiveQuest) == 0x000368, "Member 'UTaskList_WBP_C::LastActiveQuest' has a wrong offset!");

}

