#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskList_WBP

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TaskList_WBP.TaskList_WBP_C.Check Active Quest Changed
// 0x0018 (0x0018 - 0x0000)
struct TaskList_WBP_C_Check_Active_Quest_Changed final
{
public:
	bool                                          StateChanged;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymQuest*                              CallFunc_GetActiveQuest_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskList_WBP_C_Check_Active_Quest_Changed) == 0x000008, "Wrong alignment on TaskList_WBP_C_Check_Active_Quest_Changed");
static_assert(sizeof(TaskList_WBP_C_Check_Active_Quest_Changed) == 0x000018, "Wrong size on TaskList_WBP_C_Check_Active_Quest_Changed");
static_assert(offsetof(TaskList_WBP_C_Check_Active_Quest_Changed, StateChanged) == 0x000000, "Member 'TaskList_WBP_C_Check_Active_Quest_Changed::StateChanged' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_Check_Active_Quest_Changed, CallFunc_GetActiveQuest_ReturnValue) == 0x000008, "Member 'TaskList_WBP_C_Check_Active_Quest_Changed::CallFunc_GetActiveQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_Check_Active_Quest_Changed, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'TaskList_WBP_C_Check_Active_Quest_Changed::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function TaskList_WBP.TaskList_WBP_C.ExecuteUbergraph_TaskList_WBP
// 0x00C8 (0x00C8 - 0x0000)
struct TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerState*                        K2Node_DynamicCast_AsGym_Player_State;             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Active_Quest_Changed_StateChanged;  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Message;                              // 0x0068(0x0018)(ConstParm)
	bool                                          K2Node_Event_bGoodMessage;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0088(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x00A8(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP) == 0x000008, "Wrong alignment on TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP");
static_assert(sizeof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP) == 0x0000C8, "Wrong size on TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, EntryPoint) == 0x000000, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, K2Node_Event_MyGeometry) == 0x000008, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, K2Node_Event_InDeltaTime) == 0x000040, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, K2Node_DynamicCast_AsGym_Player_State) == 0x000058, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::K2Node_DynamicCast_AsGym_Player_State' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_Check_Active_Quest_Changed_StateChanged) == 0x000061, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_Check_Active_Quest_Changed_StateChanged' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, K2Node_Event_Message) == 0x000068, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, K2Node_Event_bGoodMessage) == 0x000080, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::K2Node_Event_bGoodMessage' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_GetText_ReturnValue) == 0x000088, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_TextIsEmpty_ReturnValue) == 0x0000A0, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_GetText_ReturnValue_1) == 0x0000A8, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0000C0, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP, CallFunc_BooleanAND_ReturnValue) == 0x0000C1, "Member 'TaskList_WBP_C_ExecuteUbergraph_TaskList_WBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TaskList_WBP.TaskList_WBP_C.ShowMessage
// 0x0020 (0x0020 - 0x0000)
struct TaskList_WBP_C_ShowMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bGoodMessage;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskList_WBP_C_ShowMessage) == 0x000008, "Wrong alignment on TaskList_WBP_C_ShowMessage");
static_assert(sizeof(TaskList_WBP_C_ShowMessage) == 0x000020, "Wrong size on TaskList_WBP_C_ShowMessage");
static_assert(offsetof(TaskList_WBP_C_ShowMessage, Message) == 0x000000, "Member 'TaskList_WBP_C_ShowMessage::Message' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_ShowMessage, bGoodMessage) == 0x000018, "Member 'TaskList_WBP_C_ShowMessage::bGoodMessage' has a wrong offset!");

// Function TaskList_WBP.TaskList_WBP_C.Tick
// 0x003C (0x003C - 0x0000)
struct TaskList_WBP_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskList_WBP_C_Tick) == 0x000004, "Wrong alignment on TaskList_WBP_C_Tick");
static_assert(sizeof(TaskList_WBP_C_Tick) == 0x00003C, "Wrong size on TaskList_WBP_C_Tick");
static_assert(offsetof(TaskList_WBP_C_Tick, MyGeometry) == 0x000000, "Member 'TaskList_WBP_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_Tick, InDeltaTime) == 0x000038, "Member 'TaskList_WBP_C_Tick::InDeltaTime' has a wrong offset!");

// Function TaskList_WBP.TaskList_WBP_C.Update
// 0x0028 (0x0028 - 0x0000)
struct TaskList_WBP_C_Update final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymQuest*                              CallFunc_GetActiveQuest_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_WBP_C*                            CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskList_WBP_C_Update) == 0x000008, "Wrong alignment on TaskList_WBP_C_Update");
static_assert(sizeof(TaskList_WBP_C_Update) == 0x000028, "Wrong size on TaskList_WBP_C_Update");
static_assert(offsetof(TaskList_WBP_C_Update, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TaskList_WBP_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_Update, CallFunc_GetActiveQuest_ReturnValue) == 0x000008, "Member 'TaskList_WBP_C_Update::CallFunc_GetActiveQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_Update, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'TaskList_WBP_C_Update::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_Update, CallFunc_Create_ReturnValue) == 0x000018, "Member 'TaskList_WBP_C_Update::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskList_WBP_C_Update, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000020, "Member 'TaskList_WBP_C_Update::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

}

