#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_WBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Task_WBP.Task_WBP_C
// 0x0080 (0x0340 - 0x02C0)
class UTask_WBP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       DescriptionText;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MidImage;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObjective_WBP_C*                       Objective_WBP;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObjective_WBP_C*                       Objective_WBP_1;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ObjectiveList;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_6;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Timer;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TimerBox;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGymQuest*                              Quest;                                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Updated;                                           // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Task_WBP(int32 EntryPoint);
	ESlateVisibility GetTimerBoxVisibility();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update();
	void UpdateTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_WBP_C">();
	}
	static class UTask_WBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_WBP_C>();
	}
};
static_assert(alignof(UTask_WBP_C) == 0x000008, "Wrong alignment on UTask_WBP_C");
static_assert(sizeof(UTask_WBP_C) == 0x000340, "Wrong size on UTask_WBP_C");
static_assert(offsetof(UTask_WBP_C, UberGraphFrame) == 0x0002C0, "Member 'UTask_WBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, DescriptionText) == 0x0002C8, "Member 'UTask_WBP_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Image) == 0x0002D0, "Member 'UTask_WBP_C::Image' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Image_1) == 0x0002D8, "Member 'UTask_WBP_C::Image_1' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Image_64) == 0x0002E0, "Member 'UTask_WBP_C::Image_64' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Image_68) == 0x0002E8, "Member 'UTask_WBP_C::Image_68' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, MidImage) == 0x0002F0, "Member 'UTask_WBP_C::MidImage' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Objective_WBP) == 0x0002F8, "Member 'UTask_WBP_C::Objective_WBP' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Objective_WBP_1) == 0x000300, "Member 'UTask_WBP_C::Objective_WBP_1' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, ObjectiveList) == 0x000308, "Member 'UTask_WBP_C::ObjectiveList' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, ScaleBox_6) == 0x000310, "Member 'UTask_WBP_C::ScaleBox_6' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Timer) == 0x000318, "Member 'UTask_WBP_C::Timer' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, TimerBox) == 0x000320, "Member 'UTask_WBP_C::TimerBox' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Title) == 0x000328, "Member 'UTask_WBP_C::Title' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Quest) == 0x000330, "Member 'UTask_WBP_C::Quest' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Valid) == 0x000338, "Member 'UTask_WBP_C::Valid' has a wrong offset!");
static_assert(offsetof(UTask_WBP_C, Updated) == 0x000339, "Member 'UTask_WBP_C::Updated' has a wrong offset!");

}

