#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_PlayerOcclusion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Portal Direction Mask
// 0x0090 (0x0090 - 0x0000)
struct UDS_PlayerOcclusion_C_Portal_Direction_Mask final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Mask;                                              // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Portal_Direction_Mask) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Portal_Direction_Mask");
static_assert(sizeof(UDS_PlayerOcclusion_C_Portal_Direction_Mask) == 0x000090, "Wrong size on UDS_PlayerOcclusion_C_Portal_Direction_Mask");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, Direction) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::Direction' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, Mask) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::Mask' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_BreakVector_X) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_BreakVector_Y) == 0x000030, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_BreakVector_Z) == 0x000038, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_FClamp_ReturnValue_1) == 0x000050, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_FClamp_ReturnValue_2) == 0x000058, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, CallFunc_FClamp_ReturnValue_3) == 0x000068, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, K2Node_MakeStruct_LinearColor) == 0x000070, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, K2Node_MakeStruct_R_ImplicitCast) == 0x000080, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, K2Node_MakeStruct_G_ImplicitCast) == 0x000084, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, K2Node_MakeStruct_A_ImplicitCast) == 0x000088, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Portal_Direction_Mask, K2Node_MakeStruct_B_ImplicitCast) == 0x00008C, "Member 'UDS_PlayerOcclusion_C_Portal_Direction_Mask::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Delayed Startup
// 0x0030 (0x0030 - 0x0000)
struct UDS_PlayerOcclusion_C_Delayed_Startup final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTick_ReturnValue;       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualExactly_VectorVector_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Delayed_Startup) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Delayed_Startup");
static_assert(sizeof(UDS_PlayerOcclusion_C_Delayed_Startup) == 0x000030, "Wrong size on UDS_PlayerOcclusion_C_Delayed_Startup");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimerForNextTick_ReturnValue) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimerForNextTick_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_EqualExactly_VectorVector_ReturnValue) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_EqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimer_ReturnValue_2) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Check For Portal Components
// 0x0070 (0x0070 - 0x0000)
struct UDS_PlayerOcclusion_C_Check_For_Portal_Components final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<class UPrimitiveComponent*>            CallFunc_SphereOverlapComponents_OutComponents;    // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereOverlapComponents_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUDS_Occlusion_Portal_C*                K2Node_DynamicCast_AsUDS_Occlusion_Portal;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereOverlapComponents_SphereRadius_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Check_For_Portal_Components) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Check_For_Portal_Components");
static_assert(sizeof(UDS_PlayerOcclusion_C_Check_For_Portal_Components) == 0x000070, "Wrong size on UDS_PlayerOcclusion_C_Check_For_Portal_Components");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, Temp_object_Variable) == 0x000010, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, K2Node_MakeArray_Array) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_SphereOverlapComponents_OutComponents) == 0x000030, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_SphereOverlapComponents_OutComponents' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_SphereOverlapComponents_ReturnValue) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_SphereOverlapComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Array_Get_Item) == 0x000050, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, K2Node_DynamicCast_AsUDS_Occlusion_Portal) == 0x000058, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::K2Node_DynamicCast_AsUDS_Occlusion_Portal' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_SphereOverlapComponents_SphereRadius_ImplicitCast) == 0x000068, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_SphereOverlapComponents_SphereRadius_ImplicitCast' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Get Sample Location
// 0x0068 (0x0068 - 0x0000)
struct UDS_PlayerOcclusion_C_Get_Sample_Location final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Get_Sample_Location) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Get_Sample_Location");
static_assert(sizeof(UDS_PlayerOcclusion_C_Get_Sample_Location) == 0x000068, "Wrong size on UDS_PlayerOcclusion_C_Get_Sample_Location");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_GetCameraLocation_ReturnValue) == 0x000050, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Directional Mask Value
// 0x0050 (0x0050 - 0x0000)
struct UDS_PlayerOcclusion_C_Directional_Mask_Value final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Compare;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Directional_Mask_Value) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Directional_Mask_Value");
static_assert(sizeof(UDS_PlayerOcclusion_C_Directional_Mask_Value) == 0x000050, "Wrong size on UDS_PlayerOcclusion_C_Directional_Mask_Value");
static_assert(offsetof(UDS_PlayerOcclusion_C_Directional_Mask_Value, Direction) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Directional_Mask_Value::Direction' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Directional_Mask_Value, Compare) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Directional_Mask_Value::Compare' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Directional_Mask_Value, ReturnValue) == 0x000030, "Member 'UDS_PlayerOcclusion_C_Directional_Mask_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Directional_Mask_Value, CallFunc_Dot_VectorVector_ReturnValue) == 0x000038, "Member 'UDS_PlayerOcclusion_C_Directional_Mask_Value::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Directional_Mask_Value, CallFunc_DegAcos_ReturnValue) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Directional_Mask_Value::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Directional_Mask_Value, CallFunc_MapRangeClamped_ReturnValue) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Directional_Mask_Value::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Update Ignored Actors
// 0x0028 (0x0028 - 0x0000)
struct UDS_PlayerOcclusion_C_Update_Ignored_Actors final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Update_Ignored_Actors) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Update_Ignored_Actors");
static_assert(sizeof(UDS_PlayerOcclusion_C_Update_Ignored_Actors) == 0x000028, "Wrong size on UDS_PlayerOcclusion_C_Update_Ignored_Actors");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Ignored_Actors, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Update_Ignored_Actors::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Ignored_Actors, K2Node_MakeArray_Array) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Update_Ignored_Actors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Ignored_Actors, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Update_Ignored_Actors::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Ignored_Actors, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Update_Ignored_Actors::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Periodic Context Checks
// 0x03F8 (0x03F8 - 0x0000)
struct UDS_PlayerOcclusion_C_Periodic_Context_Checks final
{
public:
	double                                        Portal_Distance_Mask;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Portal_Direction;                                  // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUDS_Occlusion_Portal_C*                Current_Portal;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0058(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Portal_Direction_Mask_Mask;               // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorLinearColor_ReturnValue; // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Add_LinearColorLinearColor_ReturnValue;   // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0220(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_336[0x2];                                      // 0x0336(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Occlusion_Portal_C*                CallFunc_Array_Get_Item;                           // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0388(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0398(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUDS_Occlusion_Volume_Interface_C> K2Node_DynamicCast_AsUDS_Occlusion_Volume_Interface; // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Occlusion_Result_Occluded;            // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x2];                                      // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LineTraceSingle_DrawTime_ImplicitCast;    // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Water_Level_ImplicitCast;       // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Periodic_Context_Checks) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Periodic_Context_Checks");
static_assert(sizeof(UDS_PlayerOcclusion_C_Periodic_Context_Checks) == 0x0003F8, "Wrong size on UDS_PlayerOcclusion_C_Periodic_Context_Checks");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Portal_Distance_Mask) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Portal_Distance_Mask' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Portal_Direction) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Portal_Direction' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Current_Portal) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Current_Portal' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Temp_int_Array_Index_Variable) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Temp_bool_True_if_break_was_hit_Variable) == 0x000034, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Temp_object_Variable) == 0x000058, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000080, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_GetForwardVector_ReturnValue_1) == 0x000098, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_IsActive_ReturnValue) == 0x0000B0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000C9, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000E8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Normal_ReturnValue) == 0x000100, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Portal_Direction_Mask_Mask) == 0x000118, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Portal_Direction_Mask_Mask' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000128, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Vector_Distance_ReturnValue) == 0x000140, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000148, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, K2Node_MakeStruct_LinearColor) == 0x000150, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000160, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Multiply_LinearColorLinearColor_ReturnValue) == 0x000168, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Multiply_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000178, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Add_LinearColorLinearColor_ReturnValue) == 0x000180, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Add_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000190, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000198, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001B0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Normal_ReturnValue_1) == 0x0001C8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Dot_VectorVector_ReturnValue) == 0x0001E0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x0001E8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_SelectVector_ReturnValue) == 0x0001F0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000208, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_LineTraceSingle_OutHit) == 0x000220, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_LineTraceSingle_ReturnValue) == 0x000308, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Not_PreBool_ReturnValue_1) == 0x000309, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000310, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_VSize_ReturnValue) == 0x000328, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, Temp_int_Loop_Counter_Variable_1) == 0x000330, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000334, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_BooleanAND_ReturnValue) == 0x000335, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Add_IntInt_ReturnValue_1) == 0x000338, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Array_Get_Item) == 0x000340, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000348, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Array_Length_ReturnValue) == 0x00034C, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Less_IntInt_ReturnValue) == 0x000350, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_BreakVector_X) == 0x000358, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_BreakVector_Y) == 0x000360, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_BreakVector_Z) == 0x000368, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000370, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_SelectFloat_ReturnValue) == 0x000378, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000380, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000381, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, K2Node_MakeArray_Array) == 0x000388, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_SphereOverlapActors_OutActors) == 0x000398, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_SphereOverlapActors_ReturnValue) == 0x0003A8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Array_Length_ReturnValue_1) == 0x0003AC, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003B0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Array_Get_Item_1) == 0x0003B8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_BooleanAND_ReturnValue_1) == 0x0003C0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, K2Node_DynamicCast_AsUDS_Occlusion_Volume_Interface) == 0x0003C8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::K2Node_DynamicCast_AsUDS_Occlusion_Volume_Interface' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, K2Node_DynamicCast_bSuccess) == 0x0003D8, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, CallFunc_Get_Occlusion_Result_Occluded) == 0x0003D9, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::CallFunc_Get_Occlusion_Result_Occluded' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, K2Node_MakeStruct_R_ImplicitCast) == 0x0003DC, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, K2Node_MakeStruct_G_ImplicitCast) == 0x0003E0, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Periodic_Context_Checks, K2Node_MakeStruct_B_ImplicitCast) == 0x0003E4, "Member 'UDS_PlayerOcclusion_C_Periodic_Context_Checks::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
