#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_WeatherMask_Interface

#include "Basic.hpp"

#include "UDS_DLWE_Mode_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UDS_WeatherMask_Interface.UDS_WeatherMask_Interface_C.Approximate Masking At Location
// 0x0030 (0x0030 - 0x0000)
struct UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_DLWE_Mode                                Mode;                                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Mask;                                              // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cancel_All_Masks;                                  // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location) == 0x000008, "Wrong alignment on UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location");
static_assert(sizeof(UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location) == 0x000030, "Wrong size on UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location");
static_assert(offsetof(UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location, Location) == 0x000000, "Member 'UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location::Location' has a wrong offset!");
static_assert(offsetof(UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location, Mode) == 0x000018, "Member 'UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location::Mode' has a wrong offset!");
static_assert(offsetof(UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location, Mask) == 0x000020, "Member 'UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location::Mask' has a wrong offset!");
static_assert(offsetof(UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location, Cancel_All_Masks) == 0x000028, "Member 'UDS_WeatherMask_Interface_C_Approximate_Masking_At_Location::Cancel_All_Masks' has a wrong offset!");

}

