#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDW_Lightning_Spawn_Manager

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UDW_Lightning_Spawn_Manager.UDW_Lightning_Spawn_Manager_C.Check For Timer Interrupt
// 0x0020 (0x0020 - 0x0000)
struct UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt final
{
public:
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Current_Lightning_Period_and_Status_Period; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Current_Lightning_Period_and_Status_Enabled; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt) == 0x000008, "Wrong alignment on UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt");
static_assert(sizeof(UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt) == 0x000020, "Wrong size on UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000000, "Member 'UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt, CallFunc_Current_Lightning_Period_and_Status_Period) == 0x000008, "Member 'UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt::CallFunc_Current_Lightning_Period_and_Status_Period' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt, CallFunc_Current_Lightning_Period_and_Status_Enabled) == 0x000010, "Member 'UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt::CallFunc_Current_Lightning_Period_and_Status_Enabled' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000011, "Member 'UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'UDW_Lightning_Spawn_Manager_C_Check_For_Timer_Interrupt::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function UDW_Lightning_Spawn_Manager.UDW_Lightning_Spawn_Manager_C.Initialize
// 0x0040 (0x0040 - 0x0000)
struct UDW_Lightning_Spawn_Manager_C_Initialize final
{
public:
	class AUltra_Dynamic_Weather_C*               UDW_0;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Spawn_Global_Lightning_0;                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Weather_Settings_C*                Weather_State_0;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Current_Lightning_Period_and_Status_Period; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Current_Lightning_Period_and_Status_Enabled; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDW_Lightning_Spawn_Manager_C_Initialize) == 0x000008, "Wrong alignment on UDW_Lightning_Spawn_Manager_C_Initialize");
static_assert(sizeof(UDW_Lightning_Spawn_Manager_C_Initialize) == 0x000040, "Wrong size on UDW_Lightning_Spawn_Manager_C_Initialize");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Initialize, UDW_0) == 0x000000, "Member 'UDW_Lightning_Spawn_Manager_C_Initialize::UDW_0' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Initialize, Spawn_Global_Lightning_0) == 0x000008, "Member 'UDW_Lightning_Spawn_Manager_C_Initialize::Spawn_Global_Lightning_0' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Initialize, Weather_State_0) == 0x000010, "Member 'UDW_Lightning_Spawn_Manager_C_Initialize::Weather_State_0' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Initialize, CallFunc_K2_SetTimer_ReturnValue) == 0x000018, "Member 'UDW_Lightning_Spawn_Manager_C_Initialize::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Initialize, CallFunc_Current_Lightning_Period_and_Status_Period) == 0x000020, "Member 'UDW_Lightning_Spawn_Manager_C_Initialize::CallFunc_Current_Lightning_Period_and_Status_Period' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Initialize, CallFunc_Current_Lightning_Period_and_Status_Enabled) == 0x000028, "Member 'UDW_Lightning_Spawn_Manager_C_Initialize::CallFunc_Current_Lightning_Period_and_Status_Enabled' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Initialize, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000030, "Member 'UDW_Lightning_Spawn_Manager_C_Initialize::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Initialize, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000038, "Member 'UDW_Lightning_Spawn_Manager_C_Initialize::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function UDW_Lightning_Spawn_Manager.UDW_Lightning_Spawn_Manager_C.Timed Lightning Spawn
// 0x0060 (0x0060 - 0x0000)
struct UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn final
{
public:
	double                                        Current_Period;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Current_Lightning_Period_and_Status_Period; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Current_Lightning_Period_and_Status_Enabled; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Global_Lightning_Internal_Angle_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Local_Lightning_Internal_Angle_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn) == 0x000008, "Wrong alignment on UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn");
static_assert(sizeof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn) == 0x000060, "Wrong size on UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, Current_Period) == 0x000000, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::Current_Period' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000008, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x00000C, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x000010, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_K2_SetTimer_ReturnValue) == 0x000028, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_Current_Lightning_Period_and_Status_Period) == 0x000030, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_Current_Lightning_Period_and_Status_Period' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_Current_Lightning_Period_and_Status_Enabled) == 0x000038, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_Current_Lightning_Period_and_Status_Enabled' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_Global_Lightning_Internal_Angle_ImplicitCast) == 0x000040, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_Global_Lightning_Internal_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_Local_Lightning_Internal_Angle_ImplicitCast) == 0x000048, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_Local_Lightning_Internal_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000058, "Member 'UDW_Lightning_Spawn_Manager_C_Timed_Lightning_Spawn::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

}

