#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Weather

#include "Basic.hpp"

#include "UDS_DLWE_Mode_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RandomWeatherVariation_State_structs.hpp"
#include "UDS_and_UDW_State_structs.hpp"
#include "UDS_Weather_Sound_Components_structs.hpp"
#include "UDS_TemperatureType_structs.hpp"
#include "UDS_Weather_Display_Names_structs.hpp"
#include "UDS_Season_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Add Weather Override Volume to Array
// 0x0010 (0x0010 - 0x0000)
struct Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array final
{
public:
	class AWeather_Override_Volume_C*             Weather_Override_Volume;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array) == 0x000010, "Wrong size on Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array, Weather_Override_Volume) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array::Weather_Override_Volume' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array, CallFunc_Array_Contains_ReturnValue) == 0x00000C, "Member 'Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply Climate Preset Object
// 0x0190 (0x0190 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object final
{
public:
	class UUDS_Climate_Preset_C*                  Climate;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Make_Climate_Probability_Map_Probability_Map; // 0x0010(0x0050)()
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Make_Climate_Probability_Map_Probability_Map_1; // 0x0060(0x0050)()
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Make_Climate_Probability_Map_Probability_Map_2; // 0x00B0(0x0050)()
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Make_Climate_Probability_Map_Probability_Map_3; // 0x0100(0x0050)()
	struct FVector2D                              CallFunc_Get_Climate_Temperature_Ranges_Summer_Range; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Climate_Temperature_Ranges_Autumn_Range; // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Climate_Temperature_Ranges_Winter_Range; // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Climate_Temperature_Ranges_Spring_Range; // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object) == 0x000190, "Wrong size on Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, Climate) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::Climate' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_Make_Climate_Probability_Map_Probability_Map) == 0x000010, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_Make_Climate_Probability_Map_Probability_Map' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_Make_Climate_Probability_Map_Probability_Map_1) == 0x000060, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_Make_Climate_Probability_Map_Probability_Map_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_Make_Climate_Probability_Map_Probability_Map_2) == 0x0000B0, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_Make_Climate_Probability_Map_Probability_Map_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_Make_Climate_Probability_Map_Probability_Map_3) == 0x000100, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_Make_Climate_Probability_Map_Probability_Map_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_Get_Climate_Temperature_Ranges_Summer_Range) == 0x000150, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_Get_Climate_Temperature_Ranges_Summer_Range' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_Get_Climate_Temperature_Ranges_Autumn_Range) == 0x000160, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_Get_Climate_Temperature_Ranges_Autumn_Range' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_Get_Climate_Temperature_Ranges_Winter_Range) == 0x000170, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_Get_Climate_Temperature_Ranges_Winter_Range' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object, CallFunc_Get_Climate_Temperature_Ranges_Spring_Range) == 0x000180, "Member 'Ultra_Dynamic_Weather_C_Apply_Climate_Preset_Object::CallFunc_Get_Climate_Temperature_Ranges_Spring_Range' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply Interior Temperature with Occlusion
// 0x0028 (0x0028 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion final
{
public:
	double                                        Temp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Occlusion;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Out;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion) == 0x000028, "Wrong size on Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, Temp) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::Temp' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, Occlusion) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::Occlusion' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, Out) == 0x000010, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::Out' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply Max to Material Effects
// 0x0038 (0x0038 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects final
{
public:
	class UUDS_Weather_Settings_C*                Weather_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Snow_Coverage;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_Dust_0;                                      // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects) == 0x000038, "Wrong size on Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, Weather_0) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::Weather_0' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, Snow_Coverage) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::Snow_Coverage' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, Wetness) == 0x000010, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::Wetness' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, Param_Dust_0) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::Param_Dust_0' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply Splash Materials
// 0x0088 (0x0088 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_Splash_Materials final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterial>               K2Node_Select_Default;                             // 0x0008(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterial>               K2Node_Select_Default_1;                           // 0x0030(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              K2Node_DynamicCast_AsMaterial;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              K2Node_DynamicCast_AsMaterial_1;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_Splash_Materials");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials) == 0x000088, "Wrong size on Ultra_Dynamic_Weather_C_Apply_Splash_Materials");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, Temp_bool_Variable) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, Temp_bool_Variable_1) == 0x000001, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, K2Node_Select_Default) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, K2Node_Select_Default_1) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000060, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, K2Node_DynamicCast_AsMaterial) == 0x000068, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::K2Node_DynamicCast_AsMaterial' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, K2Node_DynamicCast_AsMaterial_1) == 0x000078, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::K2Node_DynamicCast_AsMaterial_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Splash_Materials, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'Ultra_Dynamic_Weather_C_Apply_Splash_Materials::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply State
// 0x0160 (0x0160 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_State final
{
public:
	struct FUDS_and_UDW_State                     State;                                             // 0x0000(0x0160)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_State) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_State");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_State) == 0x000160, "Wrong size on Ultra_Dynamic_Weather_C_Apply_State");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_State, State) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_State::State' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply Weather Changes Above Cloud Layer
// 0x00F8 (0x00F8 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer final
{
public:
	class UUDS_Weather_Settings_C*                State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Above_Clouds;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_6;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_7;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_8;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_9;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_10;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer) == 0x0000F8, "Wrong size on Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, State) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::State' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, Location) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::Location' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, Above_Clouds) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::Above_Clouds' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_BreakVector_X) == 0x000028, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_BreakVector_Y) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_BreakVector_Z) == 0x000038, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue) == 0x000040, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_1) == 0x000050, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_2) == 0x000060, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000068, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000070, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_3) == 0x000078, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000080, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_4) == 0x000088, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000090, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_5) == 0x000098, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x0000A0, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_6) == 0x0000A8, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x0000B0, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_7) == 0x0000B8, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x0000C0, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_8) == 0x0000C8, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_9) == 0x0000D0, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Lerp_ReturnValue_10) == 0x0000D8, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Lerp_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x0000E0, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_MapRangeClamped_ReturnValue) == 0x0000E8, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F0, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer, CallFunc_BooleanAND_ReturnValue_1) == 0x0000F2, "Member 'Ultra_Dynamic_Weather_C_Apply_Weather_Changes_Above_Cloud_Layer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Audio Update
// 0x00E0 (0x00E0 - 0x0000)
struct Ultra_Dynamic_Weather_C_Audio_Update final
{
public:
	class UAudioComponent*                        Sound_Component;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Current_Values;                                    // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Alpha;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLowPassFilterFrequency_InLowPassFilterFrequency_ImplicitCast; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Audio_Update) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Audio_Update");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Audio_Update) == 0x0000E0, "Wrong size on Ultra_Dynamic_Weather_C_Audio_Update");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, Sound_Component) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::Sound_Component' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, Current_Values) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::Current_Values' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, Alpha) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::Alpha' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Array_Get_Item) == 0x000040, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_BreakVector_X) == 0x000058, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_BreakVector_Y) == 0x000060, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_BreakVector_Z) == 0x000068, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000070, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Array_Get_Item_3) == 0x000098, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_VLerp_ReturnValue) == 0x0000B0, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_VLerp_Alpha_ImplicitCast) == 0x0000C8, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast) == 0x0000CC, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_SetLowPassFilterFrequency_InLowPassFilterFrequency_ImplicitCast) == 0x0000D0, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_SetLowPassFilterFrequency_InLowPassFilterFrequency_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x0000D4, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Audio_Update, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'Ultra_Dynamic_Weather_C_Audio_Update::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Cache Sound Effects Levels
// 0x0250 (0x0250 - 0x0000)
struct Ultra_Dynamic_Weather_C_Cache_Sound_Effects_Levels final
{
public:
	int32                                         Current_Sound_Index;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Current_Sound_Changing;                            // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Rain_Sound_Component_Properties_Volume;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Rain_Sound_Component_Properties_LPF;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Rain_Sound_Component_Properties_Rain_Parameter; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Directional_Wind_Sound_Volume_And_LPF_Volume; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Directional_Wind_Sound_Volume_And_LPF_LPF; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EUDS_Weather_Sound_Components>         K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EUDS_Weather_Sound_Components>         K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm)
	EUDS_Weather_Sound_Components                 CallFunc_Array_Get_Item;                           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_Weather_Sound_Components                 CallFunc_Array_Get_Item_1;                         // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualExactly_VectorVector_ReturnValue;    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EUDS_Weather_Sound_Components>         K2Node_MakeArray_Array_2;                          // 0x0138(0x0010)(ReferenceParm)
	struct FVector                                Temp_struct_Variable;                              // 0x0148(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_Weather_Sound_Components                 CallFunc_Array_Get_Item_4;                         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Sound_Global_Occlusion_Out;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                CallFunc_Get_Sound_Directional_Occlusion_Out;      // 0x0188(0x0010)(ReferenceParm)
	double                                        CallFunc_Global_Sound_LPF_ReturnValue;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Wind_Whistling_Sound_Volume_Int;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
