#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Sky

#include "Basic.hpp"

#include "UDS_FeatureToggle_structs.hpp"
#include "UDS_Space_Planet_structs.hpp"
#include "UDS_VolRT_Mode_structs.hpp"
#include "UDS_NoiseType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UDS_Cache_Group_structs.hpp"
#include "UDS_Space_Parent_structs.hpp"
#include "UDS_CachedProperties_structs.hpp"
#include "UDS_Planet_Lightsource_structs.hpp"
#include "UDS_Post_Process_Stage_structs.hpp"
#include "UDS_SkyMode_structs.hpp"
#include "UDS_and_UDW_State_structs.hpp"
#include "UDS_CityPresets_structs.hpp"
#include "UDS_LensFlareType_structs.hpp"
#include "UDS_FogColorMode_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.2D Clouds Base Texture
// 0x0130 (0x0130 - 0x0000)
struct Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Tex;                                               // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0030(0x0028)(HasGetValueTypeHash)
	EUDS_NoiseType                                Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0060(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_2;                        // 0x0088(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x00E0(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_1;                           // 0x0108(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture");
static_assert(sizeof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture) == 0x000130, "Wrong size on Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Tex) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Tex' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_bool_Variable) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_softobject_Variable) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_byte_Variable) == 0x000058, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_softobject_Variable_1) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_softobject_Variable_2) == 0x000088, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_softobject_Variable_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000B0, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000D8, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, K2Node_Select_Default) == 0x0000E0, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, K2Node_Select_Default_1) == 0x000108, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::K2Node_Select_Default_1' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.2D Clouds Shading Offset Vector
// 0x00B0 (0x00B0 - 0x0000)
struct Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector final
{
public:
	struct FLinearColor                           LinearColor;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector");
static_assert(sizeof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector) == 0x0000B0, "Wrong size on Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, LinearColor) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::LinearColor' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_X) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_Y) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_Z) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_SelectVector_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Abs_ReturnValue) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_X_1) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_Y_1) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_Z_1) == 0x000080, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_MapRangeClamped_ReturnValue) == 0x000088, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_LinearColor) == 0x000090, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_R_ImplicitCast) == 0x0000A0, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_G_ImplicitCast) == 0x0000A4, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_B_ImplicitCast) == 0x0000A8, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_A_ImplicitCast) == 0x0000AC, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Absent Directional Lights Brightness
// 0x0098 (0x0098 - 0x0000)
struct Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Moon_Phase_Multiplier_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Moon_Phase_Multiplier_Without_Light_Brightness; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness) == 0x000098, "Wrong size on Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, ReturnValue) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_X) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Y) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Z) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_X_1) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Y_1) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Z_1) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Moon_Phase_Multiplier_ReturnValue) == 0x000058, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Moon_Phase_Multiplier_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Moon_Phase_Multiplier_Without_Light_Brightness) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Moon_Phase_Multiplier_Without_Light_Brightness' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_SelectFloat_ReturnValue) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000088, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000090, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Add Object to Async Loading Queue
// 0x0048 (0x0048 - 0x0000)
struct Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue final
{
public:
	TSoftObjectPtr<class UObject>                 Object;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          High_Priority;                                     // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue) == 0x000048, "Wrong size on Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, Object) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::Object' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, High_Priority) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::High_Priority' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Array_Contains_ReturnValue) == 0x000039, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003A, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Array_Contains_ReturnValue_1) == 0x00003B, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003C, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Adjust Base Sun Light Intensity
// 0x0078 (0x0078 - 0x0000)
struct Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity final
{
public:
	struct FVector                                Sun_Vector;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Multiplier;                                        // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity) == 0x000078, "Wrong size on Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, Sun_Vector) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::Sun_Vector' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, Intensity) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::Intensity' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, Multiplier) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::Multiplier' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_SafeDivide_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_BreakVector_X) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_BreakVector_Y) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_BreakVector_Z) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_FMin_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_MapRangeClamped_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000058, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_Lerp_ReturnValue) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_SelectFloat_ReturnValue) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.All Volumetric Cloud MIDs
// 0x0038 (0x0038 - 0x0000)
struct Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs final
{
public:
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x0000(0x0010)(Parm, OutParm)
	TArray<class UMaterialInstanceDynamic*>       All_MIDs;                                          // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs");
static_assert(sizeof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs) == 0x000038, "Wrong size on Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, MIDs) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::MIDs' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, All_MIDs) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::All_MIDs' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue_1) == 0x000024, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue_2) == 0x00002C, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue_3) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Applied Cloud Speed
// 0x0010 (0x0010 - 0x0000)
struct Ultra_Dynamic_Sky_C_Applied_Cloud_Speed final
{
public:
	double                                        Out;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Applied_Cloud_Speed) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Applied_Cloud_Speed");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Applied_Cloud_Speed) == 0x000010, "Wrong size on Ultra_Dynamic_Sky_C_Applied_Cloud_Speed");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Applied_Cloud_Speed, Out) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Applied_Cloud_Speed::Out' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Applied_Cloud_Speed, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_Applied_Cloud_Speed::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Console Variable with Check
// 0x00E0 (0x00E0 - 0x0000)
struct Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check final
{
public:
	class FString                                 Cvar;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Setting;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check) == 0x0000E0, "Wrong size on Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, Cvar) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::Cvar' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, Setting) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::Setting' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, Type) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::Type' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_FTrunc_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000034, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_FTrunc_ReturnValue_1) == 0x000064, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000088, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000098, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000099, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x00009C, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000A0, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000B0, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000C0, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Light Shaft Settings
// 0x0100 (0x0100 - 0x0000)
struct Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings final
{
public:
	class UDirectionalLightComponent*             Light;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Max_Brightness;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Bloom_Threshold;                                   // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Bloom_Scale;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Forward_Vector;                                    // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height_Alpha;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBloomScale_NewValue_ImplicitCast;      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBloomThreshold_NewValue_ImplicitCast;  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBloomMaxBrightness_NewValue_ImplicitCast; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings) == 0x000100, "Wrong size on Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, Light) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::Light' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, Max_Brightness) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::Max_Brightness' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, Bloom_Threshold) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::Bloom_Threshold' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, Bloom_Scale) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::Bloom_Scale' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, Forward_Vector) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::Forward_Vector' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, Height_Alpha) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::Height_Alpha' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_BreakVector_X) == 0x000058, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_BreakVector_Y) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_BreakVector_Z) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_MapRangeClamped_ReturnValue) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_BreakVector_X_1) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_BreakVector_Y_1) == 0x000080, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_BreakVector_Z_1) == 0x000088, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000090, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000098, "Member 'Ultra_Dynamic_Sky_C_Apply_Light_Shaft_Settings::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
