#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VideoSettingsPage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function VideoSettingsPage.VideoSettingsPage_C.BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct VideoSettingsPage_C_BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VideoSettingsPage_C_BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on VideoSettingsPage_C_BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(VideoSettingsPage_C_BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on VideoSettingsPage_C_BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(VideoSettingsPage_C_BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'VideoSettingsPage_C_BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function VideoSettingsPage.VideoSettingsPage_C.BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct VideoSettingsPage_C_BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VideoSettingsPage_C_BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on VideoSettingsPage_C_BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(VideoSettingsPage_C_BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on VideoSettingsPage_C_BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(VideoSettingsPage_C_BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'VideoSettingsPage_C_BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function VideoSettingsPage.VideoSettingsPage_C.DLSS-FG-Enabled
// 0x0001 (0x0001 - 0x0000)
struct VideoSettingsPage_C_DLSSMinusFGMinusEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VideoSettingsPage_C_DLSSMinusFGMinusEnabled) == 0x000001, "Wrong alignment on VideoSettingsPage_C_DLSSMinusFGMinusEnabled");
static_assert(sizeof(VideoSettingsPage_C_DLSSMinusFGMinusEnabled) == 0x000001, "Wrong size on VideoSettingsPage_C_DLSSMinusFGMinusEnabled");
static_assert(offsetof(VideoSettingsPage_C_DLSSMinusFGMinusEnabled, Enabled) == 0x000000, "Member 'VideoSettingsPage_C_DLSSMinusFGMinusEnabled::Enabled' has a wrong offset!");

// Function VideoSettingsPage.VideoSettingsPage_C.ExecuteUbergraph_VideoSettingsPage
// 0x00E0 (0x00E0 - 0x0000)
struct VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAutoSettingWidget*>             CallFunc_GetChildSettings_ReturnValue;             // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAutoSettingWidget*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAutoSettingWidget*>             CallFunc_GetChildSettings_ReturnValue_1;           // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAutoSettingWidget*                     CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USettingRow_C*                          K2Node_DynamicCast_AsSetting_Row;                  // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Enabled)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDLSS_FG_Enabled_Enabled;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage) == 0x000008, "Wrong alignment on VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage");
static_assert(sizeof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage) == 0x0000E0, "Wrong size on VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, EntryPoint) == 0x000000, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, Temp_bool_Variable) == 0x000004, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, Temp_int_Array_Index_Variable) == 0x000008, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x00001C, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_GetChildSettings_ReturnValue) == 0x000020, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_GetChildSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Array_Get_Item) == 0x000030, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, K2Node_ComponentBoundEvent_bIsChecked) == 0x000040, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_GetChildSettings_ReturnValue_1) == 0x000048, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_GetChildSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, Temp_bool_Variable_1) == 0x000058, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_GetAllChildren_ReturnValue) == 0x000070, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, K2Node_CustomEvent_Enabled) == 0x000080, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, K2Node_DynamicCast_AsSetting_Row) == 0x000098, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::K2Node_DynamicCast_AsSetting_Row' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Array_Length_ReturnValue_2) == 0x0000A4, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, K2Node_CreateDelegate_OutputDelegate) == 0x0000AC, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_IsDLSS_FG_Enabled_Enabled) == 0x0000BC, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_IsDLSS_FG_Enabled_Enabled' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, Temp_int_Loop_Counter_Variable_2) == 0x0000C0, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_GetIsEnabled_ReturnValue) == 0x0000C4, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000C5, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, K2Node_Select_Default) == 0x0000C8, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, K2Node_Select_Default_1) == 0x0000D0, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D8, "Member 'VideoSettingsPage_C_ExecuteUbergraph_VideoSettingsPage::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function VideoSettingsPage.VideoSettingsPage_C.Get_ApplyButton_bIsEnabled_0
// 0x0002 (0x0002 - 0x0000)
struct VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesAnyChildSettingHaveUnappliedChange_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0) == 0x000001, "Wrong alignment on VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0");
static_assert(sizeof(VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0) == 0x000002, "Wrong size on VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0");
static_assert(offsetof(VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0, CallFunc_DoesAnyChildSettingHaveUnappliedChange_ReturnValue) == 0x000001, "Member 'VideoSettingsPage_C_Get_ApplyButton_bIsEnabled_0::CallFunc_DoesAnyChildSettingHaveUnappliedChange_ReturnValue' has a wrong offset!");

// Function VideoSettingsPage.VideoSettingsPage_C.Get_AutoApplyCheckbox_bIsEnabled_0
// 0x0002 (0x0002 - 0x0000)
struct VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0) == 0x000001, "Wrong alignment on VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0");
static_assert(sizeof(VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0) == 0x000002, "Wrong size on VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0");
static_assert(offsetof(VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'VideoSettingsPage_C_Get_AutoApplyCheckbox_bIsEnabled_0::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function VideoSettingsPage.VideoSettingsPage_C.Get_SaveButton_bIsEnabled_0
// 0x0002 (0x0002 - 0x0000)
struct VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesAnyChildSettingHaveUnsavedChange_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0) == 0x000001, "Wrong alignment on VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0");
static_assert(sizeof(VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0) == 0x000002, "Wrong size on VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0");
static_assert(offsetof(VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0, CallFunc_DoesAnyChildSettingHaveUnsavedChange_ReturnValue) == 0x000001, "Member 'VideoSettingsPage_C_Get_SaveButton_bIsEnabled_0::CallFunc_DoesAnyChildSettingHaveUnsavedChange_ReturnValue' has a wrong offset!");

// Function VideoSettingsPage.VideoSettingsPage_C.NavigateToBPW
// 0x0010 (0x0010 - 0x0000)
struct VideoSettingsPage_C_NavigateToBPW final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VideoSettingsPage_C_NavigateToBPW) == 0x000008, "Wrong alignment on VideoSettingsPage_C_NavigateToBPW");
static_assert(sizeof(VideoSettingsPage_C_NavigateToBPW) == 0x000010, "Wrong size on VideoSettingsPage_C_NavigateToBPW");
static_assert(offsetof(VideoSettingsPage_C_NavigateToBPW, Navigation_0) == 0x000000, "Member 'VideoSettingsPage_C_NavigateToBPW::Navigation_0' has a wrong offset!");
static_assert(offsetof(VideoSettingsPage_C_NavigateToBPW, ReturnValue) == 0x000008, "Member 'VideoSettingsPage_C_NavigateToBPW::ReturnValue' has a wrong offset!");

}

