#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VideoSettingsPage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SettingPage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VideoSettingsPage.VideoSettingsPage_C
// 0x0120 (0x0400 - 0x02E0)
class UVideoSettingsPage_C final : public USettingPage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDefaultRadioSelectSetting_C*           Zero4MaxFPSSettings;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultRadioSelectSetting_C*           Zero5VSyncSettings;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStyledSliderSetting_C*                 Zero7GammeSettings;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ApplyButton;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              AutoApplyCheckbox;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                AutoDetectButton;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              AutoSaveCheckbox;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_NGX_C*                             BPW_NGX;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CancelButton;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder_1;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder_2;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder_4;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SaveButton;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_VAR;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_Resolution;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_ResScaleDisabled;                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRow_C*                          SettingRow_WindowMode;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRowHeader_C*                    SettingRowHeader;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingRowHeader_C*                    SettingRowHeader_1;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Spinner;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Spinner_1;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Spinner_2;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Spinner_4;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_1;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_2;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_4;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VideoSettings;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          AutoSave;                                          // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoApply;                                         // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Touched_Component;                                 // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ApplyButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__AutoApplyCheckbox_K2Node_ComponentBoundEvent_336_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__AutoSaveCheckbox_K2Node_ComponentBoundEvent_40_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SaveButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__VideoSettingsPage_AutoDetectButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void DLSSMinusFGMinusEnabled(bool Enabled);
	void ExecuteUbergraph_VideoSettingsPage(int32 EntryPoint);
	bool Get_ApplyButton_bIsEnabled_0();
	bool Get_AutoApplyCheckbox_bIsEnabled_0();
	bool Get_SaveButton_bIsEnabled_0();
	class UWidget* NavigateToBPW(EUINavigation Navigation_0);
	void UpdateScaledResolutionText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VideoSettingsPage_C">();
	}
	static class UVideoSettingsPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVideoSettingsPage_C>();
	}
};
static_assert(alignof(UVideoSettingsPage_C) == 0x000008, "Wrong alignment on UVideoSettingsPage_C");
static_assert(sizeof(UVideoSettingsPage_C) == 0x000400, "Wrong size on UVideoSettingsPage_C");
static_assert(offsetof(UVideoSettingsPage_C, UberGraphFrame) == 0x0002E0, "Member 'UVideoSettingsPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Zero4MaxFPSSettings) == 0x0002E8, "Member 'UVideoSettingsPage_C::Zero4MaxFPSSettings' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Zero5VSyncSettings) == 0x0002F0, "Member 'UVideoSettingsPage_C::Zero5VSyncSettings' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Zero7GammeSettings) == 0x0002F8, "Member 'UVideoSettingsPage_C::Zero7GammeSettings' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, ApplyButton) == 0x000300, "Member 'UVideoSettingsPage_C::ApplyButton' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, AutoApplyCheckbox) == 0x000308, "Member 'UVideoSettingsPage_C::AutoApplyCheckbox' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, AutoDetectButton) == 0x000310, "Member 'UVideoSettingsPage_C::AutoDetectButton' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, AutoSaveCheckbox) == 0x000318, "Member 'UVideoSettingsPage_C::AutoSaveCheckbox' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, BPW_NGX) == 0x000320, "Member 'UVideoSettingsPage_C::BPW_NGX' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, CancelButton) == 0x000328, "Member 'UVideoSettingsPage_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, HoverBorder) == 0x000330, "Member 'UVideoSettingsPage_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, HoverBorder_1) == 0x000338, "Member 'UVideoSettingsPage_C::HoverBorder_1' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, HoverBorder_2) == 0x000340, "Member 'UVideoSettingsPage_C::HoverBorder_2' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, HoverBorder_4) == 0x000348, "Member 'UVideoSettingsPage_C::HoverBorder_4' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Image) == 0x000350, "Member 'UVideoSettingsPage_C::Image' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Image_1) == 0x000358, "Member 'UVideoSettingsPage_C::Image_1' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Image_3) == 0x000360, "Member 'UVideoSettingsPage_C::Image_3' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Image_4) == 0x000368, "Member 'UVideoSettingsPage_C::Image_4' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, SaveButton) == 0x000370, "Member 'UVideoSettingsPage_C::SaveButton' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, ScrollBox_VAR) == 0x000378, "Member 'UVideoSettingsPage_C::ScrollBox_VAR' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, SettingRow_Resolution) == 0x000380, "Member 'UVideoSettingsPage_C::SettingRow_Resolution' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, SettingRow_ResScaleDisabled) == 0x000388, "Member 'UVideoSettingsPage_C::SettingRow_ResScaleDisabled' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, SettingRow_WindowMode) == 0x000390, "Member 'UVideoSettingsPage_C::SettingRow_WindowMode' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, SettingRowHeader) == 0x000398, "Member 'UVideoSettingsPage_C::SettingRowHeader' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, SettingRowHeader_1) == 0x0003A0, "Member 'UVideoSettingsPage_C::SettingRowHeader_1' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Spinner) == 0x0003A8, "Member 'UVideoSettingsPage_C::Spinner' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Spinner_1) == 0x0003B0, "Member 'UVideoSettingsPage_C::Spinner_1' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Spinner_2) == 0x0003B8, "Member 'UVideoSettingsPage_C::Spinner_2' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Spinner_4) == 0x0003C0, "Member 'UVideoSettingsPage_C::Spinner_4' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Text) == 0x0003C8, "Member 'UVideoSettingsPage_C::Text' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Text_1) == 0x0003D0, "Member 'UVideoSettingsPage_C::Text_1' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Text_2) == 0x0003D8, "Member 'UVideoSettingsPage_C::Text_2' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Text_4) == 0x0003E0, "Member 'UVideoSettingsPage_C::Text_4' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, VideoSettings) == 0x0003E8, "Member 'UVideoSettingsPage_C::VideoSettings' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, AutoSave) == 0x0003F0, "Member 'UVideoSettingsPage_C::AutoSave' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, AutoApply) == 0x0003F1, "Member 'UVideoSettingsPage_C::AutoApply' has a wrong offset!");
static_assert(offsetof(UVideoSettingsPage_C, Touched_Component) == 0x0003F8, "Member 'UVideoSettingsPage_C::Touched_Component' has a wrong offset!");

}

