#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBD_FSR_Settings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBD_FSR_Settings.WBD_FSR_Settings_C.BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FName                                   SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x00000C, "Wrong size on WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000008, "Member 'WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_ComboBoxKey_151_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBD_FSR_Settings.WBD_FSR_Settings_C.BndEvt__WBD_FSR_Settings_Slider_84_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_Slider_84_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_Slider_84_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_Slider_84_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_Slider_84_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_Slider_84_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_Slider_84_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBD_FSR_Settings_C_BndEvt__WBD_FSR_Settings_Slider_84_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBD_FSR_Settings.WBD_FSR_Settings_C.ExecuteUbergraph_WBD_FSR_Settings
// 0x0058 (0x0058 - 0x0000)
struct WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_SelectedItem;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringCVar_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings) == 0x000008, "Wrong alignment on WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings");
static_assert(sizeof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings) == 0x000058, "Wrong size on WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, EntryPoint) == 0x000000, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, K2Node_ComponentBoundEvent_Value) == 0x000004, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000008, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, K2Node_ComponentBoundEvent_SelectedItem) == 0x000028, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, K2Node_ComponentBoundEvent_SelectionType) == 0x000030, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, CallFunc_GetStringCVar_ReturnValue) == 0x000038, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::CallFunc_GetStringCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, CallFunc_Conv_StringToInt_ReturnValue) == 0x000048, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, K2Node_SwitchInteger_CmpSuccess) == 0x00004C, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000050, "Member 'WBD_FSR_Settings_C_ExecuteUbergraph_WBD_FSR_Settings::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");

}

