#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymGuiMetaPopupHelper

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GymGuiMetaPopupHelper.WBP_GymGuiMetaPopupHelper_C.ExecuteUbergraph_WBP_GymGuiMetaPopupHelper
// 0x0090 (0x0090 - 0x0000)
struct WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0038(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0050(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_3;          // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0070(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2; // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3; // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4; // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper) == 0x000008, "Wrong alignment on WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper");
static_assert(sizeof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper) == 0x000090, "Wrong size on WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, EntryPoint) == 0x000000, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue) == 0x000004, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, K2Node_InputActionEvent_Key) == 0x000008, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, K2Node_InputActionEvent_Key_1) == 0x000020, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, K2Node_InputActionEvent_Key_2) == 0x000038, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, K2Node_InputActionEvent_Key_3) == 0x000050, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_GamepadUINavigate_ReturnValue) == 0x000068, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x000069, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_GamepadUINavigate_ReturnValue_2) == 0x00006A, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_GamepadUINavigate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_GamepadUINavigate_ReturnValue_3) == 0x00006B, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_GamepadUINavigate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, K2Node_InputActionEvent_Key_4) == 0x000070, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1) == 0x000089, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2) == 0x00008A, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_BooleanAND_ReturnValue_1) == 0x00008B, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3) == 0x00008C, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_BooleanAND_ReturnValue_2) == 0x00008D, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4) == 0x00008E, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_IsOpenVisibleAndHasPriority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper, CallFunc_BooleanAND_ReturnValue_3) == 0x00008F, "Member 'WBP_GymGuiMetaPopupHelper_C_ExecuteUbergraph_WBP_GymGuiMetaPopupHelper::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function WBP_GymGuiMetaPopupHelper.WBP_GymGuiMetaPopupHelper_C.InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1");
static_assert(sizeof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function WBP_GymGuiMetaPopupHelper.WBP_GymGuiMetaPopupHelper_C.InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2
// 0x0018 (0x0018 - 0x0000)
struct WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2) == 0x000008, "Wrong alignment on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2");
static_assert(sizeof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2) == 0x000018, "Wrong size on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2, Key) == 0x000000, "Member 'WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2::Key' has a wrong offset!");

// Function WBP_GymGuiMetaPopupHelper.WBP_GymGuiMetaPopupHelper_C.InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3
// 0x0018 (0x0018 - 0x0000)
struct WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3) == 0x000008, "Wrong alignment on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3");
static_assert(sizeof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3) == 0x000018, "Wrong size on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3, Key) == 0x000000, "Member 'WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3::Key' has a wrong offset!");

// Function WBP_GymGuiMetaPopupHelper.WBP_GymGuiMetaPopupHelper_C.InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4
// 0x0018 (0x0018 - 0x0000)
struct WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4) == 0x000008, "Wrong alignment on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4");
static_assert(sizeof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4) == 0x000018, "Wrong size on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4, Key) == 0x000000, "Member 'WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4::Key' has a wrong offset!");

// Function WBP_GymGuiMetaPopupHelper.WBP_GymGuiMetaPopupHelper_C.InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0");
static_assert(sizeof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0");
static_assert(offsetof(WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'WBP_GymGuiMetaPopupHelper_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0::Key' has a wrong offset!");

}

