#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RewardPageIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RewardPageIndicator.WBP_RewardPageIndicator_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_RewardPageIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               ItemIndicators;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColor                                 ClaimedColor;                                      // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CurrentColor;                                      // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 UnclaimedColor;                                    // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_RewardPageIndicator(int32 EntryPoint);
	void SetPage(int32 Page, int32 PageCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RewardPageIndicator_C">();
	}
	static class UWBP_RewardPageIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RewardPageIndicator_C>();
	}
};
static_assert(alignof(UWBP_RewardPageIndicator_C) == 0x000008, "Wrong alignment on UWBP_RewardPageIndicator_C");
static_assert(sizeof(UWBP_RewardPageIndicator_C) == 0x0002E0, "Wrong size on UWBP_RewardPageIndicator_C");
static_assert(offsetof(UWBP_RewardPageIndicator_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_RewardPageIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageIndicator_C, ItemIndicators) == 0x0002C8, "Member 'UWBP_RewardPageIndicator_C::ItemIndicators' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageIndicator_C, ClaimedColor) == 0x0002D0, "Member 'UWBP_RewardPageIndicator_C::ClaimedColor' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageIndicator_C, CurrentColor) == 0x0002D4, "Member 'UWBP_RewardPageIndicator_C::CurrentColor' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageIndicator_C, UnclaimedColor) == 0x0002D8, "Member 'UWBP_RewardPageIndicator_C::UnclaimedColor' has a wrong offset!");

}

