#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpectatorPlayerInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpectatorPlayerInfo.WBP_SpectatorPlayerInfo_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_SpectatorPlayerInfo_C final : public UUserWidget
{
public:
	class UImage*                                 Avatara;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x02D0(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             AvatarTexture;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpectatorPlayerInfo_C">();
	}
	static class UWBP_SpectatorPlayerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpectatorPlayerInfo_C>();
	}
};
static_assert(alignof(UWBP_SpectatorPlayerInfo_C) == 0x000008, "Wrong alignment on UWBP_SpectatorPlayerInfo_C");
static_assert(sizeof(UWBP_SpectatorPlayerInfo_C) == 0x0002F0, "Wrong size on UWBP_SpectatorPlayerInfo_C");
static_assert(offsetof(UWBP_SpectatorPlayerInfo_C, Avatara) == 0x0002C0, "Member 'UWBP_SpectatorPlayerInfo_C::Avatara' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorPlayerInfo_C, NameText) == 0x0002C8, "Member 'UWBP_SpectatorPlayerInfo_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorPlayerInfo_C, PlayerName) == 0x0002D0, "Member 'UWBP_SpectatorPlayerInfo_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorPlayerInfo_C, AvatarTexture) == 0x0002E8, "Member 'UWBP_SpectatorPlayerInfo_C::AvatarTexture' has a wrong offset!");

}

