#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SeasonsRewardsCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SeasonsRewardsCard.WBP_SeasonsRewardsCard_C.GetRewardId
// 0x0010 (0x0010 - 0x0000)
struct WBP_SeasonsRewardsCard_C_GetRewardId final
{
public:
	class FString                                 RewardId;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SeasonsRewardsCard_C_GetRewardId) == 0x000008, "Wrong alignment on WBP_SeasonsRewardsCard_C_GetRewardId");
static_assert(sizeof(WBP_SeasonsRewardsCard_C_GetRewardId) == 0x000010, "Wrong size on WBP_SeasonsRewardsCard_C_GetRewardId");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_GetRewardId, RewardId) == 0x000000, "Member 'WBP_SeasonsRewardsCard_C_GetRewardId::RewardId' has a wrong offset!");

// Function WBP_SeasonsRewardsCard.WBP_SeasonsRewardsCard_C.Get_RewardImage_Brush
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromMaterial_ReturnValue;        // 0x00E0(0x00D0)()
};
static_assert(alignof(WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush) == 0x000010, "Wrong alignment on WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush");
static_assert(sizeof(WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush) == 0x0001B0, "Wrong size on WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush, ReturnValue) == 0x000000, "Member 'WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush, CallFunc_MakeBrushFromMaterial_ReturnValue) == 0x0000E0, "Member 'WBP_SeasonsRewardsCard_C_Get_RewardImage_Brush::CallFunc_MakeBrushFromMaterial_ReturnValue' has a wrong offset!");

// Function WBP_SeasonsRewardsCard.WBP_SeasonsRewardsCard_C.ExecuteUbergraph_WBP_SeasonsRewardsCard
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymMetagameUtils*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         CallFunc_GetAssetThumbnail_ReturnValue;            // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard) == 0x000008, "Wrong alignment on WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard");
static_assert(sizeof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard) == 0x0000F8, "Wrong size on WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, EntryPoint) == 0x000000, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_bool_Variable) == 0x000004, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_byte_Variable) == 0x000005, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_bool_Variable_2) == 0x00000A, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_byte_Variable_4) == 0x00000B, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_byte_Variable_5) == 0x00000C, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, K2Node_Select_Default) == 0x000080, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, K2Node_Select_Default_1) == 0x0000B0, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_Not_PreBool_ReturnValue) == 0x0000B1, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_GetAssetThumbnail_ReturnValue) == 0x0000B8, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_GetAssetThumbnail_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_byte_Variable_6) == 0x0000C0, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, K2Node_DynamicCast_AsTexture_2D) == 0x0000C8, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_BooleanAND_ReturnValue) == 0x0000D1, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, K2Node_Select_Default_2) == 0x0000D2, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D8, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_byte_Variable_7) == 0x0000E0, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, Temp_bool_Variable_3) == 0x0000E1, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000E8, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard, K2Node_Select_Default_3) == 0x0000F0, "Member 'WBP_SeasonsRewardsCard_C_ExecuteUbergraph_WBP_SeasonsRewardsCard::K2Node_Select_Default_3' has a wrong offset!");

}

