#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayMenuFeaturedButton3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayMenuFeaturedButton3.WBP_PlayMenuFeaturedButton3_C
// 0x0060 (0x0348 - 0x02E8)
class UWBP_PlayMenuFeaturedButton3_C final : public UGymGuiGenericButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Push;                                              // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FeaturedImage;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FeatureName;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverColor;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   FeatureText;                                       // 0x0320(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             LogoTexture;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundTexture;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlayMenuFeaturedButton_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PlayMenuFeaturedButton_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_PlayMenuFeaturedButton3(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayMenuFeaturedButton3_C">();
	}
	static class UWBP_PlayMenuFeaturedButton3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayMenuFeaturedButton3_C>();
	}
};
static_assert(alignof(UWBP_PlayMenuFeaturedButton3_C) == 0x000008, "Wrong alignment on UWBP_PlayMenuFeaturedButton3_C");
static_assert(sizeof(UWBP_PlayMenuFeaturedButton3_C) == 0x000348, "Wrong size on UWBP_PlayMenuFeaturedButton3_C");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_PlayMenuFeaturedButton3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, HoverAnim) == 0x0002F0, "Member 'UWBP_PlayMenuFeaturedButton3_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, Push) == 0x0002F8, "Member 'UWBP_PlayMenuFeaturedButton3_C::Push' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, FeaturedImage) == 0x000300, "Member 'UWBP_PlayMenuFeaturedButton3_C::FeaturedImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, FeatureName) == 0x000308, "Member 'UWBP_PlayMenuFeaturedButton3_C::FeatureName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, HoverColor) == 0x000310, "Member 'UWBP_PlayMenuFeaturedButton3_C::HoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, Icon) == 0x000318, "Member 'UWBP_PlayMenuFeaturedButton3_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, FeatureText) == 0x000320, "Member 'UWBP_PlayMenuFeaturedButton3_C::FeatureText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, LogoTexture) == 0x000338, "Member 'UWBP_PlayMenuFeaturedButton3_C::LogoTexture' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton3_C, BackgroundTexture) == 0x000340, "Member 'UWBP_PlayMenuFeaturedButton3_C::BackgroundTexture' has a wrong offset!");

}

