#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdminMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AdminMenu.WBP_AdminMenu_C
// 0x0078 (0x0338 - 0x02C0)
class UWBP_AdminMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                CheatProgress;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Exit;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GetAllAchievements;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Granted;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_26;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ResetAchievementProgress;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ResetAchievements;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SAVE_BUTTON;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                UnlockCst;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                XP1;                                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                XP1000;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                XP1000_1;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                XP50;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                XP999;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_AdminMenu_CheatProgress_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_GiveAllAchievements_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_ResetAchievementProgress_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_ResetAchievements_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_SAVE_BUTTON_1_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_SAVE_BUTTON_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_UnlockCst_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_XP1000_1_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_XP1000_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_XP1_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_XP50_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminMenu_XP999_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void CustomEvent(bool Success);
	void ExecuteUbergraph_WBP_AdminMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AdminMenu_C">();
	}
	static class UWBP_AdminMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AdminMenu_C>();
	}
};
static_assert(alignof(UWBP_AdminMenu_C) == 0x000008, "Wrong alignment on UWBP_AdminMenu_C");
static_assert(sizeof(UWBP_AdminMenu_C) == 0x000338, "Wrong size on UWBP_AdminMenu_C");
static_assert(offsetof(UWBP_AdminMenu_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_AdminMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, CheatProgress) == 0x0002C8, "Member 'UWBP_AdminMenu_C::CheatProgress' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, Exit) == 0x0002D0, "Member 'UWBP_AdminMenu_C::Exit' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, GetAllAchievements) == 0x0002D8, "Member 'UWBP_AdminMenu_C::GetAllAchievements' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, Granted) == 0x0002E0, "Member 'UWBP_AdminMenu_C::Granted' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, Image_26) == 0x0002E8, "Member 'UWBP_AdminMenu_C::Image_26' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, ResetAchievementProgress) == 0x0002F0, "Member 'UWBP_AdminMenu_C::ResetAchievementProgress' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, ResetAchievements) == 0x0002F8, "Member 'UWBP_AdminMenu_C::ResetAchievements' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, SAVE_BUTTON) == 0x000300, "Member 'UWBP_AdminMenu_C::SAVE_BUTTON' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, UnlockCst) == 0x000308, "Member 'UWBP_AdminMenu_C::UnlockCst' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, XP1) == 0x000310, "Member 'UWBP_AdminMenu_C::XP1' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, XP1000) == 0x000318, "Member 'UWBP_AdminMenu_C::XP1000' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, XP1000_1) == 0x000320, "Member 'UWBP_AdminMenu_C::XP1000_1' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, XP50) == 0x000328, "Member 'UWBP_AdminMenu_C::XP50' has a wrong offset!");
static_assert(offsetof(UWBP_AdminMenu_C, XP999) == 0x000330, "Member 'UWBP_AdminMenu_C::XP999' has a wrong offset!");

}

