#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlaylistTypeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlaylistTypeButton.WBP_PlaylistTypeButton_C
// 0x0058 (0x0360 - 0x0308)
class UWBP_PlaylistTypeButton_C final : public UGymGuiGenericTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PushAnim;                                          // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ButtonBorder;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SelectBorder;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Content;                                           // 0x0340(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Icon;                                              // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlaylistTypeButton_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PlaylistTypeButton_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_PlaylistTypeButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Select();
	void Unselect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlaylistTypeButton_C">();
	}
	static class UWBP_PlaylistTypeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlaylistTypeButton_C>();
	}
};
static_assert(alignof(UWBP_PlaylistTypeButton_C) == 0x000008, "Wrong alignment on UWBP_PlaylistTypeButton_C");
static_assert(sizeof(UWBP_PlaylistTypeButton_C) == 0x000360, "Wrong size on UWBP_PlaylistTypeButton_C");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, UberGraphFrame) == 0x000308, "Member 'UWBP_PlaylistTypeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, PushAnim) == 0x000310, "Member 'UWBP_PlaylistTypeButton_C::PushAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, HoverAnim) == 0x000318, "Member 'UWBP_PlaylistTypeButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, ButtonBorder) == 0x000320, "Member 'UWBP_PlaylistTypeButton_C::ButtonBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, CommonTextBlock) == 0x000328, "Member 'UWBP_PlaylistTypeButton_C::CommonTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, GameModeIcon) == 0x000330, "Member 'UWBP_PlaylistTypeButton_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, SelectBorder) == 0x000338, "Member 'UWBP_PlaylistTypeButton_C::SelectBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, Content) == 0x000340, "Member 'UWBP_PlaylistTypeButton_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeButton_C, Icon) == 0x000358, "Member 'UWBP_PlaylistTypeButton_C::Icon' has a wrong offset!");

}

