#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_ArrowLeft

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Button_ArrowLeft.WBP_Button_ArrowLeft_C
// 0x0060 (0x0348 - 0x02E8)
class UWBP_Button_ArrowLeft_C final : public UGymGuiGenericButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PushAnim;                                          // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonIcon;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HorizontalText;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              IconContainer_Scale;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0328(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             Texture;                                           // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlaymenuButton_AllLevelsButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PlaymenuButton_AllLevelsButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Button_ArrowLeft(int32 EntryPoint);
	void ForceSetText(const class FText& Text_0);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Button_ArrowLeft_C">();
	}
	static class UWBP_Button_ArrowLeft_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_ArrowLeft_C>();
	}
};
static_assert(alignof(UWBP_Button_ArrowLeft_C) == 0x000008, "Wrong alignment on UWBP_Button_ArrowLeft_C");
static_assert(sizeof(UWBP_Button_ArrowLeft_C) == 0x000348, "Wrong size on UWBP_Button_ArrowLeft_C");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_Button_ArrowLeft_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, PushAnim) == 0x0002F0, "Member 'UWBP_Button_ArrowLeft_C::PushAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, HoverAnim) == 0x0002F8, "Member 'UWBP_Button_ArrowLeft_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, ButtonIcon) == 0x000300, "Member 'UWBP_Button_ArrowLeft_C::ButtonIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, ContentBorder) == 0x000308, "Member 'UWBP_Button_ArrowLeft_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, HorizontalText) == 0x000310, "Member 'UWBP_Button_ArrowLeft_C::HorizontalText' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, HoverBorder) == 0x000318, "Member 'UWBP_Button_ArrowLeft_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, IconContainer_Scale) == 0x000320, "Member 'UWBP_Button_ArrowLeft_C::IconContainer_Scale' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, Text) == 0x000328, "Member 'UWBP_Button_ArrowLeft_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_Button_ArrowLeft_C, Texture) == 0x000340, "Member 'UWBP_Button_ArrowLeft_C::Texture' has a wrong offset!");

}

