#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlaymenuButton_Green

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlaymenuButton_Green.WBP_PlaymenuButton_Green_C.ExecuteUbergraph_WBP_PlaymenuButton_Green
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Value;                          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMaxDesiredWidth_InMaxDesiredWidth_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green) == 0x000008, "Wrong alignment on WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green");
static_assert(sizeof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green) == 0x000030, "Wrong size on WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, EntryPoint) == 0x000000, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, Temp_bool_Variable) == 0x000004, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, Temp_byte_Variable) == 0x000005, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, K2Node_Event_IsDesignTime) == 0x00000A, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, K2Node_CustomEvent_Value) == 0x00000B, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, K2Node_Select_Default) == 0x00000C, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, K2Node_Select_Default_1) == 0x00000D, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green, CallFunc_SetMaxDesiredWidth_InMaxDesiredWidth_ImplicitCast) == 0x000028, "Member 'WBP_PlaymenuButton_Green_C_ExecuteUbergraph_WBP_PlaymenuButton_Green::CallFunc_SetMaxDesiredWidth_InMaxDesiredWidth_ImplicitCast' has a wrong offset!");

// Function WBP_PlaymenuButton_Green.WBP_PlaymenuButton_Green_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlaymenuButton_Green_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlaymenuButton_Green_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PlaymenuButton_Green_C_PreConstruct");
static_assert(sizeof(WBP_PlaymenuButton_Green_C_PreConstruct) == 0x000001, "Wrong size on WBP_PlaymenuButton_Green_C_PreConstruct");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PlaymenuButton_Green_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PlaymenuButton_Green.WBP_PlaymenuButton_Green_C.SetProcessing
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlaymenuButton_Green_C_SetProcessing final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlaymenuButton_Green_C_SetProcessing) == 0x000001, "Wrong alignment on WBP_PlaymenuButton_Green_C_SetProcessing");
static_assert(sizeof(WBP_PlaymenuButton_Green_C_SetProcessing) == 0x000001, "Wrong size on WBP_PlaymenuButton_Green_C_SetProcessing");
static_assert(offsetof(WBP_PlaymenuButton_Green_C_SetProcessing, Value) == 0x000000, "Member 'WBP_PlaymenuButton_Green_C_SetProcessing::Value' has a wrong offset!");

}

