#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NumPropertySetting

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function WBP_NumPropertySetting.WBP_NumPropertySetting_C.DecreaseValue
// 0x0038 (0x0038 - 0x0000)
struct WBP_NumPropertySetting_C_DecreaseValue final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0008(0x0018)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NumPropertySetting_C_DecreaseValue) == 0x000008, "Wrong alignment on WBP_NumPropertySetting_C_DecreaseValue");
static_assert(sizeof(WBP_NumPropertySetting_C_DecreaseValue) == 0x000038, "Wrong size on WBP_NumPropertySetting_C_DecreaseValue");
static_assert(offsetof(WBP_NumPropertySetting_C_DecreaseValue, Temp_bool_Variable) == 0x000000, "Member 'WBP_NumPropertySetting_C_DecreaseValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_DecreaseValue, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000008, "Member 'WBP_NumPropertySetting_C_DecreaseValue::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_DecreaseValue, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_NumPropertySetting_C_DecreaseValue::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_DecreaseValue, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'WBP_NumPropertySetting_C_DecreaseValue::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_DecreaseValue, K2Node_Select_Default) == 0x000030, "Member 'WBP_NumPropertySetting_C_DecreaseValue::K2Node_Select_Default' has a wrong offset!");

// Function WBP_NumPropertySetting.WBP_NumPropertySetting_C.ExecuteUbergraph_WBP_NumPropertySetting
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGymPropertyType                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0030(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0048(0x0018)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0060(0x0018)()
	double                                        K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_FloatVal_ImplicitCast;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MinValue_ImplicitCast;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MaxValue_ImplicitCast;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_StepSize_ImplicitCast;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_FloatVal_ImplicitCast;    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_FloatVal_ImplicitCast_1;  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting) == 0x000008, "Wrong alignment on WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting");
static_assert(sizeof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting) == 0x0000B0, "Wrong size on WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, EntryPoint) == 0x000000, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, Temp_byte_Variable) == 0x000004, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, Temp_real_Variable) == 0x000010, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, Temp_real_Variable_1) == 0x000018, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, Temp_real_Variable_2) == 0x000020, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, Temp_real_Variable_3) == 0x000028, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_InputActionEvent_Key) == 0x000030, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_InputActionEvent_Key_1) == 0x000048, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000060, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_Select_Default) == 0x000078, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, CallFunc_FTrunc_ReturnValue) == 0x000080, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, CallFunc_FTrunc_ReturnValue_1) == 0x000084, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_Select_FloatVal_ImplicitCast) == 0x000088, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_Select_FloatVal_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_VariableSet_MinValue_ImplicitCast) == 0x000090, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_VariableSet_MinValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_VariableSet_MaxValue_ImplicitCast) == 0x000098, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_VariableSet_MaxValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_VariableSet_StepSize_ImplicitCast) == 0x0000A0, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_VariableSet_StepSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_SetFieldsInStruct_FloatVal_ImplicitCast) == 0x0000A8, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_SetFieldsInStruct_FloatVal_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting, K2Node_SetFieldsInStruct_FloatVal_ImplicitCast_1) == 0x0000AC, "Member 'WBP_NumPropertySetting_C_ExecuteUbergraph_WBP_NumPropertySetting::K2Node_SetFieldsInStruct_FloatVal_ImplicitCast_1' has a wrong offset!");

// Function WBP_NumPropertySetting.WBP_NumPropertySetting_C.IncreaseValue
// 0x0038 (0x0038 - 0x0000)
struct WBP_NumPropertySetting_C_IncreaseValue final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0008(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NumPropertySetting_C_IncreaseValue) == 0x000008, "Wrong alignment on WBP_NumPropertySetting_C_IncreaseValue");
static_assert(sizeof(WBP_NumPropertySetting_C_IncreaseValue) == 0x000038, "Wrong size on WBP_NumPropertySetting_C_IncreaseValue");
static_assert(offsetof(WBP_NumPropertySetting_C_IncreaseValue, Temp_bool_Variable) == 0x000000, "Member 'WBP_NumPropertySetting_C_IncreaseValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_IncreaseValue, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000008, "Member 'WBP_NumPropertySetting_C_IncreaseValue::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_IncreaseValue, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_NumPropertySetting_C_IncreaseValue::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_IncreaseValue, CallFunc_FMin_ReturnValue) == 0x000028, "Member 'WBP_NumPropertySetting_C_IncreaseValue::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NumPropertySetting_C_IncreaseValue, K2Node_Select_Default) == 0x000030, "Member 'WBP_NumPropertySetting_C_IncreaseValue::K2Node_Select_Default' has a wrong offset!");

// Function WBP_NumPropertySetting.WBP_NumPropertySetting_C.InpActEvt_ContextualDown_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_NumPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NumPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on WBP_NumPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0");
static_assert(sizeof(WBP_NumPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on WBP_NumPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0");
static_assert(offsetof(WBP_NumPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'WBP_NumPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function WBP_NumPropertySetting.WBP_NumPropertySetting_C.InpActEvt_ContextualUp_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_NumPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NumPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on WBP_NumPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1");
static_assert(sizeof(WBP_NumPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on WBP_NumPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1");
static_assert(offsetof(WBP_NumPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'WBP_NumPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1::Key' has a wrong offset!");

}

