#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlaylistTypeSelector

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlaylistTypeSelector.WBP_PlaylistTypeSelector_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_PlaylistTypeSelector_C final : public UGymGuiGenericTab
{
public:
	class UWidgetAnimation*                       TournamentAnim;                                    // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlaylistTypeButton_C*              RoyaleButton;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaylistTypeButton_C*              TournamentButton;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlaylistTypeSelector_C">();
	}
	static class UWBP_PlaylistTypeSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlaylistTypeSelector_C>();
	}
};
static_assert(alignof(UWBP_PlaylistTypeSelector_C) == 0x000008, "Wrong alignment on UWBP_PlaylistTypeSelector_C");
static_assert(sizeof(UWBP_PlaylistTypeSelector_C) == 0x000320, "Wrong size on UWBP_PlaylistTypeSelector_C");
static_assert(offsetof(UWBP_PlaylistTypeSelector_C, TournamentAnim) == 0x000308, "Member 'UWBP_PlaylistTypeSelector_C::TournamentAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeSelector_C, RoyaleButton) == 0x000310, "Member 'UWBP_PlaylistTypeSelector_C::RoyaleButton' has a wrong offset!");
static_assert(offsetof(UWBP_PlaylistTypeSelector_C, TournamentButton) == 0x000318, "Member 'UWBP_PlaylistTypeSelector_C::TournamentButton' has a wrong offset!");

}

