#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TournamentPanel

#include "Basic.hpp"

#include "RowData_structs.hpp"


namespace SDK::Params
{

// Function WBP_TournamentPanel.WBP_TournamentPanel_C.SetupMaster
// 0x0008 (0x0008 - 0x0000)
struct WBP_TournamentPanel_C_SetupMaster final
{
public:
	class UBP_GymGUIPlaylistScoreboardWidget_C*   PlaylistWidget_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TournamentPanel_C_SetupMaster) == 0x000008, "Wrong alignment on WBP_TournamentPanel_C_SetupMaster");
static_assert(sizeof(WBP_TournamentPanel_C_SetupMaster) == 0x000008, "Wrong size on WBP_TournamentPanel_C_SetupMaster");
static_assert(offsetof(WBP_TournamentPanel_C_SetupMaster, PlaylistWidget_0) == 0x000000, "Member 'WBP_TournamentPanel_C_SetupMaster::PlaylistWidget_0' has a wrong offset!");

// Function WBP_TournamentPanel.WBP_TournamentPanel_C.SetupTitleData
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_TournamentPanel_C_SetupTitleData final
{
public:
	struct FRowData                               CurrentData;                                       // 0x0000(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ColumnTitle_C*                     CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowColumn_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRowData                               CallFunc_Array_Get_Item;                           // 0x0070(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetColumnFill_Coefficient_ImplicitCast;   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TournamentPanel_C_SetupTitleData) == 0x000008, "Wrong alignment on WBP_TournamentPanel_C_SetupTitleData");
static_assert(sizeof(WBP_TournamentPanel_C_SetupTitleData) == 0x0000B8, "Wrong size on WBP_TournamentPanel_C_SetupTitleData");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CurrentData) == 0x000000, "Member 'WBP_TournamentPanel_C_SetupTitleData::CurrentData' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WBP_TournamentPanel_C_SetupTitleData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'WBP_TournamentPanel_C_SetupTitleData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_TournamentPanel_C_SetupTitleData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_TournamentPanel_C_SetupTitleData::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CallFunc_ShouldShowColumn_ReturnValue) == 0x000058, "Member 'WBP_TournamentPanel_C_SetupTitleData::CallFunc_ShouldShowColumn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CallFunc_AddChildToGrid_ReturnValue) == 0x000060, "Member 'WBP_TournamentPanel_C_SetupTitleData::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_TournamentPanel_C_SetupTitleData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_TournamentPanel_C_SetupTitleData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_TournamentPanel_C_SetupTitleData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TournamentPanel_C_SetupTitleData, CallFunc_SetColumnFill_Coefficient_ImplicitCast) == 0x0000B4, "Member 'WBP_TournamentPanel_C_SetupTitleData::CallFunc_SetColumnFill_Coefficient_ImplicitCast' has a wrong offset!");

}

