#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RulestateWidgetCareer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RulestateWidgetCareer.WBP_RulestateWidgetCareer_C
// 0x0060 (0x03A0 - 0x0340)
class UWBP_RulestateWidgetCareer_C final : public UGymGuiRuleStateWidgetCareer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           BomTagVignetteContainer;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularBar_C*                         HoldBar;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       RemoveInputActionUI;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       RemoveInputActionUI_1;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SkipInput;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SprayInput;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TaggedFlames;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Vignette;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               VignetteMat;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDensity;                                        // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerController*                   OwnerController;                                   // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent(bool bIsInCutscene);
	void ExecuteUbergraph_WBP_RulestateWidgetCareer(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ShowBombUI(bool bShow);
	void ShowSpray(bool bShow);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RulestateWidgetCareer_C">();
	}
	static class UWBP_RulestateWidgetCareer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RulestateWidgetCareer_C>();
	}
};
static_assert(alignof(UWBP_RulestateWidgetCareer_C) == 0x000008, "Wrong alignment on UWBP_RulestateWidgetCareer_C");
static_assert(sizeof(UWBP_RulestateWidgetCareer_C) == 0x0003A0, "Wrong size on UWBP_RulestateWidgetCareer_C");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, UberGraphFrame) == 0x000340, "Member 'UWBP_RulestateWidgetCareer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, BomTagVignetteContainer) == 0x000348, "Member 'UWBP_RulestateWidgetCareer_C::BomTagVignetteContainer' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, HoldBar) == 0x000350, "Member 'UWBP_RulestateWidgetCareer_C::HoldBar' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, RemoveInputActionUI) == 0x000358, "Member 'UWBP_RulestateWidgetCareer_C::RemoveInputActionUI' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, RemoveInputActionUI_1) == 0x000360, "Member 'UWBP_RulestateWidgetCareer_C::RemoveInputActionUI_1' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, SkipInput) == 0x000368, "Member 'UWBP_RulestateWidgetCareer_C::SkipInput' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, SprayInput) == 0x000370, "Member 'UWBP_RulestateWidgetCareer_C::SprayInput' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, TaggedFlames) == 0x000378, "Member 'UWBP_RulestateWidgetCareer_C::TaggedFlames' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, Vignette) == 0x000380, "Member 'UWBP_RulestateWidgetCareer_C::Vignette' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, VignetteMat) == 0x000388, "Member 'UWBP_RulestateWidgetCareer_C::VignetteMat' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, MaxDensity) == 0x000390, "Member 'UWBP_RulestateWidgetCareer_C::MaxDensity' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetCareer_C, OwnerController) == 0x000398, "Member 'UWBP_RulestateWidgetCareer_C::OwnerController' has a wrong offset!");

}

