#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TournamentPanel

#include "Basic.hpp"

#include "RowData_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TournamentPanel.WBP_TournamentPanel_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_TournamentPanel_C final : public UUserWidget
{
public:
	class UGridPanel*                             TitleRow;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FRowData>                       TitleData;                                         // 0x02C8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UBP_GymGUIPlaylistScoreboardWidget_C*   PlaylistWidget;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void SetupMaster(class UBP_GymGUIPlaylistScoreboardWidget_C* PlaylistWidget_0);
	void SetupTitleData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TournamentPanel_C">();
	}
	static class UWBP_TournamentPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TournamentPanel_C>();
	}
};
static_assert(alignof(UWBP_TournamentPanel_C) == 0x000008, "Wrong alignment on UWBP_TournamentPanel_C");
static_assert(sizeof(UWBP_TournamentPanel_C) == 0x0002E0, "Wrong size on UWBP_TournamentPanel_C");
static_assert(offsetof(UWBP_TournamentPanel_C, TitleRow) == 0x0002C0, "Member 'UWBP_TournamentPanel_C::TitleRow' has a wrong offset!");
static_assert(offsetof(UWBP_TournamentPanel_C, TitleData) == 0x0002C8, "Member 'UWBP_TournamentPanel_C::TitleData' has a wrong offset!");
static_assert(offsetof(UWBP_TournamentPanel_C, PlaylistWidget) == 0x0002D8, "Member 'UWBP_TournamentPanel_C::PlaylistWidget' has a wrong offset!");

}

