#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MultiSelectPropertySetting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MultiSelectPropertySetting.WBP_MultiSelectPropertySetting_C
// 0x0080 (0x04B8 - 0x0438)
class UWBP_MultiSelectPropertySetting_C final : public UGymGuiAssetPropertyEditorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ArrowLeft;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowRight;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_90;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ValueText;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymPropertyValues                     Property_Value;                                    // 0x0468(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentSelectionIndex;                             // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Selections;                                        // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DecreaseValue();
	void ExecuteUbergraph_WBP_MultiSelectPropertySetting(int32 EntryPoint);
	void FindInitialValue();
	void IncreaseValue();
	void InpActEvt_ContextualDown_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_ContextualUp_K2Node_InputActionEvent_1(const struct FKey& Key);
	void OnHovered();
	void OnPropertyUpdated();
	void OnSelect();
	void OnUnHovered();
	void SelectNextSetting();
	void SelectPrevSetting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MultiSelectPropertySetting_C">();
	}
	static class UWBP_MultiSelectPropertySetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MultiSelectPropertySetting_C>();
	}
};
static_assert(alignof(UWBP_MultiSelectPropertySetting_C) == 0x000008, "Wrong alignment on UWBP_MultiSelectPropertySetting_C");
static_assert(sizeof(UWBP_MultiSelectPropertySetting_C) == 0x0004B8, "Wrong size on UWBP_MultiSelectPropertySetting_C");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, UberGraphFrame) == 0x000438, "Member 'UWBP_MultiSelectPropertySetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, ArrowLeft) == 0x000440, "Member 'UWBP_MultiSelectPropertySetting_C::ArrowLeft' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, ArrowRight) == 0x000448, "Member 'UWBP_MultiSelectPropertySetting_C::ArrowRight' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, Border_90) == 0x000450, "Member 'UWBP_MultiSelectPropertySetting_C::Border_90' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, Text) == 0x000458, "Member 'UWBP_MultiSelectPropertySetting_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, ValueText) == 0x000460, "Member 'UWBP_MultiSelectPropertySetting_C::ValueText' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, Property_Value) == 0x000468, "Member 'UWBP_MultiSelectPropertySetting_C::Property_Value' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, CurrentSelectionIndex) == 0x0004B0, "Member 'UWBP_MultiSelectPropertySetting_C::CurrentSelectionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectPropertySetting_C, Selections) == 0x0004B4, "Member 'UWBP_MultiSelectPropertySetting_C::Selections' has a wrong offset!");

}

