#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LobbyVisibilityButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_LobbyVisibilityButton.WBP_LobbyVisibilityButton_C.ExecuteUbergraph_WBP_LobbyVisibilityButton
// 0x0030 (0x0030 - 0x0000)
struct WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton) == 0x000008, "Wrong alignment on WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton");
static_assert(sizeof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton) == 0x000030, "Wrong size on WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton, EntryPoint) == 0x000000, "Member 'WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000020, "Member 'WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_LobbyVisibilityButton_C_ExecuteUbergraph_WBP_LobbyVisibilityButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_LobbyVisibilityButton.WBP_LobbyVisibilityButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LobbyVisibilityButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyVisibilityButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LobbyVisibilityButton_C_PreConstruct");
static_assert(sizeof(WBP_LobbyVisibilityButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_LobbyVisibilityButton_C_PreConstruct");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LobbyVisibilityButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LobbyVisibilityButton.WBP_LobbyVisibilityButton_C.SetState
// 0x0004 (0x0004 - 0x0000)
struct WBP_LobbyVisibilityButton_C_SetState final
{
public:
	int32                                         InState;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LobbyVisibilityButton_C_SetState) == 0x000004, "Wrong alignment on WBP_LobbyVisibilityButton_C_SetState");
static_assert(sizeof(WBP_LobbyVisibilityButton_C_SetState) == 0x000004, "Wrong size on WBP_LobbyVisibilityButton_C_SetState");
static_assert(offsetof(WBP_LobbyVisibilityButton_C_SetState, InState) == 0x000000, "Member 'WBP_LobbyVisibilityButton_C_SetState::InState' has a wrong offset!");

}

