#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogueWidget

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.Answer
// 0x0004 (0x0004 - 0x0000)
struct WBP_DialogueWidget_C_Answer final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_Answer) == 0x000004, "Wrong alignment on WBP_DialogueWidget_C_Answer");
static_assert(sizeof(WBP_DialogueWidget_C_Answer) == 0x000004, "Wrong size on WBP_DialogueWidget_C_Answer");
static_assert(offsetof(WBP_DialogueWidget_C_Answer, Index_0) == 0x000000, "Member 'WBP_DialogueWidget_C_Answer::Index_0' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.BPSetNPCName
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogueWidget_C_BPSetNPCName final
{
public:
	class FName                                   NPCName;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_BPSetNPCName) == 0x000004, "Wrong alignment on WBP_DialogueWidget_C_BPSetNPCName");
static_assert(sizeof(WBP_DialogueWidget_C_BPSetNPCName) == 0x000008, "Wrong size on WBP_DialogueWidget_C_BPSetNPCName");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetNPCName, NPCName) == 0x000000, "Member 'WBP_DialogueWidget_C_BPSetNPCName::NPCName' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.BPSetNPCSpeech
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogueWidget_C_BPSetNPCSpeech final
{
public:
	class FText                                   NPCSPeech_0;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_DialogueWidget_C_BPSetNPCSpeech) == 0x000008, "Wrong alignment on WBP_DialogueWidget_C_BPSetNPCSpeech");
static_assert(sizeof(WBP_DialogueWidget_C_BPSetNPCSpeech) == 0x000018, "Wrong size on WBP_DialogueWidget_C_BPSetNPCSpeech");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetNPCSpeech, NPCSPeech_0) == 0x000000, "Member 'WBP_DialogueWidget_C_BPSetNPCSpeech::NPCSPeech_0' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.BPSetPlayerAnswers
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_DialogueWidget_C_BPSetPlayerAnswers final
{
public:
	TArray<struct FGymAnswer>                     PlayerAnswers;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FGymAnswer>                     Answers;                                           // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CurrentIndex;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogueAnswer_C*                  AnswerWidget;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymAnswer                             CallFunc_Array_Get_Item;                           // 0x0060(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_DialogueAnswer_C*                  CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_BPSetPlayerAnswers) == 0x000008, "Wrong alignment on WBP_DialogueWidget_C_BPSetPlayerAnswers");
static_assert(sizeof(WBP_DialogueWidget_C_BPSetPlayerAnswers) == 0x0000B0, "Wrong size on WBP_DialogueWidget_C_BPSetPlayerAnswers");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, PlayerAnswers) == 0x000000, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::PlayerAnswers' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, Answers) == 0x000010, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::Answers' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CurrentIndex) == 0x000020, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CurrentIndex' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, AnswerWidget) == 0x000028, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::AnswerWidget' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_Divide_IntInt_ReturnValue) == 0x000030, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_Percent_IntInt_ReturnValue) == 0x000034, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_AddChildToGrid_ReturnValue) == 0x000038, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_GetChildAt_ReturnValue) == 0x000040, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, K2Node_MakeStruct_Margin) == 0x000090, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_BPSetPlayerAnswers, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'WBP_DialogueWidget_C_BPSetPlayerAnswers::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.ExecuteUbergraph_WBP_DialogueWidget
// 0x0158 (0x0158 - 0x0000)
struct WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_NPCSPeech;                            // 0x0048(0x0018)(ConstParm)
	class FName                                   K2Node_Event_NPCName;                              // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0068(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0080(0x0018)()
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0098(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x00B0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x00D0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_3;                     // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_1;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_4;                     // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0118(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_2;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GamepadUINavigate_ReturnValue_3;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0138(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget) == 0x000008, "Wrong alignment on WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget");
static_assert(sizeof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget) == 0x000158, "Wrong size on WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, EntryPoint) == 0x000000, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, Temp_bool_Variable) == 0x000004, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, Temp_byte_Variable) == 0x000005, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_Event_NPCSPeech) == 0x000048, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_Event_NPCSPeech' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_Event_NPCName) == 0x000060, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_Event_NPCName' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_Conv_NameToText_ReturnValue) == 0x000068, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000080, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_InputActionEvent_Key) == 0x000098, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_InputActionEvent_Key_1) == 0x0000B0, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_IsOpen_ReturnValue) == 0x0000C8, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_IsOpen_ReturnValue_1) == 0x0000C9, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_InputActionEvent_Key_2) == 0x0000D0, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_IsOpen_ReturnValue_2) == 0x0000E8, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_IsOpen_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_IsOpen_ReturnValue_3) == 0x0000E9, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_IsOpen_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_GetAllChildren_ReturnValue) == 0x0000F0, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_GamepadUINavigate_ReturnValue) == 0x000100, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_GamepadUINavigate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_GamepadUINavigate_ReturnValue_1) == 0x000101, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_GamepadUINavigate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_IsOpen_ReturnValue_4) == 0x000102, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_IsOpen_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_GetAllChildren_ReturnValue_1) == 0x000108, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_InputActionEvent_Key_3) == 0x000118, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_GamepadUINavigate_ReturnValue_2) == 0x000130, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_GamepadUINavigate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, CallFunc_GamepadUINavigate_ReturnValue_3) == 0x000131, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::CallFunc_GamepadUINavigate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_InputActionEvent_Key_4) == 0x000138, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_Event_bVisible) == 0x000150, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget, K2Node_Select_Default) == 0x000151, "Member 'WBP_DialogueWidget_C_ExecuteUbergraph_WBP_DialogueWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogueWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3) == 0x000008, "Wrong alignment on WBP_DialogueWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3");
static_assert(sizeof(WBP_DialogueWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3) == 0x000018, "Wrong size on WBP_DialogueWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3");
static_assert(offsetof(WBP_DialogueWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3, Key) == 0x000000, "Member 'WBP_DialogueWidget_C_InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3::Key' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogueWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2) == 0x000008, "Wrong alignment on WBP_DialogueWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2");
static_assert(sizeof(WBP_DialogueWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2) == 0x000018, "Wrong size on WBP_DialogueWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2");
static_assert(offsetof(WBP_DialogueWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2, Key) == 0x000000, "Member 'WBP_DialogueWidget_C_InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2::Key' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogueWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on WBP_DialogueWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1");
static_assert(sizeof(WBP_DialogueWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on WBP_DialogueWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1");
static_assert(offsetof(WBP_DialogueWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'WBP_DialogueWidget_C_InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogueWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on WBP_DialogueWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0");
static_assert(sizeof(WBP_DialogueWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on WBP_DialogueWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0");
static_assert(offsetof(WBP_DialogueWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'WBP_DialogueWidget_C_InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogueWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4) == 0x000008, "Wrong alignment on WBP_DialogueWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4");
static_assert(sizeof(WBP_DialogueWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4) == 0x000018, "Wrong size on WBP_DialogueWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4");
static_assert(offsetof(WBP_DialogueWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4, Key) == 0x000000, "Member 'WBP_DialogueWidget_C_InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4::Key' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.SetAnswerVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_DialogueWidget_C_SetAnswerVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_SetAnswerVisible) == 0x000001, "Wrong alignment on WBP_DialogueWidget_C_SetAnswerVisible");
static_assert(sizeof(WBP_DialogueWidget_C_SetAnswerVisible) == 0x000001, "Wrong size on WBP_DialogueWidget_C_SetAnswerVisible");
static_assert(offsetof(WBP_DialogueWidget_C_SetAnswerVisible, bVisible) == 0x000000, "Member 'WBP_DialogueWidget_C_SetAnswerVisible::bVisible' has a wrong offset!");

// Function WBP_DialogueWidget.WBP_DialogueWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_DialogueWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueWidget_C_Tick) == 0x000004, "Wrong alignment on WBP_DialogueWidget_C_Tick");
static_assert(sizeof(WBP_DialogueWidget_C_Tick) == 0x00003C, "Wrong size on WBP_DialogueWidget_C_Tick");
static_assert(offsetof(WBP_DialogueWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_DialogueWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DialogueWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_DialogueWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

