#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameModeContainer_Make

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GameModeContainer_Make.WBP_GameModeContainer_Make_C.ExecuteUbergraph_WBP_GameModeContainer_Make
// 0x0060 (0x0060 - 0x0000)
struct WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWPB_GameModeButton_Make_C* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWPB_GameModeButton_Make_C*             CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_GameModeButton_Make_C*             K2Node_CustomEvent_Button;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make) == 0x000008, "Wrong alignment on WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make");
static_assert(sizeof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make) == 0x000060, "Wrong size on WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, EntryPoint) == 0x000000, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make, K2Node_CustomEvent_Button) == 0x000058, "Member 'WBP_GameModeContainer_Make_C_ExecuteUbergraph_WBP_GameModeContainer_Make::K2Node_CustomEvent_Button' has a wrong offset!");

// Function WBP_GameModeContainer_Make.WBP_GameModeContainer_Make_C.GetSelectedGamemode
// 0x0028 (0x0028 - 0x0000)
struct WBP_GameModeContainer_Make_C_GetSelectedGamemode final
{
public:
	class FString                                 GameModeId;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_GameModeButton_Make_C*             K2Node_DynamicCast_AsWPB_Game_Mode_Button_Make;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameModeContainer_Make_C_GetSelectedGamemode) == 0x000008, "Wrong alignment on WBP_GameModeContainer_Make_C_GetSelectedGamemode");
static_assert(sizeof(WBP_GameModeContainer_Make_C_GetSelectedGamemode) == 0x000028, "Wrong size on WBP_GameModeContainer_Make_C_GetSelectedGamemode");
static_assert(offsetof(WBP_GameModeContainer_Make_C_GetSelectedGamemode, GameModeId) == 0x000000, "Member 'WBP_GameModeContainer_Make_C_GetSelectedGamemode::GameModeId' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_GetSelectedGamemode, CallFunc_GetCurrentButton_ReturnValue) == 0x000010, "Member 'WBP_GameModeContainer_Make_C_GetSelectedGamemode::CallFunc_GetCurrentButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_GetSelectedGamemode, K2Node_DynamicCast_AsWPB_Game_Mode_Button_Make) == 0x000018, "Member 'WBP_GameModeContainer_Make_C_GetSelectedGamemode::K2Node_DynamicCast_AsWPB_Game_Mode_Button_Make' has a wrong offset!");
static_assert(offsetof(WBP_GameModeContainer_Make_C_GetSelectedGamemode, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_GameModeContainer_Make_C_GetSelectedGamemode::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_GameModeContainer_Make.WBP_GameModeContainer_Make_C.Hover
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameModeContainer_Make_C_Hover final
{
public:
	class UWPB_GameModeButton_Make_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameModeContainer_Make_C_Hover) == 0x000008, "Wrong alignment on WBP_GameModeContainer_Make_C_Hover");
static_assert(sizeof(WBP_GameModeContainer_Make_C_Hover) == 0x000008, "Wrong size on WBP_GameModeContainer_Make_C_Hover");
static_assert(offsetof(WBP_GameModeContainer_Make_C_Hover, Button) == 0x000000, "Member 'WBP_GameModeContainer_Make_C_Hover::Button' has a wrong offset!");

// Function WBP_GameModeContainer_Make.WBP_GameModeContainer_Make_C.OnHoveredTabButton__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_GameModeContainer_Make_C_OnHoveredTabButton__DelegateSignature final
{
public:
	class FString                                 GamemodeData;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameModeContainer_Make_C_OnHoveredTabButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameModeContainer_Make_C_OnHoveredTabButton__DelegateSignature");
static_assert(sizeof(WBP_GameModeContainer_Make_C_OnHoveredTabButton__DelegateSignature) == 0x000010, "Wrong size on WBP_GameModeContainer_Make_C_OnHoveredTabButton__DelegateSignature");
static_assert(offsetof(WBP_GameModeContainer_Make_C_OnHoveredTabButton__DelegateSignature, GamemodeData) == 0x000000, "Member 'WBP_GameModeContainer_Make_C_OnHoveredTabButton__DelegateSignature::GamemodeData' has a wrong offset!");

}

