#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabsTopContainer_Make

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabsTopContainer_Make.WBP_TabsTopContainer_Make_C
// 0x0028 (0x0330 - 0x0308)
class UWBP_TabsTopContainer_Make_C final : public UGymGuiGenericTab
{
public:
	class UWPB_TabsTop_Make_C*                    Zero1_Levelkit_Tab_Make;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_TabsTop_Make_C*                    Zero2_Gamemode_Tab_Make;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_TabsTop_Make_C*                    Zero3_Settings_Tab_Make;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputActionUI;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputActionUI_1;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void CompleteButton(int32 Index_0);
	void LockButton(int32 Index_0);
	void UnlockButton(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TabsTopContainer_Make_C">();
	}
	static class UWBP_TabsTopContainer_Make_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabsTopContainer_Make_C>();
	}
};
static_assert(alignof(UWBP_TabsTopContainer_Make_C) == 0x000008, "Wrong alignment on UWBP_TabsTopContainer_Make_C");
static_assert(sizeof(UWBP_TabsTopContainer_Make_C) == 0x000330, "Wrong size on UWBP_TabsTopContainer_Make_C");
static_assert(offsetof(UWBP_TabsTopContainer_Make_C, Zero1_Levelkit_Tab_Make) == 0x000308, "Member 'UWBP_TabsTopContainer_Make_C::Zero1_Levelkit_Tab_Make' has a wrong offset!");
static_assert(offsetof(UWBP_TabsTopContainer_Make_C, Zero2_Gamemode_Tab_Make) == 0x000310, "Member 'UWBP_TabsTopContainer_Make_C::Zero2_Gamemode_Tab_Make' has a wrong offset!");
static_assert(offsetof(UWBP_TabsTopContainer_Make_C, Zero3_Settings_Tab_Make) == 0x000318, "Member 'UWBP_TabsTopContainer_Make_C::Zero3_Settings_Tab_Make' has a wrong offset!");
static_assert(offsetof(UWBP_TabsTopContainer_Make_C, InputActionUI) == 0x000320, "Member 'UWBP_TabsTopContainer_Make_C::InputActionUI' has a wrong offset!");
static_assert(offsetof(UWBP_TabsTopContainer_Make_C, InputActionUI_1) == 0x000328, "Member 'UWBP_TabsTopContainer_Make_C::InputActionUI_1' has a wrong offset!");

}

