#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_ArrowRight

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Button_ArrowRight.WBP_Button_ArrowRight_C.ExecuteUbergraph_WBP_Button_ArrowRight
// 0x0028 (0x0028 - 0x0000)
struct WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight) == 0x000008, "Wrong alignment on WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight");
static_assert(sizeof(WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight) == 0x000028, "Wrong size on WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight");
static_assert(offsetof(WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight, EntryPoint) == 0x000000, "Member 'WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight, K2Node_Event_IsDesignTime) == 0x000011, "Member 'WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'WBP_Button_ArrowRight_C_ExecuteUbergraph_WBP_Button_ArrowRight::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_Button_ArrowRight.WBP_Button_ArrowRight_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Button_ArrowRight_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_ArrowRight_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Button_ArrowRight_C_PreConstruct");
static_assert(sizeof(WBP_Button_ArrowRight_C_PreConstruct) == 0x000001, "Wrong size on WBP_Button_ArrowRight_C_PreConstruct");
static_assert(offsetof(WBP_Button_ArrowRight_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Button_ArrowRight_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

