#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MetaPropertySetting

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MetaPropertySetting.WBP_MetaPropertySetting_C.ExecuteUbergraph_WBP_MetaPropertySetting
// 0x0050 (0x0050 - 0x0000)
struct WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0034(0x0014)()
	class UTextBlock*                             K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting) == 0x000008, "Wrong alignment on WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting");
static_assert(sizeof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting) == 0x000050, "Wrong size on WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, EntryPoint) == 0x000000, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, Temp_int_Variable) == 0x000018, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, CallFunc_Percent_IntInt_ReturnValue) == 0x000024, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, CallFunc_SelectInt_ReturnValue) == 0x00002C, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, CallFunc_SelectInt_ReturnValue_1) == 0x000030, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, K2Node_MakeStruct_SlateColor_1) == 0x000034, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting, K2Node_Select_Default) == 0x000048, "Member 'WBP_MetaPropertySetting_C_ExecuteUbergraph_WBP_MetaPropertySetting::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MetaPropertySetting.WBP_MetaPropertySetting_C.SetColors
// 0x00A4 (0x00A4 - 0x0000)
struct WBP_MetaPropertySetting_C_SetColors final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MetaPropertySetting_C_SetColors) == 0x000004, "Wrong alignment on WBP_MetaPropertySetting_C_SetColors");
static_assert(sizeof(WBP_MetaPropertySetting_C_SetColors) == 0x0000A4, "Wrong size on WBP_MetaPropertySetting_C_SetColors");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_struct_Variable) == 0x000000, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_bool_Variable) == 0x000020, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_struct_Variable_2) == 0x000024, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_struct_Variable_3) == 0x000034, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_bool_Variable_1) == 0x000044, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_struct_Variable_4) == 0x000048, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_struct_Variable_5) == 0x000058, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, Temp_bool_Variable_2) == 0x000068, "Member 'WBP_MetaPropertySetting_C_SetColors::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000069, "Member 'WBP_MetaPropertySetting_C_SetColors::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00006A, "Member 'WBP_MetaPropertySetting_C_SetColors::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, CallFunc_BooleanAND_ReturnValue) == 0x00006B, "Member 'WBP_MetaPropertySetting_C_SetColors::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, CallFunc_BooleanAND_ReturnValue_1) == 0x00006C, "Member 'WBP_MetaPropertySetting_C_SetColors::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, K2Node_Select_Default) == 0x000070, "Member 'WBP_MetaPropertySetting_C_SetColors::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, K2Node_Select_Default_1) == 0x000080, "Member 'WBP_MetaPropertySetting_C_SetColors::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000090, "Member 'WBP_MetaPropertySetting_C_SetColors::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, CallFunc_BooleanAND_ReturnValue_2) == 0x000091, "Member 'WBP_MetaPropertySetting_C_SetColors::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MetaPropertySetting_C_SetColors, K2Node_Select_Default_2) == 0x000094, "Member 'WBP_MetaPropertySetting_C_SetColors::K2Node_Select_Default_2' has a wrong offset!");

}

