#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TournamentEntrySlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TournamentEntrySlot.WBP_TournamentEntrySlot_C
// 0x0028 (0x02E8 - 0x02C0)
class UWBP_TournamentEntrySlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       TitleText;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TournamentEntrySlot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TournamentEntrySlot_C">();
	}
	static class UWBP_TournamentEntrySlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TournamentEntrySlot_C>();
	}
};
static_assert(alignof(UWBP_TournamentEntrySlot_C) == 0x000008, "Wrong alignment on UWBP_TournamentEntrySlot_C");
static_assert(sizeof(UWBP_TournamentEntrySlot_C) == 0x0002E8, "Wrong size on UWBP_TournamentEntrySlot_C");
static_assert(offsetof(UWBP_TournamentEntrySlot_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_TournamentEntrySlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TournamentEntrySlot_C, TitleText) == 0x0002C8, "Member 'UWBP_TournamentEntrySlot_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_TournamentEntrySlot_C, Title) == 0x0002D0, "Member 'UWBP_TournamentEntrySlot_C::Title' has a wrong offset!");

}

