#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RemixOriginalCreatorTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RemixOriginalCreatorTag.WBP_RemixOriginalCreatorTag_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_RemixOriginalCreatorTag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CreatorName;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Remix;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OriginalCreator;                                   // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_RemixOriginalCreatorTag(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetOriginalDetails(const struct FGymMapOriginalDetails& Details);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RemixOriginalCreatorTag_C">();
	}
	static class UWBP_RemixOriginalCreatorTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RemixOriginalCreatorTag_C>();
	}
};
static_assert(alignof(UWBP_RemixOriginalCreatorTag_C) == 0x000008, "Wrong alignment on UWBP_RemixOriginalCreatorTag_C");
static_assert(sizeof(UWBP_RemixOriginalCreatorTag_C) == 0x0002F0, "Wrong size on UWBP_RemixOriginalCreatorTag_C");
static_assert(offsetof(UWBP_RemixOriginalCreatorTag_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_RemixOriginalCreatorTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RemixOriginalCreatorTag_C, CreatorName) == 0x0002C8, "Member 'UWBP_RemixOriginalCreatorTag_C::CreatorName' has a wrong offset!");
static_assert(offsetof(UWBP_RemixOriginalCreatorTag_C, Remix) == 0x0002D0, "Member 'UWBP_RemixOriginalCreatorTag_C::Remix' has a wrong offset!");
static_assert(offsetof(UWBP_RemixOriginalCreatorTag_C, OriginalCreator) == 0x0002D8, "Member 'UWBP_RemixOriginalCreatorTag_C::OriginalCreator' has a wrong offset!");

}

