#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayMenuFeaturedButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayMenuFeaturedButton.WBP_PlayMenuFeaturedButton_C
// 0x0090 (0x0378 - 0x02E8)
class UWBP_PlayMenuFeaturedButton_C final : public UGymGuiGenericButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Push;                                              // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FeaturedImage;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FeatureName;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverColor;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerCount;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Spinner;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   FeatureText;                                       // 0x0338(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   PlayerNum;                                         // 0x0350(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             LogoTexture;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundTexture;                                 // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlayMenuFeaturedButton_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PlayMenuFeaturedButton_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_PlayMenuFeaturedButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetProcessing(bool Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayMenuFeaturedButton_C">();
	}
	static class UWBP_PlayMenuFeaturedButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayMenuFeaturedButton_C>();
	}
};
static_assert(alignof(UWBP_PlayMenuFeaturedButton_C) == 0x000008, "Wrong alignment on UWBP_PlayMenuFeaturedButton_C");
static_assert(sizeof(UWBP_PlayMenuFeaturedButton_C) == 0x000378, "Wrong size on UWBP_PlayMenuFeaturedButton_C");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_PlayMenuFeaturedButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, HoverAnim) == 0x0002F0, "Member 'UWBP_PlayMenuFeaturedButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, Push) == 0x0002F8, "Member 'UWBP_PlayMenuFeaturedButton_C::Push' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, FeaturedImage) == 0x000300, "Member 'UWBP_PlayMenuFeaturedButton_C::FeaturedImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, FeatureName) == 0x000308, "Member 'UWBP_PlayMenuFeaturedButton_C::FeatureName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, HoverColor) == 0x000310, "Member 'UWBP_PlayMenuFeaturedButton_C::HoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, Icon) == 0x000318, "Member 'UWBP_PlayMenuFeaturedButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, Image_6) == 0x000320, "Member 'UWBP_PlayMenuFeaturedButton_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, PlayerCount) == 0x000328, "Member 'UWBP_PlayMenuFeaturedButton_C::PlayerCount' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, Spinner) == 0x000330, "Member 'UWBP_PlayMenuFeaturedButton_C::Spinner' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, FeatureText) == 0x000338, "Member 'UWBP_PlayMenuFeaturedButton_C::FeatureText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, PlayerNum) == 0x000350, "Member 'UWBP_PlayMenuFeaturedButton_C::PlayerNum' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, LogoTexture) == 0x000368, "Member 'UWBP_PlayMenuFeaturedButton_C::LogoTexture' has a wrong offset!");
static_assert(offsetof(UWBP_PlayMenuFeaturedButton_C, BackgroundTexture) == 0x000370, "Member 'UWBP_PlayMenuFeaturedButton_C::BackgroundTexture' has a wrong offset!");

}

