#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LevelKitContainer_Make

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LevelKitContainer_Make.WBP_LevelKitContainer_Make_C
// 0x0030 (0x0338 - 0x0308)
class UWBP_LevelKitContainer_Make_C final : public UGymGuiGenericTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             ScrollBox_0;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHoveredTabButton;                                // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhoveredTabButton;                              // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LevelKitContainer_Make(int32 EntryPoint);
	void GetSelectedKit(struct FKitData* KitData);
	void HoverEvent(class UWPB_LevelkitButton_Make_C* Button);
	void OnHoveredTabButton__DelegateSignature(const struct FKitData& KitData);
	void OnUnhoveredButton_Event();
	void OnUnhoveredTabButton__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void ScrollToview(class UWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LevelKitContainer_Make_C">();
	}
	static class UWBP_LevelKitContainer_Make_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LevelKitContainer_Make_C>();
	}
};
static_assert(alignof(UWBP_LevelKitContainer_Make_C) == 0x000008, "Wrong alignment on UWBP_LevelKitContainer_Make_C");
static_assert(sizeof(UWBP_LevelKitContainer_Make_C) == 0x000338, "Wrong size on UWBP_LevelKitContainer_Make_C");
static_assert(offsetof(UWBP_LevelKitContainer_Make_C, UberGraphFrame) == 0x000308, "Member 'UWBP_LevelKitContainer_Make_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LevelKitContainer_Make_C, ScrollBox_0) == 0x000310, "Member 'UWBP_LevelKitContainer_Make_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_LevelKitContainer_Make_C, OnHoveredTabButton) == 0x000318, "Member 'UWBP_LevelKitContainer_Make_C::OnHoveredTabButton' has a wrong offset!");
static_assert(offsetof(UWBP_LevelKitContainer_Make_C, OnUnhoveredTabButton) == 0x000328, "Member 'UWBP_LevelKitContainer_Make_C::OnUnhoveredTabButton' has a wrong offset!");

}

