#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TaskListElementXL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TaskListElementXL.WBP_TaskListElementXL_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_TaskListElementXL_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       GoalsListItem;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overline;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayText;                                       // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Completed;                                         // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TaskListElementXL(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TaskListElementXL_C">();
	}
	static class UWBP_TaskListElementXL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TaskListElementXL_C>();
	}
};
static_assert(alignof(UWBP_TaskListElementXL_C) == 0x000008, "Wrong alignment on UWBP_TaskListElementXL_C");
static_assert(sizeof(UWBP_TaskListElementXL_C) == 0x0002F8, "Wrong size on UWBP_TaskListElementXL_C");
static_assert(offsetof(UWBP_TaskListElementXL_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_TaskListElementXL_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TaskListElementXL_C, GoalsListItem) == 0x0002C8, "Member 'UWBP_TaskListElementXL_C::GoalsListItem' has a wrong offset!");
static_assert(offsetof(UWBP_TaskListElementXL_C, Overline) == 0x0002D0, "Member 'UWBP_TaskListElementXL_C::Overline' has a wrong offset!");
static_assert(offsetof(UWBP_TaskListElementXL_C, DisplayText) == 0x0002D8, "Member 'UWBP_TaskListElementXL_C::DisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_TaskListElementXL_C, Completed) == 0x0002F0, "Member 'UWBP_TaskListElementXL_C::Completed' has a wrong offset!");

}

