#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymMasterRuleState

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GymMasterRuleState.WBP_GymMasterRuleState_C.AddRuleStateWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GymMasterRuleState_C_AddRuleStateWidget final
{
public:
	class UGymGuiRuleStateWidget*                 Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymMasterRuleState_C_AddRuleStateWidget) == 0x000008, "Wrong alignment on WBP_GymMasterRuleState_C_AddRuleStateWidget");
static_assert(sizeof(WBP_GymMasterRuleState_C_AddRuleStateWidget) == 0x000008, "Wrong size on WBP_GymMasterRuleState_C_AddRuleStateWidget");
static_assert(offsetof(WBP_GymMasterRuleState_C_AddRuleStateWidget, Widget) == 0x000000, "Member 'WBP_GymMasterRuleState_C_AddRuleStateWidget::Widget' has a wrong offset!");

// Function WBP_GymMasterRuleState.WBP_GymMasterRuleState_C.ExecuteUbergraph_WBP_GymMasterRuleState
// 0x0068 (0x0068 - 0x0000)
struct WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0008(0x0020)(NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_Event_Text;                                 // 0x0038(0x0018)(ConstParm)
	class UGymGuiRuleStateWidget*                 K2Node_Event_Widget;                               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState) == 0x000008, "Wrong alignment on WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState");
static_assert(sizeof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState) == 0x000068, "Wrong size on WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState");
static_assert(offsetof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState, EntryPoint) == 0x000000, "Member 'WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState, K2Node_MakeStruct_Anchors) == 0x000008, "Member 'WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState, K2Node_MakeStruct_Margin) == 0x000028, "Member 'WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState, K2Node_Event_Text) == 0x000038, "Member 'WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState, K2Node_Event_Widget) == 0x000050, "Member 'WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState, CallFunc_AddChildToCanvas_ReturnValue) == 0x000060, "Member 'WBP_GymMasterRuleState_C_ExecuteUbergraph_WBP_GymMasterRuleState::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function WBP_GymMasterRuleState.WBP_GymMasterRuleState_C.ShowRuleInfoText
// 0x0018 (0x0018 - 0x0000)
struct WBP_GymMasterRuleState_C_ShowRuleInfoText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_GymMasterRuleState_C_ShowRuleInfoText) == 0x000008, "Wrong alignment on WBP_GymMasterRuleState_C_ShowRuleInfoText");
static_assert(sizeof(WBP_GymMasterRuleState_C_ShowRuleInfoText) == 0x000018, "Wrong size on WBP_GymMasterRuleState_C_ShowRuleInfoText");
static_assert(offsetof(WBP_GymMasterRuleState_C_ShowRuleInfoText, Text) == 0x000000, "Member 'WBP_GymMasterRuleState_C_ShowRuleInfoText::Text' has a wrong offset!");

}

