#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymRuleStateWidgetCircuit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GymRuleStateWidgetCircuit.WBP_GymRuleStateWidgetCircuit_C
// 0x00A0 (0x03E0 - 0x0340)
class UWBP_GymRuleStateWidgetCircuit_C final : public UGymGuiRuleStateWidgetCircuit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowStatusPanel;                                   // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CheckpointBrushBG;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckpointCounter_WBP_C*               CheckpointCounter_WBP;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGymGuiPostflow_BP_C*                   GymGuiPostflow;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LapText;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LaurelIcon;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RankingContainer;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RankingText;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RuleStatusText;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimerBrushBG;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RoyaleQualified_C*                 WBP_RoyaleQualified;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGymRuleParticipantState                      LastRuleStatus;                                    // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCircuitReplicatedData*              RuleData;                                          // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        RunningStartTime;                                  // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGymParticipantRepDataCircuit*          ParticipantData;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   PlayerController;                                  // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   NewVar;                                            // 0x03C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GymRuleStateWidgetCircuit(int32 EntryPoint);
	void OnEliminated(const EEliminationReason EliminationReason);
	void OnFinished(bool bIsRoyale);
	void SetLapText();
	void SetRankingText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TickParticipantAndRule();
	void TickUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GymRuleStateWidgetCircuit_C">();
	}
	static class UWBP_GymRuleStateWidgetCircuit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GymRuleStateWidgetCircuit_C>();
	}
};
static_assert(alignof(UWBP_GymRuleStateWidgetCircuit_C) == 0x000008, "Wrong alignment on UWBP_GymRuleStateWidgetCircuit_C");
static_assert(sizeof(UWBP_GymRuleStateWidgetCircuit_C) == 0x0003E0, "Wrong size on UWBP_GymRuleStateWidgetCircuit_C");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, UberGraphFrame) == 0x000340, "Member 'UWBP_GymRuleStateWidgetCircuit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, ShowStatusPanel) == 0x000348, "Member 'UWBP_GymRuleStateWidgetCircuit_C::ShowStatusPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, CheckpointBrushBG) == 0x000350, "Member 'UWBP_GymRuleStateWidgetCircuit_C::CheckpointBrushBG' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, CheckpointCounter_WBP) == 0x000358, "Member 'UWBP_GymRuleStateWidgetCircuit_C::CheckpointCounter_WBP' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, GymGuiPostflow) == 0x000360, "Member 'UWBP_GymRuleStateWidgetCircuit_C::GymGuiPostflow' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, LapText) == 0x000368, "Member 'UWBP_GymRuleStateWidgetCircuit_C::LapText' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, LaurelIcon) == 0x000370, "Member 'UWBP_GymRuleStateWidgetCircuit_C::LaurelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, RankingContainer) == 0x000378, "Member 'UWBP_GymRuleStateWidgetCircuit_C::RankingContainer' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, RankingText) == 0x000380, "Member 'UWBP_GymRuleStateWidgetCircuit_C::RankingText' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, RuleStatusText) == 0x000388, "Member 'UWBP_GymRuleStateWidgetCircuit_C::RuleStatusText' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, TimerBrushBG) == 0x000390, "Member 'UWBP_GymRuleStateWidgetCircuit_C::TimerBrushBG' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, WBP_RoyaleQualified) == 0x000398, "Member 'UWBP_GymRuleStateWidgetCircuit_C::WBP_RoyaleQualified' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, LastRuleStatus) == 0x0003A0, "Member 'UWBP_GymRuleStateWidgetCircuit_C::LastRuleStatus' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, RuleData) == 0x0003A8, "Member 'UWBP_GymRuleStateWidgetCircuit_C::RuleData' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, RunningStartTime) == 0x0003B0, "Member 'UWBP_GymRuleStateWidgetCircuit_C::RunningStartTime' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, ParticipantData) == 0x0003B8, "Member 'UWBP_GymRuleStateWidgetCircuit_C::ParticipantData' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, PlayerController) == 0x0003C0, "Member 'UWBP_GymRuleStateWidgetCircuit_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetCircuit_C, NewVar) == 0x0003C8, "Member 'UWBP_GymRuleStateWidgetCircuit_C::NewVar' has a wrong offset!");

}

