#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlaymenuButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PlaymenuButton.WBP_PlaymenuButton_C.ExecuteUbergraph_WBP_PlaymenuButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton) == 0x000008, "Wrong alignment on WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton");
static_assert(sizeof(WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton) == 0x000020, "Wrong size on WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton");
static_assert(offsetof(WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton, EntryPoint) == 0x000000, "Member 'WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_PlaymenuButton_C_ExecuteUbergraph_WBP_PlaymenuButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_PlaymenuButton.WBP_PlaymenuButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlaymenuButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlaymenuButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PlaymenuButton_C_PreConstruct");
static_assert(sizeof(WBP_PlaymenuButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_PlaymenuButton_C_PreConstruct");
static_assert(offsetof(WBP_PlaymenuButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PlaymenuButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PlaymenuButton.WBP_PlaymenuButton_C.SetContentText
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlaymenuButton_C_SetContentText final
{
public:
	class FText                                   ContentText_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PlaymenuButton_C_SetContentText) == 0x000008, "Wrong alignment on WBP_PlaymenuButton_C_SetContentText");
static_assert(sizeof(WBP_PlaymenuButton_C_SetContentText) == 0x000018, "Wrong size on WBP_PlaymenuButton_C_SetContentText");
static_assert(offsetof(WBP_PlaymenuButton_C_SetContentText, ContentText_0) == 0x000000, "Member 'WBP_PlaymenuButton_C_SetContentText::ContentText_0' has a wrong offset!");

}

