#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameModeInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameModeInfo.WBP_GameModeInfo_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_GameModeInfo_C final : public UUserWidget
{
public:
	class UCommonRichTextBlock*                   CommonRichTextBlock_85;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    GameModeName;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_184;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Setup(const struct FRuleDisplayInfo& GamemodeData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameModeInfo_C">();
	}
	static class UWBP_GameModeInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameModeInfo_C>();
	}
};
static_assert(alignof(UWBP_GameModeInfo_C) == 0x000008, "Wrong alignment on UWBP_GameModeInfo_C");
static_assert(sizeof(UWBP_GameModeInfo_C) == 0x0002E0, "Wrong size on UWBP_GameModeInfo_C");
static_assert(offsetof(UWBP_GameModeInfo_C, CommonRichTextBlock_85) == 0x0002C0, "Member 'UWBP_GameModeInfo_C::CommonRichTextBlock_85' has a wrong offset!");
static_assert(offsetof(UWBP_GameModeInfo_C, GameModeIcon) == 0x0002C8, "Member 'UWBP_GameModeInfo_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GameModeInfo_C, GameModeName) == 0x0002D0, "Member 'UWBP_GameModeInfo_C::GameModeName' has a wrong offset!");
static_assert(offsetof(UWBP_GameModeInfo_C, Image_184) == 0x0002D8, "Member 'UWBP_GameModeInfo_C::Image_184' has a wrong offset!");

}

