#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabsTopContainer_Make

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TabsTopContainer_Make.WBP_TabsTopContainer_Make_C.CompleteButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_TabsTopContainer_Make_C_CompleteButton final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_TabsTop_Make_C*                    K2Node_DynamicCast_AsWPB_Tabs_Top_Make;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TabsTopContainer_Make_C_CompleteButton) == 0x000008, "Wrong alignment on WBP_TabsTopContainer_Make_C_CompleteButton");
static_assert(sizeof(WBP_TabsTopContainer_Make_C_CompleteButton) == 0x000020, "Wrong size on WBP_TabsTopContainer_Make_C_CompleteButton");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_CompleteButton, Index_0) == 0x000000, "Member 'WBP_TabsTopContainer_Make_C_CompleteButton::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_CompleteButton, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_TabsTopContainer_Make_C_CompleteButton::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_CompleteButton, K2Node_DynamicCast_AsWPB_Tabs_Top_Make) == 0x000010, "Member 'WBP_TabsTopContainer_Make_C_CompleteButton::K2Node_DynamicCast_AsWPB_Tabs_Top_Make' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_CompleteButton, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TabsTopContainer_Make_C_CompleteButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TabsTopContainer_Make.WBP_TabsTopContainer_Make_C.LockButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_TabsTopContainer_Make_C_LockButton final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_TabsTop_Make_C*                    K2Node_DynamicCast_AsWPB_Tabs_Top_Make;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TabsTopContainer_Make_C_LockButton) == 0x000008, "Wrong alignment on WBP_TabsTopContainer_Make_C_LockButton");
static_assert(sizeof(WBP_TabsTopContainer_Make_C_LockButton) == 0x000020, "Wrong size on WBP_TabsTopContainer_Make_C_LockButton");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_LockButton, Index_0) == 0x000000, "Member 'WBP_TabsTopContainer_Make_C_LockButton::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_LockButton, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_TabsTopContainer_Make_C_LockButton::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_LockButton, K2Node_DynamicCast_AsWPB_Tabs_Top_Make) == 0x000010, "Member 'WBP_TabsTopContainer_Make_C_LockButton::K2Node_DynamicCast_AsWPB_Tabs_Top_Make' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_LockButton, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TabsTopContainer_Make_C_LockButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TabsTopContainer_Make.WBP_TabsTopContainer_Make_C.UnlockButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_TabsTopContainer_Make_C_UnlockButton final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_TabsTop_Make_C*                    K2Node_DynamicCast_AsWPB_Tabs_Top_Make;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TabsTopContainer_Make_C_UnlockButton) == 0x000008, "Wrong alignment on WBP_TabsTopContainer_Make_C_UnlockButton");
static_assert(sizeof(WBP_TabsTopContainer_Make_C_UnlockButton) == 0x000020, "Wrong size on WBP_TabsTopContainer_Make_C_UnlockButton");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_UnlockButton, Index_0) == 0x000000, "Member 'WBP_TabsTopContainer_Make_C_UnlockButton::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_UnlockButton, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_TabsTopContainer_Make_C_UnlockButton::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_UnlockButton, K2Node_DynamicCast_AsWPB_Tabs_Top_Make) == 0x000010, "Member 'WBP_TabsTopContainer_Make_C_UnlockButton::K2Node_DynamicCast_AsWPB_Tabs_Top_Make' has a wrong offset!");
static_assert(offsetof(WBP_TabsTopContainer_Make_C_UnlockButton, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TabsTopContainer_Make_C_UnlockButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

