#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Credits_MakeaGames

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Credits_MakeaGames.WBP_Credits_MakeaGames_C
// 0x0040 (0x0300 - 0x02C0)
class UWBP_Credits_MakeaGames_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_113;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_1;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_122;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ScrollSpeed;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastScroll;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Credits_MakeaGames(int32 EntryPoint);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpAxisEvt_UIGamepadScroll_K2Node_InputAxisEvent_0(float AxisValue);
	void OnInitialized();
	void OnVisibilityChanged_Event(ESlateVisibility InVisibility);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Credits_MakeaGames_C">();
	}
	static class UWBP_Credits_MakeaGames_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Credits_MakeaGames_C>();
	}
};
static_assert(alignof(UWBP_Credits_MakeaGames_C) == 0x000008, "Wrong alignment on UWBP_Credits_MakeaGames_C");
static_assert(sizeof(UWBP_Credits_MakeaGames_C) == 0x000300, "Wrong size on UWBP_Credits_MakeaGames_C");
static_assert(offsetof(UWBP_Credits_MakeaGames_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Credits_MakeaGames_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Credits_MakeaGames_C, Image_113) == 0x0002C8, "Member 'UWBP_Credits_MakeaGames_C::Image_113' has a wrong offset!");
static_assert(offsetof(UWBP_Credits_MakeaGames_C, RichTextBlock) == 0x0002D0, "Member 'UWBP_Credits_MakeaGames_C::RichTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_Credits_MakeaGames_C, RichTextBlock_1) == 0x0002D8, "Member 'UWBP_Credits_MakeaGames_C::RichTextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_Credits_MakeaGames_C, RichTextBlock_122) == 0x0002E0, "Member 'UWBP_Credits_MakeaGames_C::RichTextBlock_122' has a wrong offset!");
static_assert(offsetof(UWBP_Credits_MakeaGames_C, ScrollBox_0) == 0x0002E8, "Member 'UWBP_Credits_MakeaGames_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Credits_MakeaGames_C, ScrollSpeed) == 0x0002F0, "Member 'UWBP_Credits_MakeaGames_C::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_Credits_MakeaGames_C, LastScroll) == 0x0002F8, "Member 'UWBP_Credits_MakeaGames_C::LastScroll' has a wrong offset!");

}

