#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RemixOriginalCreatorTagMinusSmall

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function WBP_RemixOriginalCreatorTag-Small.WBP_RemixOriginalCreatorTag-Small_C.ExecuteUbergraph_WBP_RemixOriginalCreatorTag-Small
// 0x0088 (0x0088 - 0x0000)
struct WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymMapOriginalDetails                 K2Node_CustomEvent_Details;                        // 0x0008(0x0040)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	class FString                                 K2Node_CustomEvent_Name;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0070(0x0018)()
};
static_assert(alignof(WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall) == 0x000008, "Wrong alignment on WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall");
static_assert(sizeof(WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall) == 0x000088, "Wrong size on WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall, EntryPoint) == 0x000000, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall, K2Node_CustomEvent_Details) == 0x000008, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall, K2Node_CustomEvent_Name) == 0x000060, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000070, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTagMinusSmall::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_RemixOriginalCreatorTag-Small.WBP_RemixOriginalCreatorTag-Small_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RemixOriginalCreatorTagMinusSmall_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RemixOriginalCreatorTagMinusSmall_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RemixOriginalCreatorTagMinusSmall_C_PreConstruct");
static_assert(sizeof(WBP_RemixOriginalCreatorTagMinusSmall_C_PreConstruct) == 0x000001, "Wrong size on WBP_RemixOriginalCreatorTagMinusSmall_C_PreConstruct");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RemixOriginalCreatorTag-Small.WBP_RemixOriginalCreatorTag-Small_C.SetName
// 0x0010 (0x0010 - 0x0000)
struct WBP_RemixOriginalCreatorTagMinusSmall_C_SetName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RemixOriginalCreatorTagMinusSmall_C_SetName) == 0x000008, "Wrong alignment on WBP_RemixOriginalCreatorTagMinusSmall_C_SetName");
static_assert(sizeof(WBP_RemixOriginalCreatorTagMinusSmall_C_SetName) == 0x000010, "Wrong size on WBP_RemixOriginalCreatorTagMinusSmall_C_SetName");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_SetName, Name_0) == 0x000000, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_SetName::Name_0' has a wrong offset!");

// Function WBP_RemixOriginalCreatorTag-Small.WBP_RemixOriginalCreatorTag-Small_C.SetOriginalDetails
// 0x0040 (0x0040 - 0x0000)
struct WBP_RemixOriginalCreatorTagMinusSmall_C_SetOriginalDetails final
{
public:
	struct FGymMapOriginalDetails                 Details;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RemixOriginalCreatorTagMinusSmall_C_SetOriginalDetails) == 0x000008, "Wrong alignment on WBP_RemixOriginalCreatorTagMinusSmall_C_SetOriginalDetails");
static_assert(sizeof(WBP_RemixOriginalCreatorTagMinusSmall_C_SetOriginalDetails) == 0x000040, "Wrong size on WBP_RemixOriginalCreatorTagMinusSmall_C_SetOriginalDetails");
static_assert(offsetof(WBP_RemixOriginalCreatorTagMinusSmall_C_SetOriginalDetails, Details) == 0x000000, "Member 'WBP_RemixOriginalCreatorTagMinusSmall_C_SetOriginalDetails::Details' has a wrong offset!");

}

