#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FadeInUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_FadeInUI.WBP_FadeInUI_C.ExecuteUbergraph_WBP_FadeInUI
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadeInTime;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadedTime;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadeOutTime;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Layer;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FadeContentBase_C*                 K2Node_DynamicCast_AsWBP_Fade_Content_Base;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnFadeBegin_FadeDuration_ImplicitCast;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI) == 0x000008, "Wrong alignment on WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI");
static_assert(sizeof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI) == 0x0000A0, "Wrong size on WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, EntryPoint) == 0x000000, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, K2Node_Event_FadeInTime) == 0x000004, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::K2Node_Event_FadeInTime' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, K2Node_Event_FadedTime) == 0x000008, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::K2Node_Event_FadedTime' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, K2Node_Event_FadeOutTime) == 0x00000C, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::K2Node_Event_FadeOutTime' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, K2Node_Event_Layer) == 0x000010, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::K2Node_Event_Layer' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_GetChildrenCount_ReturnValue) == 0x000040, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_GetActiveWidget_ReturnValue) == 0x000048, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Percent_IntInt_ReturnValue) == 0x000050, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, K2Node_DynamicCast_AsWBP_Fade_Content_Base) == 0x000058, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::K2Node_DynamicCast_AsWBP_Fade_Content_Base' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000068, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_OnFadeBegin_FadeDuration_ImplicitCast) == 0x000080, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_OnFadeBegin_FadeDuration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000088, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000090, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast) == 0x000098, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast) == 0x00009C, "Member 'WBP_FadeInUI_C_ExecuteUbergraph_WBP_FadeInUI::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_FadeInUI.WBP_FadeInUI_C.Fade
// 0x0010 (0x0010 - 0x0000)
struct WBP_FadeInUI_C_Fade final
{
public:
	float                                         FadeInTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadedTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Layer;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FadeInUI_C_Fade) == 0x000004, "Wrong alignment on WBP_FadeInUI_C_Fade");
static_assert(sizeof(WBP_FadeInUI_C_Fade) == 0x000010, "Wrong size on WBP_FadeInUI_C_Fade");
static_assert(offsetof(WBP_FadeInUI_C_Fade, FadeInTime) == 0x000000, "Member 'WBP_FadeInUI_C_Fade::FadeInTime' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_Fade, FadedTime) == 0x000004, "Member 'WBP_FadeInUI_C_Fade::FadedTime' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_Fade, FadeOutTime) == 0x000008, "Member 'WBP_FadeInUI_C_Fade::FadeOutTime' has a wrong offset!");
static_assert(offsetof(WBP_FadeInUI_C_Fade, Layer) == 0x00000C, "Member 'WBP_FadeInUI_C_Fade::Layer' has a wrong offset!");

}

