#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymChatMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_GymChatMessage.WBP_GymChatMessage_C.ExecuteUbergraph_WBP_GymChatMessage
// 0x0148 (0x0148 - 0x0000)
struct WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage) == 0x000008, "Wrong alignment on WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage");
static_assert(sizeof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage) == 0x000148, "Wrong size on WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, EntryPoint) == 0x000000, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000020, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, K2Node_MakeArray_Array) == 0x0000D8, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000110, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, K2Node_CreateDelegate_OutputDelegate_2) == 0x000120, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000130, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, CallFunc_GetTimeSeconds_ReturnValue) == 0x000138, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage, CallFunc_GetBoolCVar_ReturnValue) == 0x000140, "Member 'WBP_GymChatMessage_C_ExecuteUbergraph_WBP_GymChatMessage::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");

// Function WBP_GymChatMessage.WBP_GymChatMessage_C.OnChatClosed
// 0x0038 (0x0038 - 0x0000)
struct WBP_GymChatMessage_C_OnChatClosed final
{
public:
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymChatMessage_C_OnChatClosed) == 0x000008, "Wrong alignment on WBP_GymChatMessage_C_OnChatClosed");
static_assert(sizeof(WBP_GymChatMessage_C_OnChatClosed) == 0x000038, "Wrong size on WBP_GymChatMessage_C_OnChatClosed");
static_assert(offsetof(WBP_GymChatMessage_C_OnChatClosed, CallFunc_GetBoolCVar_ReturnValue) == 0x000000, "Member 'WBP_GymChatMessage_C_OnChatClosed::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_OnChatClosed, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_GymChatMessage_C_OnChatClosed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_OnChatClosed, CallFunc_GetTimeSeconds_ReturnValue) == 0x000008, "Member 'WBP_GymChatMessage_C_OnChatClosed::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_OnChatClosed, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_GymChatMessage_C_OnChatClosed::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_OnChatClosed, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_GymChatMessage_C_OnChatClosed::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_OnChatClosed, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_GymChatMessage_C_OnChatClosed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_OnChatClosed, CallFunc_BooleanOR_ReturnValue) == 0x00002C, "Member 'WBP_GymChatMessage_C_OnChatClosed::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GymChatMessage_C_OnChatClosed, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_GymChatMessage_C_OnChatClosed::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_GymChatMessage.WBP_GymChatMessage_C.PlayFadeBackForward
// 0x0008 (0x0008 - 0x0000)
struct WBP_GymChatMessage_C_PlayFadeBackForward final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymChatMessage_C_PlayFadeBackForward) == 0x000008, "Wrong alignment on WBP_GymChatMessage_C_PlayFadeBackForward");
static_assert(sizeof(WBP_GymChatMessage_C_PlayFadeBackForward) == 0x000008, "Wrong size on WBP_GymChatMessage_C_PlayFadeBackForward");
static_assert(offsetof(WBP_GymChatMessage_C_PlayFadeBackForward, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_GymChatMessage_C_PlayFadeBackForward::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_GymChatMessage.WBP_GymChatMessage_C.PlayFadeBackReverse
// 0x0008 (0x0008 - 0x0000)
struct WBP_GymChatMessage_C_PlayFadeBackReverse final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymChatMessage_C_PlayFadeBackReverse) == 0x000008, "Wrong alignment on WBP_GymChatMessage_C_PlayFadeBackReverse");
static_assert(sizeof(WBP_GymChatMessage_C_PlayFadeBackReverse) == 0x000008, "Wrong size on WBP_GymChatMessage_C_PlayFadeBackReverse");
static_assert(offsetof(WBP_GymChatMessage_C_PlayFadeBackReverse, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'WBP_GymChatMessage_C_PlayFadeBackReverse::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_GymChatMessage.WBP_GymChatMessage_C.PlayFadeMessageForward
// 0x0008 (0x0008 - 0x0000)
struct WBP_GymChatMessage_C_PlayFadeMessageForward final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymChatMessage_C_PlayFadeMessageForward) == 0x000008, "Wrong alignment on WBP_GymChatMessage_C_PlayFadeMessageForward");
static_assert(sizeof(WBP_GymChatMessage_C_PlayFadeMessageForward) == 0x000008, "Wrong size on WBP_GymChatMessage_C_PlayFadeMessageForward");
static_assert(offsetof(WBP_GymChatMessage_C_PlayFadeMessageForward, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_GymChatMessage_C_PlayFadeMessageForward::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_GymChatMessage.WBP_GymChatMessage_C.PlayFadeMessageReversed
// 0x0008 (0x0008 - 0x0000)
struct WBP_GymChatMessage_C_PlayFadeMessageReversed final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymChatMessage_C_PlayFadeMessageReversed) == 0x000008, "Wrong alignment on WBP_GymChatMessage_C_PlayFadeMessageReversed");
static_assert(sizeof(WBP_GymChatMessage_C_PlayFadeMessageReversed) == 0x000008, "Wrong size on WBP_GymChatMessage_C_PlayFadeMessageReversed");
static_assert(offsetof(WBP_GymChatMessage_C_PlayFadeMessageReversed, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'WBP_GymChatMessage_C_PlayFadeMessageReversed::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_GymChatMessage.WBP_GymChatMessage_C.ShowMessage
// 0x0008 (0x0008 - 0x0000)
struct WBP_GymChatMessage_C_ShowMessage final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymChatMessage_C_ShowMessage) == 0x000008, "Wrong alignment on WBP_GymChatMessage_C_ShowMessage");
static_assert(sizeof(WBP_GymChatMessage_C_ShowMessage) == 0x000008, "Wrong size on WBP_GymChatMessage_C_ShowMessage");
static_assert(offsetof(WBP_GymChatMessage_C_ShowMessage, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'WBP_GymChatMessage_C_ShowMessage::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

