#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LevelKitInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LevelKitInfo.WBP_LevelKitInfo_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_LevelKitInfo_C final : public UUserWidget
{
public:
	class UCommonTextBlock*                       CommonTextBlock_182;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_184;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_H2_C*                    LevelkitName;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Setup(const class FText& KitName, const class FText& Description);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LevelKitInfo_C">();
	}
	static class UWBP_LevelKitInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LevelKitInfo_C>();
	}
};
static_assert(alignof(UWBP_LevelKitInfo_C) == 0x000008, "Wrong alignment on UWBP_LevelKitInfo_C");
static_assert(sizeof(UWBP_LevelKitInfo_C) == 0x0002D8, "Wrong size on UWBP_LevelKitInfo_C");
static_assert(offsetof(UWBP_LevelKitInfo_C, CommonTextBlock_182) == 0x0002C0, "Member 'UWBP_LevelKitInfo_C::CommonTextBlock_182' has a wrong offset!");
static_assert(offsetof(UWBP_LevelKitInfo_C, Image_184) == 0x0002C8, "Member 'UWBP_LevelKitInfo_C::Image_184' has a wrong offset!");
static_assert(offsetof(UWBP_LevelKitInfo_C, LevelkitName) == 0x0002D0, "Member 'UWBP_LevelKitInfo_C::LevelkitName' has a wrong offset!");

}

