#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionWheelWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActionWheelWidget.WBP_ActionWheelWidget_C
// 0x00A0 (0x0468 - 0x03C8)
class UWBP_ActionWheelWidget_C final : public UGymGuiRadialWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundDarken;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_WheelDown;                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_Wheelup;                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ContainerCanvas;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CursorImage;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       InputActionUI;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NextPageTitle;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PageTitle;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PreviousPageTitle;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionWheelSelectionWidget_C*      Selection0;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionWheelSelectionWidget_C*      Selection1;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionWheelSelectionWidget_C*      Selection2;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionWheelSelectionWidget_C*      Selection3;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionWheelSelectionWidget_C*      Selection4;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionWheelSelectionWidget_C*      Selection5;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionWheelSelectionWidget_C*      Selection6;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionWheelSelectionWidget_C*      Selection7;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SwapPageOverlay;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ToggleActionWheel;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddAction(class UGymMetaAction* Action, int32 Index_0, int32 MaxActions);
	void BP_OpenPage(int32 Page);
	void ExecuteUbergraph_WBP_ActionWheelWidget(int32 EntryPoint);
	struct FVector2D GetAlignment(int32 Index_0, int32 MaxActions);
	struct FVector2D GetPosition(int32 Index_0, int32 Max);
	void GetRenderAngle(int32 Index_0, int32 MaxActions, double* Return_Value);
	TArray<class UGymGuiRadialSelectionWidget*> GetSelectionWidgets(int32 Page);
	void SetupTexts(int32 Page);
	void SetupWidgetTransform(class UWidget* Widget, class UCanvasPanelSlot* PanelSlot, int32 Index_0, int32 MaxActions);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActionWheelWidget_C">();
	}
	static class UWBP_ActionWheelWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActionWheelWidget_C>();
	}
};
static_assert(alignof(UWBP_ActionWheelWidget_C) == 0x000008, "Wrong alignment on UWBP_ActionWheelWidget_C");
static_assert(sizeof(UWBP_ActionWheelWidget_C) == 0x000468, "Wrong size on UWBP_ActionWheelWidget_C");
static_assert(offsetof(UWBP_ActionWheelWidget_C, UberGraphFrame) == 0x0003C8, "Member 'UWBP_ActionWheelWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, BackgroundDarken) == 0x0003D0, "Member 'UWBP_ActionWheelWidget_C::BackgroundDarken' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, CommonActionWidget_WheelDown) == 0x0003D8, "Member 'UWBP_ActionWheelWidget_C::CommonActionWidget_WheelDown' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, CommonActionWidget_Wheelup) == 0x0003E0, "Member 'UWBP_ActionWheelWidget_C::CommonActionWidget_Wheelup' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, ContainerCanvas) == 0x0003E8, "Member 'UWBP_ActionWheelWidget_C::ContainerCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, CursorImage) == 0x0003F0, "Member 'UWBP_ActionWheelWidget_C::CursorImage' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, InputActionUI) == 0x0003F8, "Member 'UWBP_ActionWheelWidget_C::InputActionUI' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, NextPageTitle) == 0x000400, "Member 'UWBP_ActionWheelWidget_C::NextPageTitle' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, PageTitle) == 0x000408, "Member 'UWBP_ActionWheelWidget_C::PageTitle' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, PreviousPageTitle) == 0x000410, "Member 'UWBP_ActionWheelWidget_C::PreviousPageTitle' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, Selection0) == 0x000418, "Member 'UWBP_ActionWheelWidget_C::Selection0' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, Selection1) == 0x000420, "Member 'UWBP_ActionWheelWidget_C::Selection1' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, Selection2) == 0x000428, "Member 'UWBP_ActionWheelWidget_C::Selection2' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, Selection3) == 0x000430, "Member 'UWBP_ActionWheelWidget_C::Selection3' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, Selection4) == 0x000438, "Member 'UWBP_ActionWheelWidget_C::Selection4' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, Selection5) == 0x000440, "Member 'UWBP_ActionWheelWidget_C::Selection5' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, Selection6) == 0x000448, "Member 'UWBP_ActionWheelWidget_C::Selection6' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, Selection7) == 0x000450, "Member 'UWBP_ActionWheelWidget_C::Selection7' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, SwapPageOverlay) == 0x000458, "Member 'UWBP_ActionWheelWidget_C::SwapPageOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActionWheelWidget_C, ToggleActionWheel) == 0x000460, "Member 'UWBP_ActionWheelWidget_C::ToggleActionWheel' has a wrong offset!");

}

