#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BoolPropertySetting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BoolPropertySetting.WBP_BoolPropertySetting_C
// 0x0090 (0x04C8 - 0x0438)
class UWBP_BoolPropertySetting_C final : public UGymGuiAssetPropertyEditorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ArrowLeft;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowRight;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_90;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FalseBorder;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FalseText;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TrueBorder;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrueText;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymPropertyValues                     Property_Value;                                    // 0x0480(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_BoolPropertySetting(int32 EntryPoint);
	void OnHovered();
	void OnPropertyUpdated();
	void OnSelect();
	void OnUnHovered();
	void SelectNextSetting();
	void SelectPrevSetting();
	void SetColors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BoolPropertySetting_C">();
	}
	static class UWBP_BoolPropertySetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BoolPropertySetting_C>();
	}
};
static_assert(alignof(UWBP_BoolPropertySetting_C) == 0x000008, "Wrong alignment on UWBP_BoolPropertySetting_C");
static_assert(sizeof(UWBP_BoolPropertySetting_C) == 0x0004C8, "Wrong size on UWBP_BoolPropertySetting_C");
static_assert(offsetof(UWBP_BoolPropertySetting_C, UberGraphFrame) == 0x000438, "Member 'UWBP_BoolPropertySetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, ArrowLeft) == 0x000440, "Member 'UWBP_BoolPropertySetting_C::ArrowLeft' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, ArrowRight) == 0x000448, "Member 'UWBP_BoolPropertySetting_C::ArrowRight' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, Border_90) == 0x000450, "Member 'UWBP_BoolPropertySetting_C::Border_90' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, FalseBorder) == 0x000458, "Member 'UWBP_BoolPropertySetting_C::FalseBorder' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, FalseText) == 0x000460, "Member 'UWBP_BoolPropertySetting_C::FalseText' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, Text) == 0x000468, "Member 'UWBP_BoolPropertySetting_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, TrueBorder) == 0x000470, "Member 'UWBP_BoolPropertySetting_C::TrueBorder' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, TrueText) == 0x000478, "Member 'UWBP_BoolPropertySetting_C::TrueText' has a wrong offset!");
static_assert(offsetof(UWBP_BoolPropertySetting_C, Property_Value) == 0x000480, "Member 'UWBP_BoolPropertySetting_C::Property_Value' has a wrong offset!");

}

