#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymActionInputWidget_Alternative

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_GymActionInputWidget_Alternative.WBP_GymActionInputWidget_Alternative_C.ExecuteUbergraph_WBP_GymActionInputWidget_Alternative
// 0x0020 (0x0020 - 0x0000)
struct WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Input;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative) == 0x000008, "Wrong alignment on WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative");
static_assert(sizeof(WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative) == 0x000020, "Wrong size on WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative");
static_assert(offsetof(WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative, EntryPoint) == 0x000000, "Member 'WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative, K2Node_Event_Input) == 0x000004, "Member 'WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative::K2Node_Event_Input' has a wrong offset!");
static_assert(offsetof(WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'WBP_GymActionInputWidget_Alternative_C_ExecuteUbergraph_WBP_GymActionInputWidget_Alternative::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function WBP_GymActionInputWidget_Alternative.WBP_GymActionInputWidget_Alternative_C.SetInput
// 0x0008 (0x0008 - 0x0000)
struct WBP_GymActionInputWidget_Alternative_C_SetInput final
{
public:
	class FName                                   Input;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GymActionInputWidget_Alternative_C_SetInput) == 0x000004, "Wrong alignment on WBP_GymActionInputWidget_Alternative_C_SetInput");
static_assert(sizeof(WBP_GymActionInputWidget_Alternative_C_SetInput) == 0x000008, "Wrong size on WBP_GymActionInputWidget_Alternative_C_SetInput");
static_assert(offsetof(WBP_GymActionInputWidget_Alternative_C_SetInput, Input) == 0x000000, "Member 'WBP_GymActionInputWidget_Alternative_C_SetInput::Input' has a wrong offset!");

}

