#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RemixOriginalCreatorTag

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"


namespace SDK::Params
{

// Function WBP_RemixOriginalCreatorTag.WBP_RemixOriginalCreatorTag_C.ExecuteUbergraph_WBP_RemixOriginalCreatorTag
// 0x0060 (0x0060 - 0x0000)
struct WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymMapOriginalDetails                 K2Node_CustomEvent_Details;                        // 0x0008(0x0040)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
static_assert(alignof(WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag) == 0x000008, "Wrong alignment on WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag");
static_assert(sizeof(WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag) == 0x000060, "Wrong size on WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag");
static_assert(offsetof(WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag, EntryPoint) == 0x000000, "Member 'WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag, K2Node_CustomEvent_Details) == 0x000008, "Member 'WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_RemixOriginalCreatorTag_C_ExecuteUbergraph_WBP_RemixOriginalCreatorTag::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_RemixOriginalCreatorTag.WBP_RemixOriginalCreatorTag_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RemixOriginalCreatorTag_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RemixOriginalCreatorTag_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RemixOriginalCreatorTag_C_PreConstruct");
static_assert(sizeof(WBP_RemixOriginalCreatorTag_C_PreConstruct) == 0x000001, "Wrong size on WBP_RemixOriginalCreatorTag_C_PreConstruct");
static_assert(offsetof(WBP_RemixOriginalCreatorTag_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RemixOriginalCreatorTag_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RemixOriginalCreatorTag.WBP_RemixOriginalCreatorTag_C.SetOriginalDetails
// 0x0040 (0x0040 - 0x0000)
struct WBP_RemixOriginalCreatorTag_C_SetOriginalDetails final
{
public:
	struct FGymMapOriginalDetails                 Details;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RemixOriginalCreatorTag_C_SetOriginalDetails) == 0x000008, "Wrong alignment on WBP_RemixOriginalCreatorTag_C_SetOriginalDetails");
static_assert(sizeof(WBP_RemixOriginalCreatorTag_C_SetOriginalDetails) == 0x000040, "Wrong size on WBP_RemixOriginalCreatorTag_C_SetOriginalDetails");
static_assert(offsetof(WBP_RemixOriginalCreatorTag_C_SetOriginalDetails, Details) == 0x000000, "Member 'WBP_RemixOriginalCreatorTag_C_SetOriginalDetails::Details' has a wrong offset!");

}

