#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CareerReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CareerReward.WBP_CareerReward_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_CareerReward_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconClaimed;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardImage;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RewardIndex;                                       // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSaveGameTutorial*                   SaveFile;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FeaturedReward;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CareerReward(int32 EntryPoint);
	void Init();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CareerReward_C">();
	}
	static class UWBP_CareerReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CareerReward_C>();
	}
};
static_assert(alignof(UWBP_CareerReward_C) == 0x000008, "Wrong alignment on UWBP_CareerReward_C");
static_assert(sizeof(UWBP_CareerReward_C) == 0x0002F0, "Wrong size on UWBP_CareerReward_C");
static_assert(offsetof(UWBP_CareerReward_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CareerReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CareerReward_C, IconClaimed) == 0x0002C8, "Member 'UWBP_CareerReward_C::IconClaimed' has a wrong offset!");
static_assert(offsetof(UWBP_CareerReward_C, RewardImage) == 0x0002D0, "Member 'UWBP_CareerReward_C::RewardImage' has a wrong offset!");
static_assert(offsetof(UWBP_CareerReward_C, RewardIndex) == 0x0002D8, "Member 'UWBP_CareerReward_C::RewardIndex' has a wrong offset!");
static_assert(offsetof(UWBP_CareerReward_C, SaveFile) == 0x0002E0, "Member 'UWBP_CareerReward_C::SaveFile' has a wrong offset!");
static_assert(offsetof(UWBP_CareerReward_C, FeaturedReward) == 0x0002E8, "Member 'UWBP_CareerReward_C::FeaturedReward' has a wrong offset!");

}

