#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogueWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DialogueWidget.WBP_DialogueWidget_C
// 0x0038 (0x0370 - 0x0338)
class UWBP_DialogueWidget_C final : public UGymGuiDialogueWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridPanel*                             Answerbox;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_63;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_149;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NameTitle;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   NPCSPeech;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Answer(int32 Index_0);
	void BPClose();
	void BPSetNPCName(const class FName& NPCName);
	void BPSetNPCSpeech(const class FText& NPCSPeech_0);
	void BPSetPlayerAnswers(const TArray<struct FGymAnswer>& PlayerAnswers);
	void ExecuteUbergraph_WBP_DialogueWidget(int32 EntryPoint);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_4(const struct FKey& Key);
	void SetAnswerVisible(bool bVisible);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DialogueWidget_C">();
	}
	static class UWBP_DialogueWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DialogueWidget_C>();
	}
};
static_assert(alignof(UWBP_DialogueWidget_C) == 0x000008, "Wrong alignment on UWBP_DialogueWidget_C");
static_assert(sizeof(UWBP_DialogueWidget_C) == 0x000370, "Wrong size on UWBP_DialogueWidget_C");
static_assert(offsetof(UWBP_DialogueWidget_C, UberGraphFrame) == 0x000338, "Member 'UWBP_DialogueWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueWidget_C, Answerbox) == 0x000340, "Member 'UWBP_DialogueWidget_C::Answerbox' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueWidget_C, Image) == 0x000348, "Member 'UWBP_DialogueWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueWidget_C, Image_63) == 0x000350, "Member 'UWBP_DialogueWidget_C::Image_63' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueWidget_C, Image_149) == 0x000358, "Member 'UWBP_DialogueWidget_C::Image_149' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueWidget_C, NameTitle) == 0x000360, "Member 'UWBP_DialogueWidget_C::NameTitle' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueWidget_C, NPCSPeech) == 0x000368, "Member 'UWBP_DialogueWidget_C::NPCSPeech' has a wrong offset!");

}

