#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChallengesTabs

#include "Basic.hpp"

#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ChallengesTabs.WBP_ChallengesTabs_C
// 0x0020 (0x0328 - 0x0308)
class UWBP_ChallengesTabs_C final : public UGymGuiGenericTab
{
public:
	class UWBP_TabButton_C*                       WBP_TabDaily;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabButton_C*                       WBP_TabWeekly;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnTabSelected;                                     // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnTabSelected__DelegateSignature(const class FString& Category);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ChallengesTabs_C">();
	}
	static class UWBP_ChallengesTabs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ChallengesTabs_C>();
	}
};
static_assert(alignof(UWBP_ChallengesTabs_C) == 0x000008, "Wrong alignment on UWBP_ChallengesTabs_C");
static_assert(sizeof(UWBP_ChallengesTabs_C) == 0x000328, "Wrong size on UWBP_ChallengesTabs_C");
static_assert(offsetof(UWBP_ChallengesTabs_C, WBP_TabDaily) == 0x000308, "Member 'UWBP_ChallengesTabs_C::WBP_TabDaily' has a wrong offset!");
static_assert(offsetof(UWBP_ChallengesTabs_C, WBP_TabWeekly) == 0x000310, "Member 'UWBP_ChallengesTabs_C::WBP_TabWeekly' has a wrong offset!");
static_assert(offsetof(UWBP_ChallengesTabs_C, OnTabSelected) == 0x000318, "Member 'UWBP_ChallengesTabs_C::OnTabSelected' has a wrong offset!");

}

