#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RulestateWidgetCareer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_RulestateWidgetCareer.WBP_RulestateWidgetCareer_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_RulestateWidgetCareer_C_CustomEvent final
{
public:
	bool                                          bIsInCutscene;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RulestateWidgetCareer_C_CustomEvent) == 0x000001, "Wrong alignment on WBP_RulestateWidgetCareer_C_CustomEvent");
static_assert(sizeof(WBP_RulestateWidgetCareer_C_CustomEvent) == 0x000001, "Wrong size on WBP_RulestateWidgetCareer_C_CustomEvent");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_CustomEvent, bIsInCutscene) == 0x000000, "Member 'WBP_RulestateWidgetCareer_C_CustomEvent::bIsInCutscene' has a wrong offset!");

// Function WBP_RulestateWidgetCareer.WBP_RulestateWidgetCareer_C.ExecuteUbergraph_WBP_RulestateWidgetCareer
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsInCutscene)>           K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow_1;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsInCutscene;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller_1;      // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer) == 0x000008, "Wrong alignment on WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer");
static_assert(sizeof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer) == 0x0000B0, "Wrong size on WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, EntryPoint) == 0x000000, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_bool_Variable) == 0x000004, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_byte_Variable) == 0x000005, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_bool_Variable_2) == 0x00000A, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_byte_Variable_4) == 0x00001C, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, Temp_byte_Variable_5) == 0x00001D, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_Event_IsDesignTime) == 0x00001E, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_Event_bShow_1) == 0x00001F, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_Event_bShow_1' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_Event_MyGeometry) == 0x000020, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_Select_Default) == 0x00005C, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_Event_bShow) == 0x000068, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_DynamicCast_AsGym_Player_Controller) == 0x000070, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_Select_Default_1) == 0x000079, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000080, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000088, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_CustomEvent_bIsInCutscene) == 0x000090, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_CustomEvent_bIsInCutscene' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_DynamicCast_AsGym_Player_Controller_1) == 0x000098, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_DynamicCast_AsGym_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, K2Node_Select_Default_2) == 0x0000A1, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'WBP_RulestateWidgetCareer_C_ExecuteUbergraph_WBP_RulestateWidgetCareer::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_RulestateWidgetCareer.WBP_RulestateWidgetCareer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RulestateWidgetCareer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RulestateWidgetCareer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RulestateWidgetCareer_C_PreConstruct");
static_assert(sizeof(WBP_RulestateWidgetCareer_C_PreConstruct) == 0x000001, "Wrong size on WBP_RulestateWidgetCareer_C_PreConstruct");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RulestateWidgetCareer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RulestateWidgetCareer.WBP_RulestateWidgetCareer_C.ShowBombUI
// 0x0001 (0x0001 - 0x0000)
struct WBP_RulestateWidgetCareer_C_ShowBombUI final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RulestateWidgetCareer_C_ShowBombUI) == 0x000001, "Wrong alignment on WBP_RulestateWidgetCareer_C_ShowBombUI");
static_assert(sizeof(WBP_RulestateWidgetCareer_C_ShowBombUI) == 0x000001, "Wrong size on WBP_RulestateWidgetCareer_C_ShowBombUI");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ShowBombUI, bShow) == 0x000000, "Member 'WBP_RulestateWidgetCareer_C_ShowBombUI::bShow' has a wrong offset!");

// Function WBP_RulestateWidgetCareer.WBP_RulestateWidgetCareer_C.ShowSpray
// 0x0001 (0x0001 - 0x0000)
struct WBP_RulestateWidgetCareer_C_ShowSpray final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RulestateWidgetCareer_C_ShowSpray) == 0x000001, "Wrong alignment on WBP_RulestateWidgetCareer_C_ShowSpray");
static_assert(sizeof(WBP_RulestateWidgetCareer_C_ShowSpray) == 0x000001, "Wrong size on WBP_RulestateWidgetCareer_C_ShowSpray");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_ShowSpray, bShow) == 0x000000, "Member 'WBP_RulestateWidgetCareer_C_ShowSpray::bShow' has a wrong offset!");

// Function WBP_RulestateWidgetCareer.WBP_RulestateWidgetCareer_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_RulestateWidgetCareer_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RulestateWidgetCareer_C_Tick) == 0x000004, "Wrong alignment on WBP_RulestateWidgetCareer_C_Tick");
static_assert(sizeof(WBP_RulestateWidgetCareer_C_Tick) == 0x00003C, "Wrong size on WBP_RulestateWidgetCareer_C_Tick");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_RulestateWidgetCareer_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_RulestateWidgetCareer_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_RulestateWidgetCareer_C_Tick::InDeltaTime' has a wrong offset!");

}

