#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlaymenuButton_Red_Horizontal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlaymenuButton_Red_Horizontal.WBP_PlaymenuButton_Red_Horizontal_C
// 0x0070 (0x0358 - 0x02E8)
class UWBP_PlaymenuButton_Red_Horizontal_C final : public UGymGuiGenericButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PushAnim;                                          // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HorizontalText;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_191;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TextBorder;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ContentText;                                       // 0x0338(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             Texture;                                           // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlaymenuButton_AllLevelsButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PlaymenuButton_AllLevelsButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_PlaymenuButton_Red_Horizontal(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlaymenuButton_Red_Horizontal_C">();
	}
	static class UWBP_PlaymenuButton_Red_Horizontal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlaymenuButton_Red_Horizontal_C>();
	}
};
static_assert(alignof(UWBP_PlaymenuButton_Red_Horizontal_C) == 0x000008, "Wrong alignment on UWBP_PlaymenuButton_Red_Horizontal_C");
static_assert(sizeof(UWBP_PlaymenuButton_Red_Horizontal_C) == 0x000358, "Wrong size on UWBP_PlaymenuButton_Red_Horizontal_C");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, PushAnim) == 0x0002F0, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::PushAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, HoverAnim) == 0x0002F8, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, ContentBorder) == 0x000300, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, HorizontalText) == 0x000308, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::HorizontalText' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, HoverBorder) == 0x000310, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, Image_191) == 0x000318, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::Image_191' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, ScaleBox) == 0x000320, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::ScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, SizeBox) == 0x000328, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, TextBorder) == 0x000330, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::TextBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, ContentText) == 0x000338, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::ContentText' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Red_Horizontal_C, Texture) == 0x000350, "Member 'UWBP_PlaymenuButton_Red_Horizontal_C::Texture' has a wrong offset!");

}

