#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionWheelSelectionWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ActionWheelSelectionWidget.WBP_ActionWheelSelectionWidget_C.ExecuteUbergraph_WBP_ActionWheelSelectionWidget
// 0x0060 (0x0060 - 0x0000)
struct WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPerform_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget) == 0x000008, "Wrong alignment on WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget");
static_assert(sizeof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget) == 0x000060, "Wrong size on WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, EntryPoint) == 0x000000, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, K2Node_Event_MyGeometry) == 0x00001C, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, K2Node_Event_InDeltaTime) == 0x000054, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_CanPerform_ReturnValue) == 0x000059, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_CanPerform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00005A, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_BooleanAND_ReturnValue) == 0x00005B, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_BooleanAND_ReturnValue_1) == 0x00005C, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget, CallFunc_BooleanOR_ReturnValue) == 0x00005D, "Member 'WBP_ActionWheelSelectionWidget_C_ExecuteUbergraph_WBP_ActionWheelSelectionWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_ActionWheelSelectionWidget.WBP_ActionWheelSelectionWidget_C.SetupWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_ActionWheelSelectionWidget_C_SetupWidget final
{
public:
	class UGymMetaAction*                         Action_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPerform_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetActionName_ReturnValue;                // 0x0010(0x0018)()
	class UTexture2D*                             Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActionWheelSelectionWidget_C_SetupWidget) == 0x000008, "Wrong alignment on WBP_ActionWheelSelectionWidget_C_SetupWidget");
static_assert(sizeof(WBP_ActionWheelSelectionWidget_C_SetupWidget) == 0x000040, "Wrong size on WBP_ActionWheelSelectionWidget_C_SetupWidget");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_SetupWidget, Action_0) == 0x000000, "Member 'WBP_ActionWheelSelectionWidget_C_SetupWidget::Action_0' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_SetupWidget, Temp_bool_Variable) == 0x000008, "Member 'WBP_ActionWheelSelectionWidget_C_SetupWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_SetupWidget, CallFunc_CanPerform_ReturnValue) == 0x000009, "Member 'WBP_ActionWheelSelectionWidget_C_SetupWidget::CallFunc_CanPerform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_SetupWidget, CallFunc_GetActionName_ReturnValue) == 0x000010, "Member 'WBP_ActionWheelSelectionWidget_C_SetupWidget::CallFunc_GetActionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_SetupWidget, Temp_object_Variable) == 0x000028, "Member 'WBP_ActionWheelSelectionWidget_C_SetupWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_SetupWidget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_ActionWheelSelectionWidget_C_SetupWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_SetupWidget, K2Node_Select_Default) == 0x000038, "Member 'WBP_ActionWheelSelectionWidget_C_SetupWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ActionWheelSelectionWidget.WBP_ActionWheelSelectionWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ActionWheelSelectionWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActionWheelSelectionWidget_C_Tick) == 0x000004, "Wrong alignment on WBP_ActionWheelSelectionWidget_C_Tick");
static_assert(sizeof(WBP_ActionWheelSelectionWidget_C_Tick) == 0x00003C, "Wrong size on WBP_ActionWheelSelectionWidget_C_Tick");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ActionWheelSelectionWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ActionWheelSelectionWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ActionWheelSelectionWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

