#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RewardPageContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RewardPageContainer.WBP_RewardPageContainer_C
// 0x0040 (0x0348 - 0x0308)
class UWBP_RewardPageContainer_C final : public UGymGuiGenericTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             OnTabSelected;                                     // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Index_0;                                           // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_SeasonsRewardsCard_C*>      RewardCardWidgets;                                 // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_SeasonsRewardsCard_C*              FirstRewardCard;                                   // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SeasonsRewardsCard_C*              LastRewardCard;                                    // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddItem(bool Available, const struct FGymSeasonReward& Reward, class UBP_SeasonsMenuWidget_C* SeasonUI);
	void ExecuteUbergraph_WBP_RewardPageContainer(int32 EntryPoint);
	void OnTabSelected__DelegateSignature(const class FString& Category);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RewardPageContainer_C">();
	}
	static class UWBP_RewardPageContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RewardPageContainer_C>();
	}
};
static_assert(alignof(UWBP_RewardPageContainer_C) == 0x000008, "Wrong alignment on UWBP_RewardPageContainer_C");
static_assert(sizeof(UWBP_RewardPageContainer_C) == 0x000348, "Wrong size on UWBP_RewardPageContainer_C");
static_assert(offsetof(UWBP_RewardPageContainer_C, UberGraphFrame) == 0x000308, "Member 'UWBP_RewardPageContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageContainer_C, OnTabSelected) == 0x000310, "Member 'UWBP_RewardPageContainer_C::OnTabSelected' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageContainer_C, Index_0) == 0x000320, "Member 'UWBP_RewardPageContainer_C::Index_0' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageContainer_C, RewardCardWidgets) == 0x000328, "Member 'UWBP_RewardPageContainer_C::RewardCardWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageContainer_C, FirstRewardCard) == 0x000338, "Member 'UWBP_RewardPageContainer_C::FirstRewardCard' has a wrong offset!");
static_assert(offsetof(UWBP_RewardPageContainer_C, LastRewardCard) == 0x000340, "Member 'UWBP_RewardPageContainer_C::LastRewardCard' has a wrong offset!");

}

