#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VariantPropertySetting

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_VariantPropertySetting.WBP_VariantPropertySetting_C.DecreaseValue
// 0x0034 (0x0034 - 0x0000)
struct WBP_VariantPropertySetting_C_DecreaseValue final
{
public:
	int32                                         TestCountDec;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGymAssetVariantId                     K2Node_MakeStruct_GymAssetVariantId;               // 0x0024(0x0010)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VariantPropertySetting_C_DecreaseValue) == 0x000004, "Wrong alignment on WBP_VariantPropertySetting_C_DecreaseValue");
static_assert(sizeof(WBP_VariantPropertySetting_C_DecreaseValue) == 0x000034, "Wrong size on WBP_VariantPropertySetting_C_DecreaseValue");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, TestCountDec) == 0x000000, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::TestCountDec' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, Temp_int_Variable) == 0x000004, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, Temp_bool_Variable) == 0x00000C, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, CallFunc_Greater_IntInt_ReturnValue) == 0x00000D, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, CallFunc_Percent_IntInt_ReturnValue) == 0x000018, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, K2Node_Select_Default) == 0x000020, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_DecreaseValue, K2Node_MakeStruct_GymAssetVariantId) == 0x000024, "Member 'WBP_VariantPropertySetting_C_DecreaseValue::K2Node_MakeStruct_GymAssetVariantId' has a wrong offset!");

// Function WBP_VariantPropertySetting.WBP_VariantPropertySetting_C.ExecuteUbergraph_WBP_VariantPropertySetting
// 0x0058 (0x0058 - 0x0000)
struct WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0020(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSaveGameTutorial*                   CallFunc_GetSaveFile_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRewardsClaimed_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting) == 0x000008, "Wrong alignment on WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting");
static_assert(sizeof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting) == 0x000058, "Wrong size on WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, EntryPoint) == 0x000000, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, K2Node_InputActionEvent_Key_1) == 0x000008, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, K2Node_InputActionEvent_Key) == 0x000020, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, CallFunc_Not_PreBool_ReturnValue_1) == 0x000039, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, CallFunc_BooleanAND_ReturnValue_1) == 0x00003B, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, CallFunc_GetSaveFile_ReturnValue) == 0x000040, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::CallFunc_GetSaveFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, CallFunc_GetRewardsClaimed_ReturnValue) == 0x00004C, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::CallFunc_GetRewardsClaimed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'WBP_VariantPropertySetting_C_ExecuteUbergraph_WBP_VariantPropertySetting::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_VariantPropertySetting.WBP_VariantPropertySetting_C.FindInitialValue
// 0x0080 (0x0080 - 0x0000)
struct WBP_VariantPropertySetting_C_FindInitialValue final
{
public:
	TArray<struct FGymLevelAssetVariant>          ValidVariants;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	TSubclassOf<class AGymStaticLevelAsset>       SelectedVariant;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGymLevelAssetVariant                  CallFunc_Array_Get_Item;                           // 0x0028(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymAssetVariantId                     K2Node_MakeStruct_GymAssetVariantId;               // 0x0068(0x0010)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VariantPropertySetting_C_FindInitialValue) == 0x000008, "Wrong alignment on WBP_VariantPropertySetting_C_FindInitialValue");
static_assert(sizeof(WBP_VariantPropertySetting_C_FindInitialValue) == 0x000080, "Wrong size on WBP_VariantPropertySetting_C_FindInitialValue");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, ValidVariants) == 0x000000, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::ValidVariants' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, SelectedVariant) == 0x000010, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::SelectedVariant' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000065, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, K2Node_MakeStruct_GymAssetVariantId) == 0x000068, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::K2Node_MakeStruct_GymAssetVariantId' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_FindInitialValue, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'WBP_VariantPropertySetting_C_FindInitialValue::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function WBP_VariantPropertySetting.WBP_VariantPropertySetting_C.IncreaseValue
// 0x0028 (0x0028 - 0x0000)
struct WBP_VariantPropertySetting_C_IncreaseValue final
{
public:
	int32                                         TestCountInc;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGymAssetVariantId                     K2Node_MakeStruct_GymAssetVariantId;               // 0x0018(0x0010)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VariantPropertySetting_C_IncreaseValue) == 0x000004, "Wrong alignment on WBP_VariantPropertySetting_C_IncreaseValue");
static_assert(sizeof(WBP_VariantPropertySetting_C_IncreaseValue) == 0x000028, "Wrong size on WBP_VariantPropertySetting_C_IncreaseValue");
static_assert(offsetof(WBP_VariantPropertySetting_C_IncreaseValue, TestCountInc) == 0x000000, "Member 'WBP_VariantPropertySetting_C_IncreaseValue::TestCountInc' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_IncreaseValue, Temp_int_Variable) == 0x000004, "Member 'WBP_VariantPropertySetting_C_IncreaseValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_IncreaseValue, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_VariantPropertySetting_C_IncreaseValue::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_IncreaseValue, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_VariantPropertySetting_C_IncreaseValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_IncreaseValue, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'WBP_VariantPropertySetting_C_IncreaseValue::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_IncreaseValue, CallFunc_Percent_IntInt_ReturnValue) == 0x000014, "Member 'WBP_VariantPropertySetting_C_IncreaseValue::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VariantPropertySetting_C_IncreaseValue, K2Node_MakeStruct_GymAssetVariantId) == 0x000018, "Member 'WBP_VariantPropertySetting_C_IncreaseValue::K2Node_MakeStruct_GymAssetVariantId' has a wrong offset!");

// Function WBP_VariantPropertySetting.WBP_VariantPropertySetting_C.InpActEvt_ContextualDown_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_VariantPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VariantPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on WBP_VariantPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0");
static_assert(sizeof(WBP_VariantPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on WBP_VariantPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0");
static_assert(offsetof(WBP_VariantPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'WBP_VariantPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function WBP_VariantPropertySetting.WBP_VariantPropertySetting_C.InpActEvt_ContextualUp_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_VariantPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VariantPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on WBP_VariantPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1");
static_assert(sizeof(WBP_VariantPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on WBP_VariantPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1");
static_assert(offsetof(WBP_VariantPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'WBP_VariantPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1::Key' has a wrong offset!");

}

