#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymMasterRuleState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GymMasterRuleState.WBP_GymMasterRuleState_C
// 0x0038 (0x03E0 - 0x03A8)
class UWBP_GymMasterRuleState_C final : public UGymGuiMasterRuleStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TextAppear;                                        // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AnnouncementGridBG;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GoodMainText;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InfoText;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoteWidget_C*                      WBP_VoteWidget;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddRuleStateWidget(class UGymGuiRuleStateWidget* Widget);
	void ExecuteUbergraph_WBP_GymMasterRuleState(int32 EntryPoint);
	void OnTapeCollected();
	void ShowRuleInfoText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GymMasterRuleState_C">();
	}
	static class UWBP_GymMasterRuleState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GymMasterRuleState_C>();
	}
};
static_assert(alignof(UWBP_GymMasterRuleState_C) == 0x000008, "Wrong alignment on UWBP_GymMasterRuleState_C");
static_assert(sizeof(UWBP_GymMasterRuleState_C) == 0x0003E0, "Wrong size on UWBP_GymMasterRuleState_C");
static_assert(offsetof(UWBP_GymMasterRuleState_C, UberGraphFrame) == 0x0003A8, "Member 'UWBP_GymMasterRuleState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GymMasterRuleState_C, TextAppear) == 0x0003B0, "Member 'UWBP_GymMasterRuleState_C::TextAppear' has a wrong offset!");
static_assert(offsetof(UWBP_GymMasterRuleState_C, AnnouncementGridBG) == 0x0003B8, "Member 'UWBP_GymMasterRuleState_C::AnnouncementGridBG' has a wrong offset!");
static_assert(offsetof(UWBP_GymMasterRuleState_C, CanvasPanel_0) == 0x0003C0, "Member 'UWBP_GymMasterRuleState_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_GymMasterRuleState_C, GoodMainText) == 0x0003C8, "Member 'UWBP_GymMasterRuleState_C::GoodMainText' has a wrong offset!");
static_assert(offsetof(UWBP_GymMasterRuleState_C, InfoText) == 0x0003D0, "Member 'UWBP_GymMasterRuleState_C::InfoText' has a wrong offset!");
static_assert(offsetof(UWBP_GymMasterRuleState_C, WBP_VoteWidget) == 0x0003D8, "Member 'UWBP_GymMasterRuleState_C::WBP_VoteWidget' has a wrong offset!");

}

