#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CategoryContainer_Customize

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CategoryContainer_Customize.WBP_CategoryContainer_Customize_C.ExecuteUbergraph_WBP_CategoryContainer_Customize
// 0x0048 (0x0048 - 0x0000)
struct WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWPB_CategoryButton_Customize_C*        K2Node_DynamicCast_AsWPB_Category_Button_Customize; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize) == 0x000008, "Wrong alignment on WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize");
static_assert(sizeof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize) == 0x000048, "Wrong size on WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, EntryPoint) == 0x000000, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, K2Node_DynamicCast_AsWPB_Category_Button_Customize) == 0x000038, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::K2Node_DynamicCast_AsWPB_Category_Button_Customize' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'WBP_CategoryContainer_Customize_C_ExecuteUbergraph_WBP_CategoryContainer_Customize::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

