#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Pagination_PageNumberTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Pagination_PageNumberTab.WBP_Pagination_PageNumberTab_C.ExecuteUbergraph_WBP_Pagination_PageNumberTab
// 0x0100 (0x0100 - 0x0000)
struct WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0048(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x005C(0x0014)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0088(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x009C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x00B0(0x0014)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00D0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00E8(0x0018)()
};
static_assert(alignof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab) == 0x000008, "Wrong alignment on WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab");
static_assert(sizeof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab) == 0x000100, "Wrong size on WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, EntryPoint) == 0x000000, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, Temp_bool_Variable) == 0x000004, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, CallFunc_SelectColor_ReturnValue) == 0x000008, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, Temp_text_Variable) == 0x000018, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, K2Node_Event_IsDesignTime) == 0x000044, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, K2Node_MakeStruct_SlateColor_1) == 0x000048, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, K2Node_MakeStruct_SlateColor_2) == 0x00005C, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000078, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, K2Node_MakeStruct_SlateColor_3) == 0x000088, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, K2Node_MakeStruct_SlateColor_4) == 0x00009C, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, K2Node_MakeStruct_SlateColor_5) == 0x0000B0, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, CallFunc_Conv_IntToText_ReturnValue) == 0x0000D0, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab, K2Node_Select_Default) == 0x0000E8, "Member 'WBP_Pagination_PageNumberTab_C_ExecuteUbergraph_WBP_Pagination_PageNumberTab::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Pagination_PageNumberTab.WBP_Pagination_PageNumberTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Pagination_PageNumberTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Pagination_PageNumberTab_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Pagination_PageNumberTab_C_PreConstruct");
static_assert(sizeof(WBP_Pagination_PageNumberTab_C_PreConstruct) == 0x000001, "Wrong size on WBP_Pagination_PageNumberTab_C_PreConstruct");
static_assert(offsetof(WBP_Pagination_PageNumberTab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Pagination_PageNumberTab_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

