#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdminMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_AdminMenu.WBP_AdminMenu_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_AdminMenu_C_CustomEvent final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminMenu_C_CustomEvent) == 0x000001, "Wrong alignment on WBP_AdminMenu_C_CustomEvent");
static_assert(sizeof(WBP_AdminMenu_C_CustomEvent) == 0x000001, "Wrong size on WBP_AdminMenu_C_CustomEvent");
static_assert(offsetof(WBP_AdminMenu_C_CustomEvent, Success) == 0x000000, "Member 'WBP_AdminMenu_C_CustomEvent::Success' has a wrong offset!");

// Function WBP_AdminMenu.WBP_AdminMenu_C.ExecuteUbergraph_WBP_AdminMenu
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSaveGameTutorial*                   CallFunc_GetSaveFile_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymCloudApi*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   K2Node_DynamicCast_AsGym_Player_Controller;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymGameInstance*                       K2Node_DynamicCast_AsGym_Game_Instance_1;          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymSaveGameTutorial*                   CallFunc_GetSaveFile_ReturnValue_1;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievementWithEnum_ReturnValue;       // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu) == 0x000008, "Wrong alignment on WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu");
static_assert(sizeof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu) == 0x0000B0, "Wrong size on WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, EntryPoint) == 0x000000, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetSaveFile_ReturnValue) == 0x000008, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetSaveFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, Temp_byte_Variable) == 0x000011, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, Temp_bool_Variable) == 0x000013, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, Temp_int_Variable) == 0x000014, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, Temp_int_Variable_1) == 0x000018, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_Conv_IntToByte_ReturnValue) == 0x00001C, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetValidValue_ReturnValue) == 0x000024, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000025, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000026, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000028, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_DynamicCast_AsGym_Player_Controller) == 0x000048, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_DynamicCast_AsGym_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_CustomEvent_Success) == 0x000064, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000068, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_MakeLiteralInt_ReturnValue) == 0x000070, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_DynamicCast_AsGym_Game_Instance) == 0x000078, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_DynamicCast_AsGym_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000081, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_IsValid_ReturnValue_1) == 0x000082, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_IsShippingBuild_ReturnValue) == 0x000083, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_Select_Default) == 0x000084, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetGameInstance_ReturnValue_1) == 0x000088, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_DynamicCast_AsGym_Game_Instance_1) == 0x000090, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_DynamicCast_AsGym_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetSaveFile_ReturnValue_1) == 0x0000A0, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetSaveFile_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_IsValid_ReturnValue_2) == 0x0000A8, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_IsValid_ReturnValue_3) == 0x0000A9, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_SetAchievementWithEnum_ReturnValue) == 0x0000AA, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_SetAchievementWithEnum_ReturnValue' has a wrong offset!");

}

