#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MultiSelectPropertySetting

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MultiSelectPropertySetting.WBP_MultiSelectPropertySetting_C.DecreaseValue
// 0x0028 (0x0028 - 0x0000)
struct WBP_MultiSelectPropertySetting_C_DecreaseValue final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MultiSelectPropertySetting_C_DecreaseValue) == 0x000008, "Wrong alignment on WBP_MultiSelectPropertySetting_C_DecreaseValue");
static_assert(sizeof(WBP_MultiSelectPropertySetting_C_DecreaseValue) == 0x000028, "Wrong size on WBP_MultiSelectPropertySetting_C_DecreaseValue");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_DecreaseValue, Temp_bool_Variable) == 0x000000, "Member 'WBP_MultiSelectPropertySetting_C_DecreaseValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_DecreaseValue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_MultiSelectPropertySetting_C_DecreaseValue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_DecreaseValue, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000008, "Member 'WBP_MultiSelectPropertySetting_C_DecreaseValue::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_DecreaseValue, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_MultiSelectPropertySetting_C_DecreaseValue::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_DecreaseValue, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'WBP_MultiSelectPropertySetting_C_DecreaseValue::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_DecreaseValue, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_MultiSelectPropertySetting_C_DecreaseValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_DecreaseValue, K2Node_Select_Default) == 0x000024, "Member 'WBP_MultiSelectPropertySetting_C_DecreaseValue::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MultiSelectPropertySetting.WBP_MultiSelectPropertySetting_C.ExecuteUbergraph_WBP_MultiSelectPropertySetting
// 0x0038 (0x0038 - 0x0000)
struct WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0020(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting) == 0x000008, "Wrong alignment on WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting");
static_assert(sizeof(WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting) == 0x000038, "Wrong size on WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting, EntryPoint) == 0x000000, "Member 'WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting, K2Node_InputActionEvent_Key) == 0x000008, "Member 'WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting, K2Node_InputActionEvent_Key_1) == 0x000020, "Member 'WBP_MultiSelectPropertySetting_C_ExecuteUbergraph_WBP_MultiSelectPropertySetting::K2Node_InputActionEvent_Key_1' has a wrong offset!");

// Function WBP_MultiSelectPropertySetting.WBP_MultiSelectPropertySetting_C.FindInitialValue
// 0x0048 (0x0048 - 0x0000)
struct WBP_MultiSelectPropertySetting_C_FindInitialValue final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymMultiSelectProperty                CallFunc_Array_Get_Item;                           // 0x0010(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MultiSelectPropertySetting_C_FindInitialValue) == 0x000008, "Wrong alignment on WBP_MultiSelectPropertySetting_C_FindInitialValue");
static_assert(sizeof(WBP_MultiSelectPropertySetting_C_FindInitialValue) == 0x000048, "Wrong size on WBP_MultiSelectPropertySetting_C_FindInitialValue");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, CallFunc_Conv_StringToName_ReturnValue) == 0x00003C, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_FindInitialValue, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000044, "Member 'WBP_MultiSelectPropertySetting_C_FindInitialValue::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_MultiSelectPropertySetting.WBP_MultiSelectPropertySetting_C.IncreaseValue
// 0x0018 (0x0018 - 0x0000)
struct WBP_MultiSelectPropertySetting_C_IncreaseValue final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MultiSelectPropertySetting_C_IncreaseValue) == 0x000008, "Wrong alignment on WBP_MultiSelectPropertySetting_C_IncreaseValue");
static_assert(sizeof(WBP_MultiSelectPropertySetting_C_IncreaseValue) == 0x000018, "Wrong size on WBP_MultiSelectPropertySetting_C_IncreaseValue");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_IncreaseValue, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'WBP_MultiSelectPropertySetting_C_IncreaseValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_IncreaseValue, CallFunc_Percent_IntInt_ReturnValue) == 0x000004, "Member 'WBP_MultiSelectPropertySetting_C_IncreaseValue::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_IncreaseValue, CallFunc_Conv_NameToString_ReturnValue) == 0x000008, "Member 'WBP_MultiSelectPropertySetting_C_IncreaseValue::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

// Function WBP_MultiSelectPropertySetting.WBP_MultiSelectPropertySetting_C.InpActEvt_ContextualDown_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0");
static_assert(sizeof(WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualDown_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function WBP_MultiSelectPropertySetting.WBP_MultiSelectPropertySetting_C.InpActEvt_ContextualUp_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1");
static_assert(sizeof(WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1");
static_assert(offsetof(WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'WBP_MultiSelectPropertySetting_C_InpActEvt_ContextualUp_K2Node_InputActionEvent_1::Key' has a wrong offset!");

}

