#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymChatWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GymChatWidget.WBP_GymChatWidget_C
// 0x0068 (0x03A0 - 0x0338)
class UWBP_GymChatWidget_C final : public UGymGuiGlobalChatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OpenChatAnim;                                      // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             GeneralChatScrollBox;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MessageOverlay;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TextBox;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ChatActive;                                        // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FadeBackgroundEvent;                               // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_GymChatMessage_C*>          ChatMessages;                                      // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             ChatClosed;                                        // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             ChatOpened;                                        // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_GymChatWidget_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void ChatClosed__DelegateSignature();
	void ChatOpened__DelegateSignature();
	void CloseChat();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_GymChatWidget(int32 EntryPoint);
	void InpActEvt_Exit_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_ToggleChat_K2Node_InputActionEvent_1(const struct FKey& Key);
	bool IsChatBlocked();
	void OnChatClosed();
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnWindowFocusChanged(bool bHasFocus);
	void OpenChat();
	void ReceiveMessage(const class FString& PlayerName, const class FString& Message);
	void TextChatEnabledChanged(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GymChatWidget_C">();
	}
	static class UWBP_GymChatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GymChatWidget_C>();
	}
};
static_assert(alignof(UWBP_GymChatWidget_C) == 0x000008, "Wrong alignment on UWBP_GymChatWidget_C");
static_assert(sizeof(UWBP_GymChatWidget_C) == 0x0003A0, "Wrong size on UWBP_GymChatWidget_C");
static_assert(offsetof(UWBP_GymChatWidget_C, UberGraphFrame) == 0x000338, "Member 'UWBP_GymChatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, OpenChatAnim) == 0x000340, "Member 'UWBP_GymChatWidget_C::OpenChatAnim' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, GeneralChatScrollBox) == 0x000348, "Member 'UWBP_GymChatWidget_C::GeneralChatScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, MessageOverlay) == 0x000350, "Member 'UWBP_GymChatWidget_C::MessageOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, TextBox) == 0x000358, "Member 'UWBP_GymChatWidget_C::TextBox' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, ChatActive) == 0x000360, "Member 'UWBP_GymChatWidget_C::ChatActive' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, FadeBackgroundEvent) == 0x000368, "Member 'UWBP_GymChatWidget_C::FadeBackgroundEvent' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, ChatMessages) == 0x000370, "Member 'UWBP_GymChatWidget_C::ChatMessages' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, ChatClosed) == 0x000380, "Member 'UWBP_GymChatWidget_C::ChatClosed' has a wrong offset!");
static_assert(offsetof(UWBP_GymChatWidget_C, ChatOpened) == 0x000390, "Member 'UWBP_GymChatWidget_C::ChatOpened' has a wrong offset!");

}

