#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RewardsPopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RewardsPopupWidget.WBP_RewardsPopupWidget_C
// 0x00E8 (0x03A8 - 0x02C0)
class UWBP_RewardsPopupWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               ButtonContainer;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  Claim_Button;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  ClaimAll_Button;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_C*                  EquipNow_Button;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderCommonText_1;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemName;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemPreview;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               TagContainer;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemTag_C*                         WBP_ItemTag;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemTag_C*                         WBP_ItemTag_1;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardPageIndicator_C*             WBP_RewardPageIndicator;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentRewardPage;                                 // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymUnclaimedRewardResponse            Reward_Response;                                   // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture*                               RewardThumbnail;                                   // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGymUnclaimedReward>            TempUnclaimedRewards;                              // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ClaimingInProgress;                                // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UnclaimedRewardIndex;                              // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class FString>                           SuccessfullyClaimedRewards;                        // 0x0358(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_RewardsPopupWidget_Claim_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_RewardsPopupWidget_ClaimAll_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_RewardsPopupWidget_EquipNow_Button_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void Close();
	void EquipNow(bool Success, const class FString& RewardId);
	void ExecuteUbergraph_WBP_RewardsPopupWidget(int32 EntryPoint);
	ESlateVisibility Get_ClaimAll_Button_Visibility();
	struct FSlateBrush Get_ItemPreview_Brush();
	void OnRewardClaimed_Event(bool Success, const class FString& RewardId);
	void OnRewardClaimedClaimingAll(bool Success, const class FString& RewardId);
	void Show(const struct FGymUnclaimedRewardResponse& RewardResponse);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RewardsPopupWidget_C">();
	}
	static class UWBP_RewardsPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RewardsPopupWidget_C>();
	}
};
static_assert(alignof(UWBP_RewardsPopupWidget_C) == 0x000008, "Wrong alignment on UWBP_RewardsPopupWidget_C");
static_assert(sizeof(UWBP_RewardsPopupWidget_C) == 0x0003A8, "Wrong size on UWBP_RewardsPopupWidget_C");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_RewardsPopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, ButtonContainer) == 0x0002C8, "Member 'UWBP_RewardsPopupWidget_C::ButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, Claim_Button) == 0x0002D0, "Member 'UWBP_RewardsPopupWidget_C::Claim_Button' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, ClaimAll_Button) == 0x0002D8, "Member 'UWBP_RewardsPopupWidget_C::ClaimAll_Button' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, EquipNow_Button) == 0x0002E0, "Member 'UWBP_RewardsPopupWidget_C::EquipNow_Button' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, HeaderCommonText_1) == 0x0002E8, "Member 'UWBP_RewardsPopupWidget_C::HeaderCommonText_1' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, ItemName) == 0x0002F0, "Member 'UWBP_RewardsPopupWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, ItemPreview) == 0x0002F8, "Member 'UWBP_RewardsPopupWidget_C::ItemPreview' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, TagContainer) == 0x000300, "Member 'UWBP_RewardsPopupWidget_C::TagContainer' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, WBP_ItemTag) == 0x000308, "Member 'UWBP_RewardsPopupWidget_C::WBP_ItemTag' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, WBP_ItemTag_1) == 0x000310, "Member 'UWBP_RewardsPopupWidget_C::WBP_ItemTag_1' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, WBP_RewardPageIndicator) == 0x000318, "Member 'UWBP_RewardsPopupWidget_C::WBP_RewardPageIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, CurrentRewardPage) == 0x000320, "Member 'UWBP_RewardsPopupWidget_C::CurrentRewardPage' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, Reward_Response) == 0x000328, "Member 'UWBP_RewardsPopupWidget_C::Reward_Response' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, RewardThumbnail) == 0x000338, "Member 'UWBP_RewardsPopupWidget_C::RewardThumbnail' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, TempUnclaimedRewards) == 0x000340, "Member 'UWBP_RewardsPopupWidget_C::TempUnclaimedRewards' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, ClaimingInProgress) == 0x000350, "Member 'UWBP_RewardsPopupWidget_C::ClaimingInProgress' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, UnclaimedRewardIndex) == 0x000354, "Member 'UWBP_RewardsPopupWidget_C::UnclaimedRewardIndex' has a wrong offset!");
static_assert(offsetof(UWBP_RewardsPopupWidget_C, SuccessfullyClaimedRewards) == 0x000358, "Member 'UWBP_RewardsPopupWidget_C::SuccessfullyClaimedRewards' has a wrong offset!");

}

