#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymPreflowWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GymPreflowWidget.WBP_GymPreflowWidget_C
// 0x0078 (0x03B0 - 0x0338)
class UWBP_GymPreflowWidget_C final : public UGymGuiPreflowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               CardOverlay;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_43;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_80;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   GameModeDescription;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GameModeName;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_81;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_329;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_472;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelNameText;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SkipBox;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGymGameState*                          As_Gym_Game_State;                                 // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   PlayerController;                                  // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPOpen();
	void ExecuteUbergraph_WBP_GymPreflowWidget(int32 EntryPoint);
	void SetupGamemode();
	void SetupMapdata();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateSkipBoxVisibility();
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GymPreflowWidget_C">();
	}
	static class UWBP_GymPreflowWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GymPreflowWidget_C>();
	}
};
static_assert(alignof(UWBP_GymPreflowWidget_C) == 0x000008, "Wrong alignment on UWBP_GymPreflowWidget_C");
static_assert(sizeof(UWBP_GymPreflowWidget_C) == 0x0003B0, "Wrong size on UWBP_GymPreflowWidget_C");
static_assert(offsetof(UWBP_GymPreflowWidget_C, UberGraphFrame) == 0x000338, "Member 'UWBP_GymPreflowWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, CardOverlay) == 0x000340, "Member 'UWBP_GymPreflowWidget_C::CardOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, CommonActionWidget_43) == 0x000348, "Member 'UWBP_GymPreflowWidget_C::CommonActionWidget_43' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, CommonTextBlock_80) == 0x000350, "Member 'UWBP_GymPreflowWidget_C::CommonTextBlock_80' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, GameModeDescription) == 0x000358, "Member 'UWBP_GymPreflowWidget_C::GameModeDescription' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, GameModeName) == 0x000360, "Member 'UWBP_GymPreflowWidget_C::GameModeName' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, HorizontalBox_0) == 0x000368, "Member 'UWBP_GymPreflowWidget_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, Image_81) == 0x000370, "Member 'UWBP_GymPreflowWidget_C::Image_81' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, Image_142) == 0x000378, "Member 'UWBP_GymPreflowWidget_C::Image_142' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, Image_329) == 0x000380, "Member 'UWBP_GymPreflowWidget_C::Image_329' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, Image_472) == 0x000388, "Member 'UWBP_GymPreflowWidget_C::Image_472' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, LevelNameText) == 0x000390, "Member 'UWBP_GymPreflowWidget_C::LevelNameText' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, SkipBox) == 0x000398, "Member 'UWBP_GymPreflowWidget_C::SkipBox' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, As_Gym_Game_State) == 0x0003A0, "Member 'UWBP_GymPreflowWidget_C::As_Gym_Game_State' has a wrong offset!");
static_assert(offsetof(UWBP_GymPreflowWidget_C, PlayerController) == 0x0003A8, "Member 'UWBP_GymPreflowWidget_C::PlayerController' has a wrong offset!");

}

