#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymRuleStateWidgetLoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GymRuleStateWidgetLoot.WBP_GymRuleStateWidgetLoot_C
// 0x0080 (0x03C0 - 0x0340)
class UWBP_GymRuleStateWidgetLoot_C final : public UGymGuiRuleStateWidgetLoot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowStatusPanel;                                   // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CheckpointBrushBG;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CounterText;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGymGuiPostflow_BP_C*                   GymGuiPostflow;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LaurelIcon;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RankingContainer;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RankingText;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RuleStatusText;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimerBrushBG;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RoyaleQualified_C*                 WBP_RoyaleQualified;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGymRuleParticipantState                      LastRuleStatus;                                    // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGymGameState*                          GymGameState;                                      // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGymLootReplicatedData*                 RuleData;                                          // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   PlayerController;                                  // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGymParticipantRepDataLoot*             ParticipantData;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GymRuleStateWidgetLoot(int32 EntryPoint);
	void OnEliminated(const EEliminationReason EliminationReason);
	void OnFinished(bool bIsRoyale);
	void SetCounterText();
	void SetRankingText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TickParticipantAndRule();
	void TickUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GymRuleStateWidgetLoot_C">();
	}
	static class UWBP_GymRuleStateWidgetLoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GymRuleStateWidgetLoot_C>();
	}
};
static_assert(alignof(UWBP_GymRuleStateWidgetLoot_C) == 0x000008, "Wrong alignment on UWBP_GymRuleStateWidgetLoot_C");
static_assert(sizeof(UWBP_GymRuleStateWidgetLoot_C) == 0x0003C0, "Wrong size on UWBP_GymRuleStateWidgetLoot_C");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, UberGraphFrame) == 0x000340, "Member 'UWBP_GymRuleStateWidgetLoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, ShowStatusPanel) == 0x000348, "Member 'UWBP_GymRuleStateWidgetLoot_C::ShowStatusPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, CheckpointBrushBG) == 0x000350, "Member 'UWBP_GymRuleStateWidgetLoot_C::CheckpointBrushBG' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, CounterText) == 0x000358, "Member 'UWBP_GymRuleStateWidgetLoot_C::CounterText' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, GymGuiPostflow) == 0x000360, "Member 'UWBP_GymRuleStateWidgetLoot_C::GymGuiPostflow' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, LaurelIcon) == 0x000368, "Member 'UWBP_GymRuleStateWidgetLoot_C::LaurelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, RankingContainer) == 0x000370, "Member 'UWBP_GymRuleStateWidgetLoot_C::RankingContainer' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, RankingText) == 0x000378, "Member 'UWBP_GymRuleStateWidgetLoot_C::RankingText' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, RuleStatusText) == 0x000380, "Member 'UWBP_GymRuleStateWidgetLoot_C::RuleStatusText' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, TimerBrushBG) == 0x000388, "Member 'UWBP_GymRuleStateWidgetLoot_C::TimerBrushBG' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, WBP_RoyaleQualified) == 0x000390, "Member 'UWBP_GymRuleStateWidgetLoot_C::WBP_RoyaleQualified' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, LastRuleStatus) == 0x000398, "Member 'UWBP_GymRuleStateWidgetLoot_C::LastRuleStatus' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, GymGameState) == 0x0003A0, "Member 'UWBP_GymRuleStateWidgetLoot_C::GymGameState' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, RuleData) == 0x0003A8, "Member 'UWBP_GymRuleStateWidgetLoot_C::RuleData' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, PlayerController) == 0x0003B0, "Member 'UWBP_GymRuleStateWidgetLoot_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetLoot_C, ParticipantData) == 0x0003B8, "Member 'UWBP_GymRuleStateWidgetLoot_C::ParticipantData' has a wrong offset!");

}

