#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TabButton.WBP_TabButton_C.ExecuteUbergraph_WBP_TabButton
// 0x0030 (0x0030 - 0x0000)
struct WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
};
static_assert(alignof(WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton) == 0x000004, "Wrong alignment on WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton");
static_assert(sizeof(WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton) == 0x000030, "Wrong size on WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton");
static_assert(offsetof(WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton, EntryPoint) == 0x000000, "Member 'WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function WBP_TabButton.WBP_TabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TabButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TabButton_C_PreConstruct");
static_assert(sizeof(WBP_TabButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_TabButton_C_PreConstruct");
static_assert(offsetof(WBP_TabButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TabButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

