#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpectatorLootWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpectatorLootWidget.WBP_SpectatorLootWidget_C.ExecuteUbergraph_WBP_SpectatorLootWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget) == 0x000004, "Wrong alignment on WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget");
static_assert(sizeof(WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget) == 0x000040, "Wrong size on WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget");
static_assert(offsetof(WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget, EntryPoint) == 0x000000, "Member 'WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_SpectatorLootWidget_C_ExecuteUbergraph_WBP_SpectatorLootWidget::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WBP_SpectatorLootWidget.WBP_SpectatorLootWidget_C.GetLootText
// 0x0138 (0x0138 - 0x0000)
struct WBP_SpectatorLootWidget_C_GetLootText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCollectingStarted_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLootLeft_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLootCollected_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0050)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0120(0x0018)()
};
static_assert(alignof(WBP_SpectatorLootWidget_C_GetLootText) == 0x000008, "Wrong alignment on WBP_SpectatorLootWidget_C_GetLootText");
static_assert(sizeof(WBP_SpectatorLootWidget_C_GetLootText) == 0x000138, "Wrong size on WBP_SpectatorLootWidget_C_GetLootText");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, ReturnValue) == 0x000000, "Member 'WBP_SpectatorLootWidget_C_GetLootText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, Temp_text_Variable) == 0x000018, "Member 'WBP_SpectatorLootWidget_C_GetLootText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_SpectatorLootWidget_C_GetLootText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, CallFunc_HasCollectingStarted_ReturnValue) == 0x000031, "Member 'WBP_SpectatorLootWidget_C_GetLootText::CallFunc_HasCollectingStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, CallFunc_GetLootLeft_ReturnValue) == 0x000034, "Member 'WBP_SpectatorLootWidget_C_GetLootText::CallFunc_GetLootLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, CallFunc_GetLootCollected_ReturnValue) == 0x000038, "Member 'WBP_SpectatorLootWidget_C_GetLootText::CallFunc_GetLootCollected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_SpectatorLootWidget_C_GetLootText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000040, "Member 'WBP_SpectatorLootWidget_C_GetLootText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000048, "Member 'WBP_SpectatorLootWidget_C_GetLootText::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_SpectatorLootWidget_C_GetLootText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'WBP_SpectatorLootWidget_C_GetLootText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, Temp_bool_Variable) == 0x0000F0, "Member 'WBP_SpectatorLootWidget_C_GetLootText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, K2Node_MakeArray_Array) == 0x0000F8, "Member 'WBP_SpectatorLootWidget_C_GetLootText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, CallFunc_Format_ReturnValue) == 0x000108, "Member 'WBP_SpectatorLootWidget_C_GetLootText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_GetLootText, K2Node_Select_Default) == 0x000120, "Member 'WBP_SpectatorLootWidget_C_GetLootText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SpectatorLootWidget.WBP_SpectatorLootWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_SpectatorLootWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorLootWidget_C_Tick) == 0x000004, "Wrong alignment on WBP_SpectatorLootWidget_C_Tick");
static_assert(sizeof(WBP_SpectatorLootWidget_C_Tick) == 0x00003C, "Wrong size on WBP_SpectatorLootWidget_C_Tick");
static_assert(offsetof(WBP_SpectatorLootWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_SpectatorLootWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_SpectatorLootWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_SpectatorLootWidget.WBP_SpectatorLootWidget_C.TickLootTextAndVisibility
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpectatorLootWidget_C_TickLootTextAndVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGymRulesState                                CallFunc_GetRuleState_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLootText_ReturnValue;                  // 0x0008(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility) == 0x000008, "Wrong alignment on WBP_SpectatorLootWidget_C_TickLootTextAndVisibility");
static_assert(sizeof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility) == 0x000028, "Wrong size on WBP_SpectatorLootWidget_C_TickLootTextAndVisibility");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, CallFunc_GetRuleState_ReturnValue) == 0x000002, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::CallFunc_GetRuleState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, Temp_byte_Variable) == 0x000004, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, CallFunc_GetLootText_ReturnValue) == 0x000008, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::CallFunc_GetLootText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickLootTextAndVisibility, K2Node_Select_Default) == 0x000022, "Member 'WBP_SpectatorLootWidget_C_TickLootTextAndVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SpectatorLootWidget.WBP_SpectatorLootWidget_C.TickParticipantAndRule
// 0x0010 (0x0010 - 0x0000)
struct WBP_SpectatorLootWidget_C_TickParticipantAndRule final
{
public:
	class UGymParticipantRepDataLoot*             CallFunc_GetParticipantData_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymLootReplicatedData*                 CallFunc_GetRuleData_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorLootWidget_C_TickParticipantAndRule) == 0x000008, "Wrong alignment on WBP_SpectatorLootWidget_C_TickParticipantAndRule");
static_assert(sizeof(WBP_SpectatorLootWidget_C_TickParticipantAndRule) == 0x000010, "Wrong size on WBP_SpectatorLootWidget_C_TickParticipantAndRule");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickParticipantAndRule, CallFunc_GetParticipantData_ReturnValue) == 0x000000, "Member 'WBP_SpectatorLootWidget_C_TickParticipantAndRule::CallFunc_GetParticipantData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickParticipantAndRule, CallFunc_GetRuleData_ReturnValue) == 0x000008, "Member 'WBP_SpectatorLootWidget_C_TickParticipantAndRule::CallFunc_GetRuleData_ReturnValue' has a wrong offset!");

// Function WBP_SpectatorLootWidget.WBP_SpectatorLootWidget_C.TickUI
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_SpectatorLootWidget_C_TickUI final
{
public:
	float                                         CallFunc_GetRaceStartTime_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRaceMaxTime_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatTime_ReturnValue;                   // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EGymRulesState                                CallFunc_GetRuleState_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FormatTime_Time_ImplicitCast;             // 0x00B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorLootWidget_C_TickUI) == 0x000008, "Wrong alignment on WBP_SpectatorLootWidget_C_TickUI");
static_assert(sizeof(WBP_SpectatorLootWidget_C_TickUI) == 0x0000B8, "Wrong size on WBP_SpectatorLootWidget_C_TickUI");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_GetRaceStartTime_ReturnValue) == 0x000000, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_GetRaceStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_GetRaceMaxTime_ReturnValue) == 0x000004, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_GetRaceMaxTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_SpectatorLootWidget_C_TickUI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000018, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_FormatTime_ReturnValue) == 0x000040, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_FormatTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_GetRuleState_ReturnValue) == 0x000050, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_GetRuleState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000070, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000080, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000090, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_PlayAnimation_ReturnValue_2) == 0x000098, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0000A0, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorLootWidget_C_TickUI, CallFunc_FormatTime_Time_ImplicitCast) == 0x0000B0, "Member 'WBP_SpectatorLootWidget_C_TickUI::CallFunc_FormatTime_Time_ImplicitCast' has a wrong offset!");

}

