#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RulestateWidgetBasics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RulestateWidgetBasics.WBP_RulestateWidgetBasics_C
// 0x0108 (0x0448 - 0x0340)
class UWBP_RulestateWidgetBasics_C final : public UGymGuiRuleStateWidgetBasics
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    CommonActionWidget;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_1;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_2;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_178;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_155;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           EndState;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               FirstPage;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            FPButton;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadBoxStartFirst;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadBoxStartSecond;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadButtonEnd;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeader_Style1_C*                       Header_Style1;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_800;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_1;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MouseBoxStartSecond;                               // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            MouseButtonEnd;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            MouseKBBoxStartFirst;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PageSwitcher;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RunningState;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SecondPage;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StartState;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        StartStateSwitcher;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlaymenuButton_Green_C*            TPButton;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGymRuleReplicatedData*                 RuleData;                                          // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         LastTickState;                                     // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_RulestateWidgetBasics_TPButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_RulestateWidgetBasics_WBP_PlaymenuButton_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_RulestateWidgetBasics_WBP_PlaymenuButton_2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_RulestateWidgetBasics_WBP_PlaymenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_RulestateWidgetBasics(int32 EntryPoint);
	void InpActEvt_Confirm_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_Decline_K2Node_InputActionEvent_1(const struct FKey& Key);
	ESlateVisibility InputMethodToGamepadVisibility(ECommonInputType Index_0);
	ESlateVisibility InputModeToMouseVisibility(ECommonInputType Index_0);
	bool IsUsingGamepad();
	void OnInputMethodChanged_Event(ECommonInputType bNewInputType);
	void OnPressedEnd();
	void OnPressedStart();
	void OpenSecondPage();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TickState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RulestateWidgetBasics_C">();
	}
	static class UWBP_RulestateWidgetBasics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RulestateWidgetBasics_C>();
	}
};
static_assert(alignof(UWBP_RulestateWidgetBasics_C) == 0x000008, "Wrong alignment on UWBP_RulestateWidgetBasics_C");
static_assert(sizeof(UWBP_RulestateWidgetBasics_C) == 0x000448, "Wrong size on UWBP_RulestateWidgetBasics_C");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, UberGraphFrame) == 0x000340, "Member 'UWBP_RulestateWidgetBasics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, CommonActionWidget) == 0x000348, "Member 'UWBP_RulestateWidgetBasics_C::CommonActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, CommonActionWidget_1) == 0x000350, "Member 'UWBP_RulestateWidgetBasics_C::CommonActionWidget_1' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, CommonActionWidget_2) == 0x000358, "Member 'UWBP_RulestateWidgetBasics_C::CommonActionWidget_2' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, CommonActionWidget_178) == 0x000360, "Member 'UWBP_RulestateWidgetBasics_C::CommonActionWidget_178' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, CommonRichTextBlock_155) == 0x000368, "Member 'UWBP_RulestateWidgetBasics_C::CommonRichTextBlock_155' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, EndState) == 0x000370, "Member 'UWBP_RulestateWidgetBasics_C::EndState' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, FirstPage) == 0x000378, "Member 'UWBP_RulestateWidgetBasics_C::FirstPage' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, FPButton) == 0x000380, "Member 'UWBP_RulestateWidgetBasics_C::FPButton' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, GamepadBoxStartFirst) == 0x000388, "Member 'UWBP_RulestateWidgetBasics_C::GamepadBoxStartFirst' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, GamepadBoxStartSecond) == 0x000390, "Member 'UWBP_RulestateWidgetBasics_C::GamepadBoxStartSecond' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, GamepadButtonEnd) == 0x000398, "Member 'UWBP_RulestateWidgetBasics_C::GamepadButtonEnd' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Header_Style1) == 0x0003A0, "Member 'UWBP_RulestateWidgetBasics_C::Header_Style1' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Image) == 0x0003A8, "Member 'UWBP_RulestateWidgetBasics_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Image_1) == 0x0003B0, "Member 'UWBP_RulestateWidgetBasics_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Image_2) == 0x0003B8, "Member 'UWBP_RulestateWidgetBasics_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Image_3) == 0x0003C0, "Member 'UWBP_RulestateWidgetBasics_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Image_4) == 0x0003C8, "Member 'UWBP_RulestateWidgetBasics_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Image_5) == 0x0003D0, "Member 'UWBP_RulestateWidgetBasics_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Image_800) == 0x0003D8, "Member 'UWBP_RulestateWidgetBasics_C::Image_800' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Logo) == 0x0003E0, "Member 'UWBP_RulestateWidgetBasics_C::Logo' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, Logo_1) == 0x0003E8, "Member 'UWBP_RulestateWidgetBasics_C::Logo_1' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, MouseBoxStartSecond) == 0x0003F0, "Member 'UWBP_RulestateWidgetBasics_C::MouseBoxStartSecond' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, MouseButtonEnd) == 0x0003F8, "Member 'UWBP_RulestateWidgetBasics_C::MouseButtonEnd' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, MouseKBBoxStartFirst) == 0x000400, "Member 'UWBP_RulestateWidgetBasics_C::MouseKBBoxStartFirst' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, PageSwitcher) == 0x000408, "Member 'UWBP_RulestateWidgetBasics_C::PageSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, RunningState) == 0x000410, "Member 'UWBP_RulestateWidgetBasics_C::RunningState' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, SecondPage) == 0x000418, "Member 'UWBP_RulestateWidgetBasics_C::SecondPage' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, StartState) == 0x000420, "Member 'UWBP_RulestateWidgetBasics_C::StartState' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, StartStateSwitcher) == 0x000428, "Member 'UWBP_RulestateWidgetBasics_C::StartStateSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, TPButton) == 0x000430, "Member 'UWBP_RulestateWidgetBasics_C::TPButton' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, RuleData) == 0x000438, "Member 'UWBP_RulestateWidgetBasics_C::RuleData' has a wrong offset!");
static_assert(offsetof(UWBP_RulestateWidgetBasics_C, LastTickState) == 0x000440, "Member 'UWBP_RulestateWidgetBasics_C::LastTickState' has a wrong offset!");

}

