#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpectatorSprintWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpectatorSprintWidget.WBP_SpectatorSprintWidget_C
// 0x0058 (0x0398 - 0x0340)
class UWBP_SpectatorSprintWidget_C final : public UGymGuiSpectatorRuleWidgetSprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowStatusPanel;                                   // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CheckpointBrushBG;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CheckpointCounter;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CounterText;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RuleStatusText;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimerBrushBG;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RoyaleQualified_C*                 WBP_RoyaleQualified;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGymRulesState                                LastRuleStatus;                                    // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGymParticipantRepData*                 ParticipantData;                                   // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGymRuleReplicatedData*                 RuleData;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SpectatorSprintWidget(int32 EntryPoint);
	class FText GetCheckpointCounterText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TickCheckpointVisibilityAndText();
	void TickParticipantAndRule();
	void TickUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpectatorSprintWidget_C">();
	}
	static class UWBP_SpectatorSprintWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpectatorSprintWidget_C>();
	}
};
static_assert(alignof(UWBP_SpectatorSprintWidget_C) == 0x000008, "Wrong alignment on UWBP_SpectatorSprintWidget_C");
static_assert(sizeof(UWBP_SpectatorSprintWidget_C) == 0x000398, "Wrong size on UWBP_SpectatorSprintWidget_C");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, UberGraphFrame) == 0x000340, "Member 'UWBP_SpectatorSprintWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, ShowStatusPanel) == 0x000348, "Member 'UWBP_SpectatorSprintWidget_C::ShowStatusPanel' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, CheckpointBrushBG) == 0x000350, "Member 'UWBP_SpectatorSprintWidget_C::CheckpointBrushBG' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, CheckpointCounter) == 0x000358, "Member 'UWBP_SpectatorSprintWidget_C::CheckpointCounter' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, CounterText) == 0x000360, "Member 'UWBP_SpectatorSprintWidget_C::CounterText' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, RuleStatusText) == 0x000368, "Member 'UWBP_SpectatorSprintWidget_C::RuleStatusText' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, TimerBrushBG) == 0x000370, "Member 'UWBP_SpectatorSprintWidget_C::TimerBrushBG' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, WBP_RoyaleQualified) == 0x000378, "Member 'UWBP_SpectatorSprintWidget_C::WBP_RoyaleQualified' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, LastRuleStatus) == 0x000380, "Member 'UWBP_SpectatorSprintWidget_C::LastRuleStatus' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, ParticipantData) == 0x000388, "Member 'UWBP_SpectatorSprintWidget_C::ParticipantData' has a wrong offset!");
static_assert(offsetof(UWBP_SpectatorSprintWidget_C, RuleData) == 0x000390, "Member 'UWBP_SpectatorSprintWidget_C::RuleData' has a wrong offset!");

}

