#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LevelKitContainer_Make

#include "Basic.hpp"

#include "KitData_structs.hpp"


namespace SDK::Params
{

// Function WBP_LevelKitContainer_Make.WBP_LevelKitContainer_Make_C.ExecuteUbergraph_WBP_LevelKitContainer_Make
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWPB_LevelkitButton_Make_C* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWPB_LevelkitButton_Make_C*             CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0048(0x0010)(ReferenceParm)
	class UWPB_LevelkitButton_Make_C*             K2Node_CustomEvent_Button;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKitData                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make) == 0x000008, "Wrong alignment on WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make");
static_assert(sizeof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make) == 0x0000E0, "Wrong size on WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, EntryPoint) == 0x000000, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000048, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, K2Node_CustomEvent_Button) == 0x000058, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D0, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_Array_Length_ReturnValue) == 0x0000D4, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_LevelKitContainer_Make_C_ExecuteUbergraph_WBP_LevelKitContainer_Make::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_LevelKitContainer_Make.WBP_LevelKitContainer_Make_C.GetSelectedKit
// 0x0080 (0x0080 - 0x0000)
struct WBP_LevelKitContainer_Make_C_GetSelectedKit final
{
public:
	struct FKitData                               KitData;                                           // 0x0000(0x0068)(Parm, OutParm, HasGetValueTypeHash)
	class UGymGuiGenericTabButton*                CallFunc_GetCurrentButton_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWPB_LevelkitButton_Make_C*             K2Node_DynamicCast_AsWPB_Levelkit_Button_Make;     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelKitContainer_Make_C_GetSelectedKit) == 0x000008, "Wrong alignment on WBP_LevelKitContainer_Make_C_GetSelectedKit");
static_assert(sizeof(WBP_LevelKitContainer_Make_C_GetSelectedKit) == 0x000080, "Wrong size on WBP_LevelKitContainer_Make_C_GetSelectedKit");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_GetSelectedKit, KitData) == 0x000000, "Member 'WBP_LevelKitContainer_Make_C_GetSelectedKit::KitData' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_GetSelectedKit, CallFunc_GetCurrentButton_ReturnValue) == 0x000068, "Member 'WBP_LevelKitContainer_Make_C_GetSelectedKit::CallFunc_GetCurrentButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_GetSelectedKit, K2Node_DynamicCast_AsWPB_Levelkit_Button_Make) == 0x000070, "Member 'WBP_LevelKitContainer_Make_C_GetSelectedKit::K2Node_DynamicCast_AsWPB_Levelkit_Button_Make' has a wrong offset!");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_GetSelectedKit, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_LevelKitContainer_Make_C_GetSelectedKit::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_LevelKitContainer_Make.WBP_LevelKitContainer_Make_C.HoverEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_LevelKitContainer_Make_C_HoverEvent final
{
public:
	class UWPB_LevelkitButton_Make_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelKitContainer_Make_C_HoverEvent) == 0x000008, "Wrong alignment on WBP_LevelKitContainer_Make_C_HoverEvent");
static_assert(sizeof(WBP_LevelKitContainer_Make_C_HoverEvent) == 0x000008, "Wrong size on WBP_LevelKitContainer_Make_C_HoverEvent");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_HoverEvent, Button) == 0x000000, "Member 'WBP_LevelKitContainer_Make_C_HoverEvent::Button' has a wrong offset!");

// Function WBP_LevelKitContainer_Make.WBP_LevelKitContainer_Make_C.OnHoveredTabButton__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct WBP_LevelKitContainer_Make_C_OnHoveredTabButton__DelegateSignature final
{
public:
	struct FKitData                               KitData;                                           // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelKitContainer_Make_C_OnHoveredTabButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LevelKitContainer_Make_C_OnHoveredTabButton__DelegateSignature");
static_assert(sizeof(WBP_LevelKitContainer_Make_C_OnHoveredTabButton__DelegateSignature) == 0x000068, "Wrong size on WBP_LevelKitContainer_Make_C_OnHoveredTabButton__DelegateSignature");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_OnHoveredTabButton__DelegateSignature, KitData) == 0x000000, "Member 'WBP_LevelKitContainer_Make_C_OnHoveredTabButton__DelegateSignature::KitData' has a wrong offset!");

// Function WBP_LevelKitContainer_Make.WBP_LevelKitContainer_Make_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LevelKitContainer_Make_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelKitContainer_Make_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LevelKitContainer_Make_C_PreConstruct");
static_assert(sizeof(WBP_LevelKitContainer_Make_C_PreConstruct) == 0x000001, "Wrong size on WBP_LevelKitContainer_Make_C_PreConstruct");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LevelKitContainer_Make_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LevelKitContainer_Make.WBP_LevelKitContainer_Make_C.ScrollToview
// 0x0008 (0x0008 - 0x0000)
struct WBP_LevelKitContainer_Make_C_ScrollToview final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelKitContainer_Make_C_ScrollToview) == 0x000008, "Wrong alignment on WBP_LevelKitContainer_Make_C_ScrollToview");
static_assert(sizeof(WBP_LevelKitContainer_Make_C_ScrollToview) == 0x000008, "Wrong size on WBP_LevelKitContainer_Make_C_ScrollToview");
static_assert(offsetof(WBP_LevelKitContainer_Make_C_ScrollToview, Widget) == 0x000000, "Member 'WBP_LevelKitContainer_Make_C_ScrollToview::Widget' has a wrong offset!");

}

