#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BoolPropertySetting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_BoolPropertySetting.WBP_BoolPropertySetting_C.ExecuteUbergraph_WBP_BoolPropertySetting
// 0x0008 (0x0008 - 0x0000)
struct WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting) == 0x000004, "Wrong alignment on WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting");
static_assert(sizeof(WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting) == 0x000008, "Wrong size on WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting");
static_assert(offsetof(WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting, EntryPoint) == 0x000000, "Member 'WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_BoolPropertySetting_C_ExecuteUbergraph_WBP_BoolPropertySetting::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_BoolPropertySetting.WBP_BoolPropertySetting_C.OnSelect
// 0x0001 (0x0001 - 0x0000)
struct WBP_BoolPropertySetting_C_OnSelect final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BoolPropertySetting_C_OnSelect) == 0x000001, "Wrong alignment on WBP_BoolPropertySetting_C_OnSelect");
static_assert(sizeof(WBP_BoolPropertySetting_C_OnSelect) == 0x000001, "Wrong size on WBP_BoolPropertySetting_C_OnSelect");
static_assert(offsetof(WBP_BoolPropertySetting_C_OnSelect, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_BoolPropertySetting_C_OnSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_BoolPropertySetting.WBP_BoolPropertySetting_C.SetColors
// 0x00D4 (0x00D4 - 0x0000)
struct WBP_BoolPropertySetting_C_SetColors final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BoolPropertySetting_C_SetColors) == 0x000004, "Wrong alignment on WBP_BoolPropertySetting_C_SetColors");
static_assert(sizeof(WBP_BoolPropertySetting_C_SetColors) == 0x0000D4, "Wrong size on WBP_BoolPropertySetting_C_SetColors");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_bool_Variable) == 0x000000, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_struct_Variable) == 0x000004, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_bool_Variable_1) == 0x000024, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_struct_Variable_2) == 0x000028, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_struct_Variable_3) == 0x000038, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_bool_Variable_2) == 0x000048, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_struct_Variable_4) == 0x00004C, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_struct_Variable_5) == 0x00005C, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_bool_Variable_3) == 0x00006C, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_struct_Variable_6) == 0x000070, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, Temp_struct_Variable_7) == 0x000080, "Member 'WBP_BoolPropertySetting_C_SetColors::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, K2Node_Select_Default) == 0x000090, "Member 'WBP_BoolPropertySetting_C_SetColors::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, CallFunc_Not_PreBool_ReturnValue) == 0x0000A0, "Member 'WBP_BoolPropertySetting_C_SetColors::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, K2Node_Select_Default_1) == 0x0000A4, "Member 'WBP_BoolPropertySetting_C_SetColors::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, K2Node_Select_Default_2) == 0x0000B4, "Member 'WBP_BoolPropertySetting_C_SetColors::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_BoolPropertySetting_C_SetColors, K2Node_Select_Default_3) == 0x0000C4, "Member 'WBP_BoolPropertySetting_C_SetColors::K2Node_Select_Default_3' has a wrong offset!");

}

