#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymRuleStateWidgetObstacle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GymRuleStateWidgetObstacle.WBP_GymRuleStateWidgetObstacle_C
// 0x00A8 (0x03E8 - 0x0340)
class UWBP_GymRuleStateWidgetObstacle_C final : public UGymGuiRuleStateWidgetObstacle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideStatusPanel;                                   // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowStatusPanel;                                   // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CheckpointBrushBG;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckpointCounter_WBP_C*               CheckpointCounter_WBP;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FlagCounter;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGymGuiPostflow_BP_C*                   GymGuiPostflow;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LaurelIcon;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       PlaceFlagInputActionUI_1;                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RankingContainer;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RankingText;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       RespawnInputActionUI;                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RuleStatusText;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimerBrushBG;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RoyaleQualified_C*                 WBP_RoyaleQualified_92;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGymRuleParticipantState                      LastRuleStatus;                                    // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RunningStartTime;                                  // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGymGameState*                          GameState;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGymPlayerController*                   PlayerController;                                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGymParticipantRepDataObby*             ParticipantData;                                   // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGymOCReplicatedData*                   RuleData;                                          // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GymRuleStateWidgetObstacle(int32 EntryPoint);
	void OnEliminated(const EEliminationReason EliminationReason);
	void OnFinished(bool bIsRoyale);
	void SetFlagCounter();
	void SetRankingText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TickGameStateAndController();
	void TickRuleAndParticipant();
	void TickUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GymRuleStateWidgetObstacle_C">();
	}
	static class UWBP_GymRuleStateWidgetObstacle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GymRuleStateWidgetObstacle_C>();
	}
};
static_assert(alignof(UWBP_GymRuleStateWidgetObstacle_C) == 0x000008, "Wrong alignment on UWBP_GymRuleStateWidgetObstacle_C");
static_assert(sizeof(UWBP_GymRuleStateWidgetObstacle_C) == 0x0003E8, "Wrong size on UWBP_GymRuleStateWidgetObstacle_C");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, UberGraphFrame) == 0x000340, "Member 'UWBP_GymRuleStateWidgetObstacle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, HideStatusPanel) == 0x000348, "Member 'UWBP_GymRuleStateWidgetObstacle_C::HideStatusPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, ShowStatusPanel) == 0x000350, "Member 'UWBP_GymRuleStateWidgetObstacle_C::ShowStatusPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, CheckpointBrushBG) == 0x000358, "Member 'UWBP_GymRuleStateWidgetObstacle_C::CheckpointBrushBG' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, CheckpointCounter_WBP) == 0x000360, "Member 'UWBP_GymRuleStateWidgetObstacle_C::CheckpointCounter_WBP' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, FlagCounter) == 0x000368, "Member 'UWBP_GymRuleStateWidgetObstacle_C::FlagCounter' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, GymGuiPostflow) == 0x000370, "Member 'UWBP_GymRuleStateWidgetObstacle_C::GymGuiPostflow' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, LaurelIcon) == 0x000378, "Member 'UWBP_GymRuleStateWidgetObstacle_C::LaurelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, PlaceFlagInputActionUI_1) == 0x000380, "Member 'UWBP_GymRuleStateWidgetObstacle_C::PlaceFlagInputActionUI_1' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, RankingContainer) == 0x000388, "Member 'UWBP_GymRuleStateWidgetObstacle_C::RankingContainer' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, RankingText) == 0x000390, "Member 'UWBP_GymRuleStateWidgetObstacle_C::RankingText' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, RespawnInputActionUI) == 0x000398, "Member 'UWBP_GymRuleStateWidgetObstacle_C::RespawnInputActionUI' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, RuleStatusText) == 0x0003A0, "Member 'UWBP_GymRuleStateWidgetObstacle_C::RuleStatusText' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, TimerBrushBG) == 0x0003A8, "Member 'UWBP_GymRuleStateWidgetObstacle_C::TimerBrushBG' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, WBP_RoyaleQualified_92) == 0x0003B0, "Member 'UWBP_GymRuleStateWidgetObstacle_C::WBP_RoyaleQualified_92' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, LastRuleStatus) == 0x0003B8, "Member 'UWBP_GymRuleStateWidgetObstacle_C::LastRuleStatus' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, RunningStartTime) == 0x0003C0, "Member 'UWBP_GymRuleStateWidgetObstacle_C::RunningStartTime' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, GameState) == 0x0003C8, "Member 'UWBP_GymRuleStateWidgetObstacle_C::GameState' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, PlayerController) == 0x0003D0, "Member 'UWBP_GymRuleStateWidgetObstacle_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, ParticipantData) == 0x0003D8, "Member 'UWBP_GymRuleStateWidgetObstacle_C::ParticipantData' has a wrong offset!");
static_assert(offsetof(UWBP_GymRuleStateWidgetObstacle_C, RuleData) == 0x0003E0, "Member 'UWBP_GymRuleStateWidgetObstacle_C::RuleData' has a wrong offset!");

}

