#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpectatorTideWidget

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpectatorTideWidget.WBP_SpectatorTideWidget_C.ExecuteUbergraph_WBP_SpectatorTideWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget) == 0x000004, "Wrong alignment on WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget");
static_assert(sizeof(WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget) == 0x000040, "Wrong size on WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget");
static_assert(offsetof(WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget, EntryPoint) == 0x000000, "Member 'WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_SpectatorTideWidget_C_ExecuteUbergraph_WBP_SpectatorTideWidget::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WBP_SpectatorTideWidget.WBP_SpectatorTideWidget_C.Get_CounterText_Text
// 0x0110 (0x0110 - 0x0000)
struct WBP_SpectatorTideWidget_C_Get_CounterText_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UGymRuleReplicatedData*                 CallFunc_GetRuleData_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCheckpointCount_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CheckpointsVisited_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorTideWidget_C_Get_CounterText_Text) == 0x000008, "Wrong alignment on WBP_SpectatorTideWidget_C_Get_CounterText_Text");
static_assert(sizeof(WBP_SpectatorTideWidget_C_Get_CounterText_Text) == 0x000110, "Wrong size on WBP_SpectatorTideWidget_C_Get_CounterText_Text");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, ReturnValue) == 0x000000, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_GetRuleData_ReturnValue) == 0x000018, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_GetRuleData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_GetCheckpointCount_ReturnValue) == 0x000024, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_GetCheckpointCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_CheckpointsVisited_ReturnValue) == 0x00002C, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_CheckpointsVisited_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000030, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000038, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Get_CounterText_Text, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'WBP_SpectatorTideWidget_C_Get_CounterText_Text::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_SpectatorTideWidget.WBP_SpectatorTideWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_SpectatorTideWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorTideWidget_C_Tick) == 0x000004, "Wrong alignment on WBP_SpectatorTideWidget_C_Tick");
static_assert(sizeof(WBP_SpectatorTideWidget_C_Tick) == 0x00003C, "Wrong size on WBP_SpectatorTideWidget_C_Tick");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_SpectatorTideWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_SpectatorTideWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_SpectatorTideWidget.WBP_SpectatorTideWidget_C.TickCheckpointVisibilityAndText
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGymRulesState                                CallFunc_GetRuleState_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_CounterText_Text_ReturnValue;         // 0x0008(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText) == 0x000008, "Wrong alignment on WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText");
static_assert(sizeof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText) == 0x000028, "Wrong size on WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, Temp_bool_Variable) == 0x000000, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, CallFunc_GetRuleState_ReturnValue) == 0x000002, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::CallFunc_GetRuleState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, Temp_byte_Variable) == 0x000004, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, CallFunc_Get_CounterText_Text_ReturnValue) == 0x000008, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::CallFunc_Get_CounterText_Text_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText, K2Node_Select_Default) == 0x000021, "Member 'WBP_SpectatorTideWidget_C_TickCheckpointVisibilityAndText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SpectatorTideWidget.WBP_SpectatorTideWidget_C.TickParticipantAndRule
// 0x0010 (0x0010 - 0x0000)
struct WBP_SpectatorTideWidget_C_TickParticipantAndRule final
{
public:
	class UGymParticipantRepData*                 CallFunc_GetParticipantData_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGymRuleReplicatedData*                 CallFunc_GetRuleData_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorTideWidget_C_TickParticipantAndRule) == 0x000008, "Wrong alignment on WBP_SpectatorTideWidget_C_TickParticipantAndRule");
static_assert(sizeof(WBP_SpectatorTideWidget_C_TickParticipantAndRule) == 0x000010, "Wrong size on WBP_SpectatorTideWidget_C_TickParticipantAndRule");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickParticipantAndRule, CallFunc_GetParticipantData_ReturnValue) == 0x000000, "Member 'WBP_SpectatorTideWidget_C_TickParticipantAndRule::CallFunc_GetParticipantData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickParticipantAndRule, CallFunc_GetRuleData_ReturnValue) == 0x000008, "Member 'WBP_SpectatorTideWidget_C_TickParticipantAndRule::CallFunc_GetRuleData_ReturnValue' has a wrong offset!");

// Function WBP_SpectatorTideWidget.WBP_SpectatorTideWidget_C.TickUI
// 0x0090 (0x0090 - 0x0000)
struct WBP_SpectatorTideWidget_C_TickUI final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRaceStartTime_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatTime_ReturnValue;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	EGymRulesState                                CallFunc_GetRuleState_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FormatTime_Time_ImplicitCast;             // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpectatorTideWidget_C_TickUI) == 0x000008, "Wrong alignment on WBP_SpectatorTideWidget_C_TickUI");
static_assert(sizeof(WBP_SpectatorTideWidget_C_TickUI) == 0x000090, "Wrong size on WBP_SpectatorTideWidget_C_TickUI");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_SpectatorTideWidget_C_TickUI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000010, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_GetRaceStartTime_ReturnValue) == 0x000018, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_GetRaceStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_FormatTime_ReturnValue) == 0x000030, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_FormatTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_GetRuleState_ReturnValue) == 0x000060, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_GetRuleState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000061, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000064, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000068, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_PlayAnimation_ReturnValue_2) == 0x000078, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000080, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpectatorTideWidget_C_TickUI, CallFunc_FormatTime_Time_ImplicitCast) == 0x000088, "Member 'WBP_SpectatorTideWidget_C_TickUI::CallFunc_FormatTime_Time_ImplicitCast' has a wrong offset!");

}

