#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Pagination_PageNumberTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Pagination_PageNumberTab.WBP_Pagination_PageNumberTab_C
// 0x0030 (0x0338 - 0x0308)
class UWBP_Pagination_PageNumberTab_C final : public UGymGuiGenericTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PushAnim;                                          // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       HorizontalText;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TextBorder;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Page;                                              // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Pagination_PageNumberTab_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Pagination_PageNumberTab_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Pagination_PageNumberTab(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Select();
	void Unselect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Pagination_PageNumberTab_C">();
	}
	static class UWBP_Pagination_PageNumberTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Pagination_PageNumberTab_C>();
	}
};
static_assert(alignof(UWBP_Pagination_PageNumberTab_C) == 0x000008, "Wrong alignment on UWBP_Pagination_PageNumberTab_C");
static_assert(sizeof(UWBP_Pagination_PageNumberTab_C) == 0x000338, "Wrong size on UWBP_Pagination_PageNumberTab_C");
static_assert(offsetof(UWBP_Pagination_PageNumberTab_C, UberGraphFrame) == 0x000308, "Member 'UWBP_Pagination_PageNumberTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Pagination_PageNumberTab_C, PushAnim) == 0x000310, "Member 'UWBP_Pagination_PageNumberTab_C::PushAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Pagination_PageNumberTab_C, HoverAnim) == 0x000318, "Member 'UWBP_Pagination_PageNumberTab_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Pagination_PageNumberTab_C, HorizontalText) == 0x000320, "Member 'UWBP_Pagination_PageNumberTab_C::HorizontalText' has a wrong offset!");
static_assert(offsetof(UWBP_Pagination_PageNumberTab_C, TextBorder) == 0x000328, "Member 'UWBP_Pagination_PageNumberTab_C::TextBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Pagination_PageNumberTab_C, Selected) == 0x000330, "Member 'UWBP_Pagination_PageNumberTab_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_Pagination_PageNumberTab_C, Page) == 0x000334, "Member 'UWBP_Pagination_PageNumberTab_C::Page' has a wrong offset!");

}

