#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CategoryContainer_Customize

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CategoryContainer_Customize.WBP_CategoryContainer_Customize_C
// 0x0058 (0x0360 - 0x0308)
class UWBP_CategoryContainer_Customize_C final : public UGymGuiGenericTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWPB_CategoryButton_Customize_C*        Accessories;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        Character;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        Gloves;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        Hair;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        Headwear;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        Lowerbody;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        Shoes;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWPB_CategoryButton_Customize_C*        Upperbody;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        ButtonWidgets;                                     // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CategoryContainer_Customize(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CategoryContainer_Customize_C">();
	}
	static class UWBP_CategoryContainer_Customize_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CategoryContainer_Customize_C>();
	}
};
static_assert(alignof(UWBP_CategoryContainer_Customize_C) == 0x000008, "Wrong alignment on UWBP_CategoryContainer_Customize_C");
static_assert(sizeof(UWBP_CategoryContainer_Customize_C) == 0x000360, "Wrong size on UWBP_CategoryContainer_Customize_C");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, UberGraphFrame) == 0x000308, "Member 'UWBP_CategoryContainer_Customize_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, Accessories) == 0x000310, "Member 'UWBP_CategoryContainer_Customize_C::Accessories' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, Character) == 0x000318, "Member 'UWBP_CategoryContainer_Customize_C::Character' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, Gloves) == 0x000320, "Member 'UWBP_CategoryContainer_Customize_C::Gloves' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, Hair) == 0x000328, "Member 'UWBP_CategoryContainer_Customize_C::Hair' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, Headwear) == 0x000330, "Member 'UWBP_CategoryContainer_Customize_C::Headwear' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, Lowerbody) == 0x000338, "Member 'UWBP_CategoryContainer_Customize_C::Lowerbody' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, Shoes) == 0x000340, "Member 'UWBP_CategoryContainer_Customize_C::Shoes' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, Upperbody) == 0x000348, "Member 'UWBP_CategoryContainer_Customize_C::Upperbody' has a wrong offset!");
static_assert(offsetof(UWBP_CategoryContainer_Customize_C, ButtonWidgets) == 0x000350, "Member 'UWBP_CategoryContainer_Customize_C::ButtonWidgets' has a wrong offset!");

}

