#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AbilitySecondaryIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AbilitySecondaryIcon.WBP_AbilitySecondaryIcon_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_AbilitySecondaryIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 AbilityIcon;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_AbilitySecondaryIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AbilitySecondaryIcon_C">();
	}
	static class UWBP_AbilitySecondaryIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AbilitySecondaryIcon_C>();
	}
};
static_assert(alignof(UWBP_AbilitySecondaryIcon_C) == 0x000008, "Wrong alignment on UWBP_AbilitySecondaryIcon_C");
static_assert(sizeof(UWBP_AbilitySecondaryIcon_C) == 0x0002D8, "Wrong size on UWBP_AbilitySecondaryIcon_C");
static_assert(offsetof(UWBP_AbilitySecondaryIcon_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_AbilitySecondaryIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AbilitySecondaryIcon_C, AbilityIcon) == 0x0002C8, "Member 'UWBP_AbilitySecondaryIcon_C::AbilityIcon' has a wrong offset!");
static_assert(offsetof(UWBP_AbilitySecondaryIcon_C, IconTexture) == 0x0002D0, "Member 'UWBP_AbilitySecondaryIcon_C::IconTexture' has a wrong offset!");

}

