#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlaymenuButton_Green

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlaymenuButton_Green.WBP_PlaymenuButton_Green_C
// 0x0068 (0x0350 - 0x02E8)
class UWBP_PlaymenuButton_Green_C final : public UGymGuiGenericButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PushAnim;                                          // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HoverBorder;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Spinner;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ContentText;                                       // 0x0328(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          AllowScrolling;                                    // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMaxWidth;                                       // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxWidth;                                          // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlaymenuButton_AllLevelsButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PlaymenuButton_AllLevelsButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PlaymenuButton_Horizontal_ButtonObject_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_PlaymenuButton_Green(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetProcessing(bool Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlaymenuButton_Green_C">();
	}
	static class UWBP_PlaymenuButton_Green_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlaymenuButton_Green_C>();
	}
};
static_assert(alignof(UWBP_PlaymenuButton_Green_C) == 0x000008, "Wrong alignment on UWBP_PlaymenuButton_Green_C");
static_assert(sizeof(UWBP_PlaymenuButton_Green_C) == 0x000350, "Wrong size on UWBP_PlaymenuButton_Green_C");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_PlaymenuButton_Green_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, PushAnim) == 0x0002F0, "Member 'UWBP_PlaymenuButton_Green_C::PushAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, HoverAnim) == 0x0002F8, "Member 'UWBP_PlaymenuButton_Green_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, ContentBorder) == 0x000300, "Member 'UWBP_PlaymenuButton_Green_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, HoverBorder) == 0x000308, "Member 'UWBP_PlaymenuButton_Green_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, SizeBox) == 0x000310, "Member 'UWBP_PlaymenuButton_Green_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, Spinner) == 0x000318, "Member 'UWBP_PlaymenuButton_Green_C::Spinner' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, Text) == 0x000320, "Member 'UWBP_PlaymenuButton_Green_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, ContentText) == 0x000328, "Member 'UWBP_PlaymenuButton_Green_C::ContentText' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, AllowScrolling) == 0x000340, "Member 'UWBP_PlaymenuButton_Green_C::AllowScrolling' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, UseMaxWidth) == 0x000341, "Member 'UWBP_PlaymenuButton_Green_C::UseMaxWidth' has a wrong offset!");
static_assert(offsetof(UWBP_PlaymenuButton_Green_C, MaxWidth) == 0x000348, "Member 'UWBP_PlaymenuButton_Green_C::MaxWidth' has a wrong offset!");

}

