#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GymGuiMetaPopupHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GymGuiMetaPopupHelper.WBP_GymGuiMetaPopupHelper_C
// 0x0030 (0x0360 - 0x0330)
class UWBP_GymGuiMetaPopupHelper_C : public UGymGuiMetaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UWidget*>                        HighlightableWidgets;                              // 0x0338(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          HandleNavigation;                                  // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnGamepadNavigated;                                // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GymGuiMetaPopupHelper(int32 EntryPoint);
	void InpActEvt_UIGamepadDown_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_UIGamepadInteract_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_UIGamepadLeft_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_UIGamepadRight_K2Node_InputActionEvent_4(const struct FKey& Key);
	void InpActEvt_UIGamepadUp_K2Node_InputActionEvent_0(const struct FKey& Key);
	void OnGamepadNavigated__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GymGuiMetaPopupHelper_C">();
	}
	static class UWBP_GymGuiMetaPopupHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GymGuiMetaPopupHelper_C>();
	}
};
static_assert(alignof(UWBP_GymGuiMetaPopupHelper_C) == 0x000008, "Wrong alignment on UWBP_GymGuiMetaPopupHelper_C");
static_assert(sizeof(UWBP_GymGuiMetaPopupHelper_C) == 0x000360, "Wrong size on UWBP_GymGuiMetaPopupHelper_C");
static_assert(offsetof(UWBP_GymGuiMetaPopupHelper_C, UberGraphFrame) == 0x000330, "Member 'UWBP_GymGuiMetaPopupHelper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GymGuiMetaPopupHelper_C, HighlightableWidgets) == 0x000338, "Member 'UWBP_GymGuiMetaPopupHelper_C::HighlightableWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_GymGuiMetaPopupHelper_C, HandleNavigation) == 0x000348, "Member 'UWBP_GymGuiMetaPopupHelper_C::HandleNavigation' has a wrong offset!");
static_assert(offsetof(UWBP_GymGuiMetaPopupHelper_C, OnGamepadNavigated) == 0x000350, "Member 'UWBP_GymGuiMetaPopupHelper_C::OnGamepadNavigated' has a wrong offset!");

}

