#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoteWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoteWidget.WBP_VoteWidget_C
// 0x00B8 (0x0378 - 0x02C0)
class UWBP_VoteWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ChangeVote;                                        // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowContainer;                                     // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BotBG;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonPromptContainer;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Cancel;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       CancelInputActionUI;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ContainerReady;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       ForceStartInputActionUI;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InfoText;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Join;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionUI_C*                       JoinInputActionUI;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             JoinText;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MasterCanvas;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MidBG;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerCount;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Start;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Timer;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBG;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGymPlayerState*                        PlayerState;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGymGameState*                          GameState;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EVoteState                                    CurrentVoteState;                                  // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentHasvoted;                                   // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0372(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_VoteWidget(int32 EntryPoint);
	void FormatTime(double Time, class FText* Out);
	void OnVotedChanged(bool bDidVote);
	void OnVoteEnded(EVoteState VoteResult, bool bDidVote);
	void OnVoteStarted();
	void OnVoteStateChanged(EVoteState VoteState);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TickUI();
	void TryInit();
	void UpdateCancelVisibility();
	void UpdateInfoText();
	void UpdateJoinMatchVisibility();
	void UpdateJoinText();
	void UpdatePlayerCount();
	void UpdateStartVisibility();
	void UpdateTexts();
	void UpdateTimerText();
	void UpdateVisibility();
	void UpdateVoteButtonVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoteWidget_C">();
	}
	static class UWBP_VoteWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoteWidget_C>();
	}
};
static_assert(alignof(UWBP_VoteWidget_C) == 0x000008, "Wrong alignment on UWBP_VoteWidget_C");
static_assert(sizeof(UWBP_VoteWidget_C) == 0x000378, "Wrong size on UWBP_VoteWidget_C");
static_assert(offsetof(UWBP_VoteWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_VoteWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, ChangeVote) == 0x0002C8, "Member 'UWBP_VoteWidget_C::ChangeVote' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, ShowContainer) == 0x0002D0, "Member 'UWBP_VoteWidget_C::ShowContainer' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, BotBG) == 0x0002D8, "Member 'UWBP_VoteWidget_C::BotBG' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, ButtonPromptContainer) == 0x0002E0, "Member 'UWBP_VoteWidget_C::ButtonPromptContainer' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, Cancel) == 0x0002E8, "Member 'UWBP_VoteWidget_C::Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, CancelInputActionUI) == 0x0002F0, "Member 'UWBP_VoteWidget_C::CancelInputActionUI' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, ContainerReady) == 0x0002F8, "Member 'UWBP_VoteWidget_C::ContainerReady' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, ForceStartInputActionUI) == 0x000300, "Member 'UWBP_VoteWidget_C::ForceStartInputActionUI' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, Icon) == 0x000308, "Member 'UWBP_VoteWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, InfoText) == 0x000310, "Member 'UWBP_VoteWidget_C::InfoText' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, Join) == 0x000318, "Member 'UWBP_VoteWidget_C::Join' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, JoinInputActionUI) == 0x000320, "Member 'UWBP_VoteWidget_C::JoinInputActionUI' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, JoinText) == 0x000328, "Member 'UWBP_VoteWidget_C::JoinText' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, MasterCanvas) == 0x000330, "Member 'UWBP_VoteWidget_C::MasterCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, MidBG) == 0x000338, "Member 'UWBP_VoteWidget_C::MidBG' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, PlayerCount) == 0x000340, "Member 'UWBP_VoteWidget_C::PlayerCount' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, Start) == 0x000348, "Member 'UWBP_VoteWidget_C::Start' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, Timer) == 0x000350, "Member 'UWBP_VoteWidget_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, TopBG) == 0x000358, "Member 'UWBP_VoteWidget_C::TopBG' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, PlayerState) == 0x000360, "Member 'UWBP_VoteWidget_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, GameState) == 0x000368, "Member 'UWBP_VoteWidget_C::GameState' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, CurrentVoteState) == 0x000370, "Member 'UWBP_VoteWidget_C::CurrentVoteState' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, CurrentHasvoted) == 0x000371, "Member 'UWBP_VoteWidget_C::CurrentHasvoted' has a wrong offset!");
static_assert(offsetof(UWBP_VoteWidget_C, Initialized) == 0x000372, "Member 'UWBP_VoteWidget_C::Initialized' has a wrong offset!");

}

