#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_CategoryButton_Customize

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WPB_CategoryButton_Customize.WPB_CategoryButton_Customize_C.ExecuteUbergraph_WPB_CategoryButton_Customize
// 0x0090 (0x0090 - 0x0000)
struct WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0030(0x0014)()
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0050(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0064(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0078(0x0014)()
};
static_assert(alignof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize) == 0x000008, "Wrong alignment on WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize");
static_assert(sizeof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize) == 0x000090, "Wrong size on WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, EntryPoint) == 0x000000, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::EntryPoint' has a wrong offset!");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, K2Node_MakeStruct_SlateColor_2) == 0x000030, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, K2Node_MakeStruct_SlateColor_3) == 0x000050, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, K2Node_MakeStruct_SlateColor_4) == 0x000064, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize, K2Node_MakeStruct_SlateColor_5) == 0x000078, "Member 'WPB_CategoryButton_Customize_C_ExecuteUbergraph_WPB_CategoryButton_Customize::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");

// Function WPB_CategoryButton_Customize.WPB_CategoryButton_Customize_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WPB_CategoryButton_Customize_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_CategoryButton_Customize_C_PreConstruct) == 0x000001, "Wrong alignment on WPB_CategoryButton_Customize_C_PreConstruct");
static_assert(sizeof(WPB_CategoryButton_Customize_C_PreConstruct) == 0x000001, "Wrong size on WPB_CategoryButton_Customize_C_PreConstruct");
static_assert(offsetof(WPB_CategoryButton_Customize_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WPB_CategoryButton_Customize_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

