#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_LevelkitButton_Make

#include "Basic.hpp"


namespace SDK::Params
{

// Function WPB_LevelkitButton_Make.WPB_LevelkitButton_Make_C.ExecuteUbergraph_WPB_LevelkitButton_Make
// 0x0028 (0x0028 - 0x0000)
struct WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make) == 0x000008, "Wrong alignment on WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make");
static_assert(sizeof(WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make) == 0x000028, "Wrong size on WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make");
static_assert(offsetof(WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make, EntryPoint) == 0x000000, "Member 'WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make::EntryPoint' has a wrong offset!");
static_assert(offsetof(WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WPB_LevelkitButton_Make_C_ExecuteUbergraph_WPB_LevelkitButton_Make::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WPB_LevelkitButton_Make.WPB_LevelkitButton_Make_C.OnHoveredButton__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WPB_LevelkitButton_Make_C_OnHoveredButton__DelegateSignature final
{
public:
	class UWPB_LevelkitButton_Make_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_LevelkitButton_Make_C_OnHoveredButton__DelegateSignature) == 0x000008, "Wrong alignment on WPB_LevelkitButton_Make_C_OnHoveredButton__DelegateSignature");
static_assert(sizeof(WPB_LevelkitButton_Make_C_OnHoveredButton__DelegateSignature) == 0x000008, "Wrong size on WPB_LevelkitButton_Make_C_OnHoveredButton__DelegateSignature");
static_assert(offsetof(WPB_LevelkitButton_Make_C_OnHoveredButton__DelegateSignature, Button) == 0x000000, "Member 'WPB_LevelkitButton_Make_C_OnHoveredButton__DelegateSignature::Button' has a wrong offset!");

// Function WPB_LevelkitButton_Make.WPB_LevelkitButton_Make_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WPB_LevelkitButton_Make_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_LevelkitButton_Make_C_PreConstruct) == 0x000001, "Wrong alignment on WPB_LevelkitButton_Make_C_PreConstruct");
static_assert(sizeof(WPB_LevelkitButton_Make_C_PreConstruct) == 0x000001, "Wrong size on WPB_LevelkitButton_Make_C_PreConstruct");
static_assert(offsetof(WPB_LevelkitButton_Make_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WPB_LevelkitButton_Make_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

