#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_ItemButton_Customize

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WPB_ItemButton_Customize.WPB_ItemButton_Customize_C
// 0x0088 (0x0390 - 0x0308)
class UWPB_ItemButton_Customize_C final : public UGymGuiGenericTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Push;                                              // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CardBackground;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverStroke;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedIcon;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGymCharacterCustomizationGUIOption    Item;                                              // 0x0340(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__WPB_ItemButton_Customize_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WPB_ItemButton_Customize_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WPB_ItemButton_Customize(int32 EntryPoint);
	void Select();
	void Unselect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WPB_ItemButton_Customize_C">();
	}
	static class UWPB_ItemButton_Customize_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWPB_ItemButton_Customize_C>();
	}
};
static_assert(alignof(UWPB_ItemButton_Customize_C) == 0x000008, "Wrong alignment on UWPB_ItemButton_Customize_C");
static_assert(sizeof(UWPB_ItemButton_Customize_C) == 0x000390, "Wrong size on UWPB_ItemButton_Customize_C");
static_assert(offsetof(UWPB_ItemButton_Customize_C, UberGraphFrame) == 0x000308, "Member 'UWPB_ItemButton_Customize_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWPB_ItemButton_Customize_C, Push) == 0x000310, "Member 'UWPB_ItemButton_Customize_C::Push' has a wrong offset!");
static_assert(offsetof(UWPB_ItemButton_Customize_C, Hover) == 0x000318, "Member 'UWPB_ItemButton_Customize_C::Hover' has a wrong offset!");
static_assert(offsetof(UWPB_ItemButton_Customize_C, CardBackground) == 0x000320, "Member 'UWPB_ItemButton_Customize_C::CardBackground' has a wrong offset!");
static_assert(offsetof(UWPB_ItemButton_Customize_C, HoverStroke) == 0x000328, "Member 'UWPB_ItemButton_Customize_C::HoverStroke' has a wrong offset!");
static_assert(offsetof(UWPB_ItemButton_Customize_C, ItemImage) == 0x000330, "Member 'UWPB_ItemButton_Customize_C::ItemImage' has a wrong offset!");
static_assert(offsetof(UWPB_ItemButton_Customize_C, SelectedIcon) == 0x000338, "Member 'UWPB_ItemButton_Customize_C::SelectedIcon' has a wrong offset!");
static_assert(offsetof(UWPB_ItemButton_Customize_C, Item) == 0x000340, "Member 'UWPB_ItemButton_Customize_C::Item' has a wrong offset!");

}

