#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_ColorButton_Customize

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GYMGAME_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WPB_ColorButton_Customize.WPB_ColorButton_Customize_C
// 0x00A0 (0x03A8 - 0x0308)
class UWPB_ColorButton_Customize_C final : public UGymGuiGenericTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Push;                                              // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Color1;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Color2;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Color3;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverStroke;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedIcon;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColor                                 Primary_Color;                                     // 0x0348(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 Secondary_Color;                                   // 0x034C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 Tertiary_Color;                                    // 0x0350(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGymCharacterCustomizationGUIOption    Item;                                              // 0x0358(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__WPB_ColorButton_Customize_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WPB_ColorButton_Customize_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WPB_ColorButton_Customize(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Select();
	void Unselect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WPB_ColorButton_Customize_C">();
	}
	static class UWPB_ColorButton_Customize_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWPB_ColorButton_Customize_C>();
	}
};
static_assert(alignof(UWPB_ColorButton_Customize_C) == 0x000008, "Wrong alignment on UWPB_ColorButton_Customize_C");
static_assert(sizeof(UWPB_ColorButton_Customize_C) == 0x0003A8, "Wrong size on UWPB_ColorButton_Customize_C");
static_assert(offsetof(UWPB_ColorButton_Customize_C, UberGraphFrame) == 0x000308, "Member 'UWPB_ColorButton_Customize_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Hover) == 0x000310, "Member 'UWPB_ColorButton_Customize_C::Hover' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Push) == 0x000318, "Member 'UWPB_ColorButton_Customize_C::Push' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Color1) == 0x000320, "Member 'UWPB_ColorButton_Customize_C::Color1' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Color2) == 0x000328, "Member 'UWPB_ColorButton_Customize_C::Color2' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Color3) == 0x000330, "Member 'UWPB_ColorButton_Customize_C::Color3' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, HoverStroke) == 0x000338, "Member 'UWPB_ColorButton_Customize_C::HoverStroke' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, SelectedIcon) == 0x000340, "Member 'UWPB_ColorButton_Customize_C::SelectedIcon' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Primary_Color) == 0x000348, "Member 'UWPB_ColorButton_Customize_C::Primary_Color' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Secondary_Color) == 0x00034C, "Member 'UWPB_ColorButton_Customize_C::Secondary_Color' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Tertiary_Color) == 0x000350, "Member 'UWPB_ColorButton_Customize_C::Tertiary_Color' has a wrong offset!");
static_assert(offsetof(UWPB_ColorButton_Customize_C, Item) == 0x000358, "Member 'UWPB_ColorButton_Customize_C::Item' has a wrong offset!");

}

