#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_GameModeButton_Make

#include "Basic.hpp"

#include "GYMGAME_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WPB_GameModeButton_Make.WPB_GameModeButton_Make_C.ExecuteUbergraph_WPB_GameModeButton_Make
// 0x00A0 (0x00A0 - 0x0000)
struct WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0034(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuleDisplayInfo                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make) == 0x000008, "Wrong alignment on WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make");
static_assert(sizeof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make) == 0x0000A0, "Wrong size on WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, EntryPoint) == 0x000000, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::EntryPoint' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, K2Node_MakeStruct_SlateColor_1) == 0x000034, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, K2Node_Event_IsDesignTime) == 0x000048, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, CallFunc_Conv_StringToName_ReturnValue) == 0x00004C, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'WPB_GameModeButton_Make_C_ExecuteUbergraph_WPB_GameModeButton_Make::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WPB_GameModeButton_Make.WPB_GameModeButton_Make_C.OnHoveredButton__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WPB_GameModeButton_Make_C_OnHoveredButton__DelegateSignature final
{
public:
	class UWPB_GameModeButton_Make_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_GameModeButton_Make_C_OnHoveredButton__DelegateSignature) == 0x000008, "Wrong alignment on WPB_GameModeButton_Make_C_OnHoveredButton__DelegateSignature");
static_assert(sizeof(WPB_GameModeButton_Make_C_OnHoveredButton__DelegateSignature) == 0x000008, "Wrong size on WPB_GameModeButton_Make_C_OnHoveredButton__DelegateSignature");
static_assert(offsetof(WPB_GameModeButton_Make_C_OnHoveredButton__DelegateSignature, Button) == 0x000000, "Member 'WPB_GameModeButton_Make_C_OnHoveredButton__DelegateSignature::Button' has a wrong offset!");

// Function WPB_GameModeButton_Make.WPB_GameModeButton_Make_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WPB_GameModeButton_Make_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_GameModeButton_Make_C_PreConstruct) == 0x000001, "Wrong alignment on WPB_GameModeButton_Make_C_PreConstruct");
static_assert(sizeof(WPB_GameModeButton_Make_C_PreConstruct) == 0x000001, "Wrong size on WPB_GameModeButton_Make_C_PreConstruct");
static_assert(offsetof(WPB_GameModeButton_Make_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WPB_GameModeButton_Make_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

