#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_CategoryButton_Customize

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WPB_CategoryButton_Customize.WPB_CategoryButton_Customize_C
// 0x0058 (0x0360 - 0x0308)
class UWPB_CategoryButton_Customize_C final : public UGymGuiGenericTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Push;                                              // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StrokeBG;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0330(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Category;                                          // 0x0338(0x0018)(Edit, BlueprintVisible)
	bool                                          Selected;                                          // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CategoryId;                                        // 0x0354(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WPB_CategoryButton_Customize_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WPB_CategoryButton_Customize_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WPB_CategoryButton_Customize(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Select();
	void Unselect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WPB_CategoryButton_Customize_C">();
	}
	static class UWPB_CategoryButton_Customize_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWPB_CategoryButton_Customize_C>();
	}
};
static_assert(alignof(UWPB_CategoryButton_Customize_C) == 0x000008, "Wrong alignment on UWPB_CategoryButton_Customize_C");
static_assert(sizeof(UWPB_CategoryButton_Customize_C) == 0x000360, "Wrong size on UWPB_CategoryButton_Customize_C");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, UberGraphFrame) == 0x000308, "Member 'UWPB_CategoryButton_Customize_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, Push) == 0x000310, "Member 'UWPB_CategoryButton_Customize_C::Push' has a wrong offset!");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, IconImage) == 0x000318, "Member 'UWPB_CategoryButton_Customize_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, StrokeBG) == 0x000320, "Member 'UWPB_CategoryButton_Customize_C::StrokeBG' has a wrong offset!");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, TextBlock) == 0x000328, "Member 'UWPB_CategoryButton_Customize_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, Icon) == 0x000330, "Member 'UWPB_CategoryButton_Customize_C::Icon' has a wrong offset!");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, Category) == 0x000338, "Member 'UWPB_CategoryButton_Customize_C::Category' has a wrong offset!");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, Selected) == 0x000350, "Member 'UWPB_CategoryButton_Customize_C::Selected' has a wrong offset!");
static_assert(offsetof(UWPB_CategoryButton_Customize_C, CategoryId) == 0x000354, "Member 'UWPB_CategoryButton_Customize_C::CategoryId' has a wrong offset!");

}

