#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_LevelkitButton_Make

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KitData_structs.hpp"
#include "GYMGAME_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WPB_LevelkitButton_Make.WPB_LevelkitButton_Make_C
// 0x00D8 (0x03E0 - 0x0308)
class UWPB_LevelkitButton_Make_C final : public UGymGuiGenericTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Push;                                              // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomFade;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CardBackground;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverColor;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverStroke;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputPromptMinusInteract_C*        InputPromptMinusInteract;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LevelKitImage;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedIcon;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FKitData                               KitData;                                           // 0x0358(0x0068)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHoveredButton;                                   // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhoveredButton;                                 // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WPB_ItemButton_Customize_ButtonObject_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WPB_ItemButton_Customize_ButtonObject_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WPB_LevelkitButton_Make(int32 EntryPoint);
	void OnHoveredButton__DelegateSignature(class UWPB_LevelkitButton_Make_C* Button);
	void OnUnhoveredButton__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Select();
	void Unselect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WPB_LevelkitButton_Make_C">();
	}
	static class UWPB_LevelkitButton_Make_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWPB_LevelkitButton_Make_C>();
	}
};
static_assert(alignof(UWPB_LevelkitButton_Make_C) == 0x000008, "Wrong alignment on UWPB_LevelkitButton_Make_C");
static_assert(sizeof(UWPB_LevelkitButton_Make_C) == 0x0003E0, "Wrong size on UWPB_LevelkitButton_Make_C");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, UberGraphFrame) == 0x000308, "Member 'UWPB_LevelkitButton_Make_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, Push) == 0x000310, "Member 'UWPB_LevelkitButton_Make_C::Push' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, Hover) == 0x000318, "Member 'UWPB_LevelkitButton_Make_C::Hover' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, BottomFade) == 0x000320, "Member 'UWPB_LevelkitButton_Make_C::BottomFade' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, CardBackground) == 0x000328, "Member 'UWPB_LevelkitButton_Make_C::CardBackground' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, HoverColor) == 0x000330, "Member 'UWPB_LevelkitButton_Make_C::HoverColor' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, HoverStroke) == 0x000338, "Member 'UWPB_LevelkitButton_Make_C::HoverStroke' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, InputPromptMinusInteract) == 0x000340, "Member 'UWPB_LevelkitButton_Make_C::InputPromptMinusInteract' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, LevelKitImage) == 0x000348, "Member 'UWPB_LevelkitButton_Make_C::LevelKitImage' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, SelectedIcon) == 0x000350, "Member 'UWPB_LevelkitButton_Make_C::SelectedIcon' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, KitData) == 0x000358, "Member 'UWPB_LevelkitButton_Make_C::KitData' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, OnHoveredButton) == 0x0003C0, "Member 'UWPB_LevelkitButton_Make_C::OnHoveredButton' has a wrong offset!");
static_assert(offsetof(UWPB_LevelkitButton_Make_C, OnUnhoveredButton) == 0x0003D0, "Member 'UWPB_LevelkitButton_Make_C::OnUnhoveredButton' has a wrong offset!");

}

